{"name":"BTL","statements":[{"name":"PROC BTL","description":"The BTL procedure analyzes marker and trait data in order to find and characterize binary trait loci (BTL). Mixed model analysis of variance is used to find a locus or loci associated with a trait, and a maximum likelihood model is used to estimate the recombination and penetrance parameters for a given set of BTL. † The data consist of marker genotype and a binary trait for a set of individuals. Marker genotypes can be of single nucleotide polymorphisms (SNPs), microsatellite data, or any other kind of marker as long as it is a heritable unit that obeys the laws of transmission genetics. However, only biallelic markers can be used to estimate BTL parameters; multiallelic markers can be used to find BTL but not to estimate parameters. † The output of PROC BTL is a \"Model Statistics\" table that contains a sorted list of the BTL models evaluated by a user-specified model selection criterion (p-value by default). Additionally, the maximum likelihood parameter estimates for a selected BTL model are written to a \"Parameter Estimates\" table if the PARMEST statement is used. The penetrance parameters can be calculated for a specified set of recombination parameters, or alternatively, a grid search can be performed over a specified range of possible recombination parameters. Finally, a 100(1-α) confidence interval can be computed for the parameter estimates of a given model.","help":"PROC BTL <DATA=SAS-data-set> <MAP=SAS-data-set> <NOMCMPR> <NOPARMPR> <NOPRINT> <NOREGPR> <ORDER=DATA | FORMATTED | FREQ... >;     \n\tBY <DESCENDING> <NOTSORTED> ;\n    \n\tCLASS <TRUNCATE> ;\n    \n\tMARKER <ALL=number> <ALLUPTO=number> <BEST=number> ...;\n    \n\tMODEL <NOINT> ;\n    \n\tPARMEST <ALPHA=number> <BOOT=number> <CROSS=<BACK|B|DH | INTER|F>> ...;\n    \n\tPARMS <HOLD=value-list | EQCONS=value-list> <LOWERB=value-list> <NOBOUND> ...;\n    \n\tRANDOM <GDATA=SAS-data-set> <GROUP=effect> <LDATA=SAS-data-set> ...;\n    \n\tREPEATED <GROUP=effect> <LDATA=SAS-data-set> <LOCAL=<EXP | POM>> ...;\n    \n\tWEIGHT variable ;\n","arguments":[{"name":"DATA=","optional":true,"description":"Names the SAS data set to be used by PROC BTL. The default is the most recently created data set.","help":"DATA=SAS-data-set","type":"dataSet"},{"name":"MAP=","optional":true,"description":"Names the marker map data set to be used. It can include the variables Marker, Location, and Name and a user-designated linkage group variable. The user can specify the name of the numeric linkage group variable in the GROUP= option in the MARKER statement, and this data set must be sorted by this variable. The variable Marker must contain the names of the variables specified in the MARKER statement.","help":"MAP=SAS-data-set","type":"dataSet"},{"name":"NOMCMPR","optional":true,"description":"Suppresses the display of the \"Marker Class Means\" table.","type":"standalone"},{"name":"NOPARMPR","optional":true,"description":"Suppresses the display of the \"Parameter Estimates\" table.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses all output.","type":"standalone"},{"name":"NOREGPR","optional":true,"description":"Suppresses the display of the \"Model Statistics\" table.","type":"standalone"},{"name":"ORDER=","optional":true,"description":"Specifies the sorting order for the levels of all CLASS variables. This ordering determines which parameters in the model correspond to each level in the data.","help":"ORDER=DATA | FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"DATA","description":"Levels are sorted by the order of appearance in the input data set.","type":"standalone"},{"name":"FORMATTED","description":"Levels are sorted by the external formatted value, except for numeric variables with no explicit format, which are sorted by their unformatted (internal) value.","type":"standalone"},{"name":"FREQ","description":"Levels are sorted by the descending frequency count; levels with the most observations come first in the order.","type":"standalone"},{"name":"INTERNAL","description":"Levels are sorted by the unformatted value.","type":"standalone"}]}]},{"name":"BY","description":"You can specify a BY statement with PROC BTL to obtain separate analyses on observations in groups defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in the order of the BY variables. The variables are one or more variables in the input data set.","help":"BY <DESCENDING> <NOTSORTED> ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CLASS","description":"The CLASS statement names the classification variables to be used in the analysis. If the CLASS statement is used, it must appear before the MODEL statement. Classification variables can be either character or numeric. By default, class levels are determined from the entire formatted values of the CLASS variables. You can use formats to group values into levels.","help":"CLASS <TRUNCATE> ","arguments":[{"name":"TRUNCATE","optional":true,"followsDelimiter":"/","description":"Specifies that class levels should be determined using only the first 16 characters of the formatted values of CLASS variables.","type":"standalone"}]},{"name":"MARKER","description":"The MARKER statement lists the genetics marker variables used in constructing the BTL model. This statement is required, and at least one marker variable must be listed or an error will be generated. The MARKER statement is similar to a class statement, except the interaction effect for all the marker variables listed is implicitly added to the model, as in the following code: proc btl; marker m1 m2 m3; model trait; run; The model trait = m1xm2xm3 is fit by PROC BTL. Additionally, if the PARMEST statement is used, these markers are included in the calculated BTL model and the model recombination and penetrance parameters are estimated.","help":"MARKER <ALL=number> <ALLUPTO=number> <BEST=number> ...","arguments":[{"name":"ALL=","optional":true,"followsDelimiter":"/","description":"Requests that regression models be calculated for all combinations of number markers from the marker statement, where number is a positive integer. Note:If the ALL option is used, the PARMEST statement is ignored if specified. If this option and the ALLUPTO= option are omitted, then only a model including all markers is fit. This option cannot be used if ALLUPTO= is specified.","help":"ALL=number","type":"value"},{"name":"ALLUPTO=","optional":true,"followsDelimiter":"/","description":"Requests that regression models be calculated for all combinations of number and fewer markers from the marker statement; e.g., ALLUPTO=3 calculates all combinations of 3, 2, and 1 markers, where number is a positive integer.","help":"ALLUPTO=number","type":"value"},{"name":"BEST=","optional":true,"followsDelimiter":"/","description":"Requests that only the top number models be included in the output, where number is a positive integer. By default, all models are displayed. If the GROUP= option is used, number specifies the number of models per linkage group to include in the output. The ranking of the models is determined using the model selection criterion selected using the MC= option or the p-value of the likelihood ratio test by default.","help":"BEST=number","type":"value"},{"name":"GROUP=","optional":true,"followsDelimiter":"/","description":"Specifies the name of the linkage group variable in the map data set to be used in grouping the models in the \"Model Statistics\" output if the output contains single-gene models only. The output contains the models sorted by linkage group and by the criterion specified in the MC= option (or the likelihood ratio p-value by default). If the θs are not specified using the THETA option but are calculated using the MAP= data set, then θs between markers from different linkage groups are set to 0.5. Note:If this variable is specified, markers in the MAP= data set from the same linkage group must be in consecutive observations. Values for this variable must be nonnegative numbers; any negative values are treated as missing.","help":"GROUP=variable","type":"value"},{"name":"MC=","optional":true,"followsDelimiter":"/","description":"Specifies the model selection criterion used to sort models. The default value is the p-value from the likelihood ratio test (MC=P).","help":"MC=P | LRCHI | AIC | BIC | AICC","type":"choice","arguments":[{"name":"P","followsDelimiter":"/","description":"P model selection criterion","type":"standalone"},{"name":"LRCHI","followsDelimiter":"/","description":"LRCHI model selection criterion","type":"standalone"},{"name":"AIC","followsDelimiter":"/","description":"AIC model selection criterion","type":"standalone"},{"name":"BIC","followsDelimiter":"/","description":"BIC model selection criterion","type":"standalone"},{"name":"AICC","followsDelimiter":"/","description":"AICC model selection criterion","type":"standalone"}]}]},{"name":"MODEL","description":"The MODEL statement names a single dependent variable and the fixed effects. These user-specified fixed effects, along with the interaction effect of all the markers in the MARKER statement (that is implicitly added to the model if the MARKER statement is used), determine the X matrix of the mixed model. The specification of effects is the same as in the GLM procedure; however, unlike PROC GLM, you do not specify random effects in the MODEL statement. The MODEL statement is required. An intercept is included in the fixed-effects model by default. If no fixed effects or markers are specified, only this intercept term is fit. The intercept can be removed by using the NOINT option. The dependent variable can be of any type for the computation of model statistics; however, it needs to be a binary variable if the PARMEST statement is used with values 0 and 1.","help":"MODEL <NOINT> ","arguments":[{"name":"NOINT","optional":true,"followsDelimiter":"/","description":"Requests that no intercept be included in the model. An intercept is included by default.","type":"standalone"}]},{"name":"PARMEST","description":"The PARMEST statement requests that PROC BTL estimate the recombination and penetrance parameters for a BTL model containing the markers listed in the MARKER statement. The marker class means are calculated from the input data and written to a table. By default a grid search over the range of all possible values of the recombination parameters is performed, and the resulting penetrance values that are in range for each set of rs are displayed. Alternatively, a specific set of r values can be specified using the R option.","help":"PARMEST <ALPHA=number> <BOOT=number> <CROSS=<BACK|B|DH | INTER|F>> ...","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies that a confidence level of 100(1-number)% is to be used in forming bootstrap confidence intervals for the penetrance parameters when the BOOT= option is given. This value of number must be between 0 and 1, and is set to 0.05 by default.","help":"ALPHA=number","type":"value"},{"name":"BOOT=","optional":true,"description":"Requests that confidence intervals be calculated for the penetrance parameters by using number iterations of the bootstrap. You must input which recombination parameters (s) to use in the calculation by using the R option or an error is generated.","help":"BOOT=number","type":"value"},{"name":"CROSS=","optional":true,"description":"Specifies the type of cross for the input data set. The default is CROSS=BACK.","help":"CROSS=BACK|B|DH | INTER|F","type":"choice","arguments":[{"name":"BACK","description":"Backcross or, equivalently, DH for a doubled-haploid population.","help":"BACK|B|DH","type":"choice"},{"name":"INTER","description":"For an F intercross.","help":"INTER|F","type":"choice"}]},{"name":"GEN=","optional":true,"description":"Specifies the generation number of the offspring in the input data set. Valid values include any integer greater than or equal to one. The default is 1.","help":"GEN=number","type":"value"},{"name":"HETEROZYGOTE=","optional":true,"aliases":["HE="],"description":"Specifies the value for the heterozygous genotype used in the input data set. The default value is \"B\".","help":"HETEROZYGOTE=\"heterozygote\"","type":"value"},{"name":"HOMOZYGOTE2=","optional":true,"aliases":["HO2="],"description":"Specifies the value for the genotype homozygous in the parent 2 allele used in the input data set. The default value is \"C\".","type":"value"},{"name":"HOMOZYGOTE=","optional":true,"aliases":["HO="],"description":"Specifies the value for the homozygous genotype used in the input data set. The default value is \"A.\" If the experimental design is an F cross, then this is the genotype homozygous for the parent 1 allele.","help":"HOMOZYGOTE=\"homozygote\"","type":"value"},{"name":"LINKMOD=","optional":true,"description":"Specifies the model to be used to calculate the marker recombination parameters from the marker location values in the map data set. The default value is Haldane.","help":"LINKMOD=HALDANE|H | KOSAMBI|K","type":"choice","arguments":[{"name":"HALDANE","description":"Specifies the Heldane model.","help":"HALDANE|H","type":"choice"},{"name":"KOSAMBI","description":"Specifies the Kosambi model.","help":"KOSAMBI|K","type":"choice"}]},{"name":"LINKUNIT=","optional":true,"description":"Specifies the units used for the marker location variable in the marker data set. The options include centimorgans or recombination distance (kilobases). The default value is centimorgans.","help":"LINKUNIT=CM|C | RECDIST|R","type":"choice","arguments":[{"name":"CM","description":"Specifies the centimorgans unit.","help":"CM|C","type":"choice"},{"name":"RECDIST","description":"Specifies the recombination distance (kilobases) unit.","help":"RECDIST|R","type":"choice"}]},{"name":"OUTSTAT=","optional":true,"description":"Names the SAS data set to be used for the parameter estimates and, when the BOOT= option is specified, confidence intervals.","help":"OUTSTAT=SAS-data-set","type":"dataSet"},{"name":"PMAX=","optional":true,"description":"Specifies the highest penetrance value that is considered in range and included in the output. Any real number is a valid value as long as it is greater than PMIN. The PMAX option is ignored if the R option, which precludes a grid search, is used. By default, there is no upper limit for the range of penetrance values included in the output.","help":"PMAX=number","type":"value"},{"name":"PMIN=","optional":true,"description":"Specifies the lowest penetrance value that is considered in range and included in the output. Any real number is a valid value as long as it is less than PMAX. The PMIN option is ignored if the R option, which precludes a grid search, is used. By default, there is no lower limit for the range of penetrance values included in the output.","help":"PMIN=number","type":"value"},{"name":"R=","optional":true,"description":"Specifies the values of r(recombination parameters) used to estimate the penetrance parameters. There is one r for each of the k adjacent marker/BTL pairs, where k is the number of markers in the MARKER statement. A list of values can be given to specify a different r for each pair, or a single value can be specified to be used for all r. If there are fewer than k values specified, the last value given is used for the remaining r. If the R option is used to specify r, the grid search parameters (RSTART, REND, and RINC) are ignored. The R option is required if the BOOT= option is specified. These s are used to calculate the confidence intervals of the penetrance parameters in the bootstrap calculation. Each r must be a real number greater than or equal to 0 and less than 0.5, and invalid values are replaced by the default value of 0.","help":"R=number-list","type":"value"},{"name":"REND=","optional":true,"description":"Specifies the ending value for each recombination parameter in the grid search. The default value is 0.5. REND must be a real number greater than 0 and less than or equal to 0.5.","help":"REND=number","type":"value"},{"name":"RINC=","optional":true,"description":"Specifies the increment to be used for the recombination parameter grid search. The default value is 0.1. Any real number greater than 0 and less than or equal to 0.5 is valid.","help":"RINC=number","type":"value"},{"name":"RSTART=","optional":true,"description":"Specifies the starting value for each recombination parameter in the grid search. The default value is 0. RSTART must be a real number from 0 to (but not including) 0.5.","help":"RSTART=number","type":"value"},{"name":"SEED=","optional":true,"description":"Specifies the initial seed for the random number generator used for creating the bootstrap samples when the BOOT= option is given. The value for number must be an integer; the computer clock time is used if the option is omitted or the integer specified is less than or equal to 0.","help":"SEED=number","type":"value"},{"name":"THETA=","optional":true,"description":"Specifies the values of recombination probabilities between adjacent pairs of markers listed in the MARKER statement.","help":"THETA=number-list","type":"value"}]},{"name":"PARMS","description":"The PARMS statement specifies initial values for the covariance parameters, or it requests a grid search over the range of several values of these parameters. The value-list specification can take any of several forms: m -- a single value m1,m2,...,mn -- several values m to n -- a sequence where m equals the starting value, n equals the ending value, and the increment equals 1 m to n by i -- a sequence where m equals the starting value, n equals the ending value, and the increment equals i m1,m2 to m3 -- mixed values and sequences You can use the PARMS statement to input known parameters. You can also specify known parameters of g by using the GDATA= option in the RANDOM statement.","help":"PARMS <HOLD=value-list | EQCONS=value-list> <LOWERB=value-list> <NOBOUND> ...","arguments":[{"name":"HOLD=","optional":true,"followsDelimiter":"/","aliases":["EQCONS="],"description":"Specifies which parameter values PROC BTL should hold to equal the specified values.","type":"value"},{"name":"LOWERB=","optional":true,"followsDelimiter":"/","description":"Enables you to specify lower boundary constraints on the covariance parameters. The value-list specification is a list of numbers or missing values (.) separated by commas. You must list the numbers in the order that PROC BTL uses for the covariance parameters, and each number corresponds to the lower boundary constraint. A missing value instructs PROC BTL to use its default constraint, and if you do not specify numbers for all of the covariance parameters, PROC BTL assumes that the remaining ones are missing.","help":"LOWERB=value-list","type":"value"},{"name":"NOBOUND","optional":true,"followsDelimiter":"/","description":"Requests the removal of boundary constraints on covariance parameters. For example, variance components have a default lower boundary constraint of 0, and the NOBOUND option allows their estimates to be negative.","type":"standalone"},{"name":"NOITER","optional":true,"followsDelimiter":"/","description":"Requests that no Newton-Raphson iterations be performed and that PROC BTL use the best value from the grid search to perform inferences. By default, iterations begin at the best value from the PARMS grid search.","type":"standalone"},{"name":"NOPROFILE","optional":true,"followsDelimiter":"/","description":"Specifies a different computational method for the residual variance during the grid search. By default, PROC BTL estimates this parameter by using the profile likelihood when appropriate. The NOPROFILE option suppresses the profiling and uses the actual value of the specified variance in the likelihood calculations.","type":"standalone"},{"name":"OLS","optional":true,"followsDelimiter":"/","description":"Requests starting values corresponding to the usual general linear model. Specifically, all variances and covariances are set to zero except for the residual variance, which is set equal to its ordinary least-squares (OLS) estimate. This option is useful when the default MIVQUE0 procedure produces poor starting values for the optimization process.","type":"standalone"},{"name":"PARMSDATA=","optional":true,"followsDelimiter":"/","aliases":["PDATA="],"description":"Reads in covariance parameter values from a SAS data set. The data set should contain the EST or COVP1–COVPn variables.","help":"PARMSDATA=SAS-data-set","type":"dataSet"},{"name":"RATIOS","optional":true,"followsDelimiter":"/","description":"Indicates that ratios with the residual variance are specified instead of the covariance parameters themselves. The default is to use the individual covariance parameters.","type":"standalone"},{"name":"UPPERB=","optional":true,"followsDelimiter":"/","description":"Enables you to specify upper boundary constraints on the covariance parameters. The value-list specification is a list of numbers or missing values (.) separated by commas. You must list the numbers in the order that PROC BTL uses for the covariance parameters, and each number corresponds to the upper boundary constraint. A missing value instructs PROC BTL to use its default constraint, and if you do not specify numbers for all of the covariance parameters, PROC BTL assumes that the remaining ones are missing.","help":"UPPERB=value-list","type":"value"}]},{"name":"RANDOM","description":"The RANDOM statement defines the random effects constituting the γ vector in the mixed model. It can be used to specify traditional variance component models (as in the VARCOMP procedure) and to specify random coefficients. The random effects can be classification or continuous variables, and multiple RANDOM statements are possible. The purpose of the RANDOM statement is to define the Z matrix of the mixed model, the random effects in the γ vector, and the structure of G. The Z matrix is constructed exactly like the X matrix for the fixed effects, and the G matrix is constructed to correspond with the effects constituting Z. The structure of G is defined by using the TYPE= option.","help":"RANDOM <GDATA=SAS-data-set> <GROUP=effect> <LDATA=SAS-data-set> ...","arguments":[{"name":"GDATA=","optional":true,"followsDelimiter":"/","description":"Requests that the G matrix be read in from a SAS data set. This G matrix is assumed to be known; therefore, only R-side parameters from effects in the REPEATED statement are included in the Newton-Raphson iterations. If no REPEATED statement is specified, then only a residual variance is estimated.","help":"GDATA=SAS-data-set","type":"dataSet"},{"name":"GROUP=","optional":true,"followsDelimiter":"/","aliases":["GRP="],"description":"Defines an effect specifying heterogeneity in the covariance structure of G. All observations having the same level of the GROUP effect have the same covariance parameters. Each new level of the GROUP effect produces a new set of covariance parameters with the same structure as the original group. You should exercise caution in properly defining the GROUP effect, because strange covariance patterns can result from its misuse. Also, the GROUP effect can greatly increase the number of estimated covariance parameters, which can adversely affect the optimization process.","help":"GROUP=effect","type":"value"},{"name":"LDATA=","optional":true,"followsDelimiter":"/","description":"Reads the coefficient matrices associated with the TYPE=LIN(number) option. The data set must contain the variables PARM, ROW, COL1–COLn, or PARM, ROW, COL, VALUE. The PARM variable denotes which of the number coefficient matrices is currently being constructed, and the ROW, COL1–COLn, or ROW, COL, VALUE variables specify the matrix values, as they do with the RANDOM statement option GDATA=. Unspecified values of these matrices are set equal to 0.","help":"LDATA=SAS-data-set","type":"dataSet"},{"name":"RATIOS","optional":true,"followsDelimiter":"/","description":"Indicates that ratios with the residual variance are specified in the GDATA= data set instead of the covariance parameters themselves. The default GDATA= data set contains the individual covariance parameters.","type":"standalone"},{"name":"SUBJECT=","optional":true,"followsDelimiter":"/","aliases":["SUB="],"description":"Identifies the subjects in your mixed model. Complete independence is assumed across subjects; thus, for the RANDOM statement, the SUBJECT= option produces a block-diagonal structure in G with identical blocks. The Z matrix is modified to accommodate this block-diagonality. In fact, specifying a subject effect is equivalent to nesting all other effects in the RANDOM statement within the subject effect.","help":"SUBJECT=effect","type":"value"},{"name":"TYPE=","optional":true,"followsDelimiter":"/","description":"Specifies the covariance structure of G. Although a variety of structures are available, most applications call for either TYPE=VC or TYPE=UN. The TYPE=VC (variance components) option is the default structure, and it models a different variance component for each random effect. The TYPE=UN (unstructured) option is useful for correlated random coefficient models. For example, random intercept age / type=un subject=person; specifies a random intercept-slope model that has different variances for the intercept and slope and a covariance between them. You can also use TYPE=FA0(2) here to request a G estimate that is constrained to be nonnegative definite.","help":"TYPE=covariance-structure","type":"value"}]},{"name":"REPEATED","description":"The REPEATED statement is used to specify the R matrix in the mixed model. Its syntax is different from that of the REPEATED statement in PROC GLM. If no REPEATED statement is specified, R is assumed to be equal to σ²I.","help":"REPEATED <GROUP=effect> <LDATA=SAS-data-set> <LOCAL=<EXP | POM>> ...","arguments":[{"name":"GROUP=","optional":true,"followsDelimiter":"/","aliases":["GRP="],"description":"Defines an effect specifying heterogeneity in the covariance structure of R. All observations having the same level of the GROUP effect have the same covariance parameters. Each new level of the GROUP effect produces a new set of covariance parameters with the same structure as the original group. You should exercise caution in properly defining the GROUP effect, because strange covariance patterns can result from its misuse. Also, the GROUP effect can greatly increase the number of estimated covariance parameters, which can adversely affect the optimization process.","help":"GROUP=effect","type":"value"},{"name":"LDATA=","optional":true,"followsDelimiter":"/","description":"Reads the coefficient matrices associated with the TYPE=LIN(number) option. The data set must contain the variables PARM, ROW, COL1–COLn, or PARM, ROW, COL, VALUE. The PARM variable denotes which of the number coefficient matrices is currently being constructed, and the ROW, COL1–COLn, or ROW, COL, VALUE variables specify the matrix values, as they do with the RANDOM statement option GDATA=. Unspecified values of these matrices are set equal to 0.","help":"LDATA=SAS-data-set","type":"dataSet"},{"name":"LOCAL=","optional":true,"followsDelimiter":"/","description":"Requests that a diagonal matrix be added to R. With just the LOCAL option, this diagonal matrix equals σ²I, and σ² becomes an additional variance parameter that PROC BTL profiles out of the likelihood provided that you do not specify the NOPROFILE option in the PROC BTL statement. The LOCAL option is useful if you want to add an observational error to a time series structure (Jones and Boadi- Boateng 1991) or a nugget effect to a spatial structure (Cressie 1991).","help":"LOCAL=EXP | POM","type":"choice","arguments":[{"name":"EXP","followsDelimiter":"/","description":"Syntax: EXP(<effects>) Option produces exponential local effects, also known as dispersion effects, in a log-linear variance model.","type":"standalone"},{"name":"POM","followsDelimiter":"/","description":"Syntax: POM(POM-data-set) Specifies the power-of-the-mean structure. The SAS data set specified by POM-data-set contains the numeric variable Estimate (in previous releases, the variable name was required to be EST), and it has at least as many observations as there are fixed-effects parameters.","type":"standalone"}]},{"name":"LOCALW","optional":true,"followsDelimiter":"/","description":"Specifies that only the local effects and no others be weighted. By default, all effects are weighted. The LOCALW option is used in connection with the WEIGHT statement and the LOCAL option in the REPEATED statement.","type":"standalone"},{"name":"NOLOCALW","optional":true,"followsDelimiter":"/","description":"Specifies that only the nonlocal effects and no others be weighted. By default, all effects are weighted. The NONLOCALW option is used in connection with the WEIGHT statement and the LOCAL option in the REPEATED statement.","type":"standalone"},{"name":"SUBJECT=","optional":true,"followsDelimiter":"/","aliases":["SUB="],"description":"Identifies the subjects in your mixed model. Complete independence is assumed across subjects; therefore, the SUBJECT= option produces a block-diagonal structure in R with identical blocks. When the SUBJECT= effect consists entirely of classification variables, the blocks of R correspond to observations sharing the same level of that effect. These blocks are sorted according to this effect as well.","help":"SUBJECT=effect","type":"value"},{"name":"TYPE=","optional":true,"followsDelimiter":"/","description":"Specifies the covariance structure of the R matrix. The SUBJECT= option defines the blocks of R, and the TYPE= option specifies the structure of these blocks. The default structure is VC.","help":"TYPE=covariance-structure","type":"value"}]},{"name":"WEIGHT","description":"If you do not specify a REPEATED statement, the WEIGHT statement operates exactly like the one in PROC GLM. In this case PROC BTL replaces X'X and Z'Z with X'WX and Z'WZ, where W is the diagonal weight matrix. If you specify a REPEATED statement, then the WEIGHT statement replaces R with LRL, where L is a diagonal matrix with elements W^-1/2. Observations with nonpositive or missing weights are not included in the PROC BTL analysis.","help":"WEIGHT variable "}]}