{"name":"CASECONTROL","statements":[{"name":"PROC CASECONTROL","description":"Marker information can be used to help locate the genes that affect susceptibility to a disease. The CASECONTROL procedure is designed for the interpretation of marker data when random samples are available from the populations of unrelated individuals who are either affected or unaffected by the disease. Several tests are available in PROC CASECONTROL that compare marker allele and/or genotype frequencies in the two populations, with frequency differences indicating an association of the marker with the disease. Although such an association can point to the proximity of the marker and disease genes in the genome, it can also reflect population structure, so care is needed in interpreting the results; association does not necessarily imply linkage. † The three chi-square tests available for testing case-control genotypic data are the genotype case-control test, which tests for dominant allele effects on the disease penetrance, and the allele case-control test and linear trend test, which test for additive allele effects on the disease penetrance. Since the allele case-control test requires the assumption of Hardy-Weinberg equilibrium (HWE), it might be desirable to run the ALLELE procedure on the data to perform the HWE test on each marker.","help":"PROC CASECONTROL <ALLELE> <ALPHA=number> <DATA=SAS-data-set> <DELIMITER=’string’> <GENOCOL> <GENOTYPE> <INDIVIDUAL=variable> <MARKER=variable> <NDATA=SAS-data-set> <NULLSNPS=(variable list)> <OR> <OUTSTAT=SAS-data-set> <PERMS=number | EXACT=number> <PREFIX=prefix> <SEED=number> <TALL> <TREND> <VIF>;     \n\tBY <DESCENDING> <NOTSORTED> ;\n    \n\tSTRATA <INFO> <MISSING> ;\n    \n\tTRAIT variable ;\n    \n\tVAR variables ;\n","arguments":[{"name":"ALLELE","optional":true,"description":"Requests that the allele case-control test be performed. If none of the three test options (ALLELE, GENOTYPE, or TREND) are specified, then all three tests are performed by default.","type":"standalone"},{"name":"ALPHA=","optional":true,"description":"Specifies that a confidence level of 100(1-number)% is to be used in forming confidence intervals for odds ratios. The value of number must be between 0 and 1, and is set to 0.05 by default.","help":"ALPHA=*number*","type":"value"},{"name":"DATA=","optional":true,"description":"Names the input SAS data set to be used by PROC CASECONTROL. The default is to use the most recently created data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"DELIMITER=","optional":true,"description":"Indicates the string that is used to separate the two alleles that compose the genotypes contained in the variables specified in the VAR statement. This option is ignored if GENOCOL is not specified.","type":"value"},{"name":"GENOCOL","optional":true,"description":"Indicates that columns specified in the VAR statement contain genotypes instead of alleles. When this option is specified, there is one column per marker. The genotypes must consist of the two alleles separated by a delimiter. For a genotype with one missing allele, use a blank space to indicate a missing value; if both alleles are missing, either use a single missing value for the entire genotype or use the delimiter alone.","type":"standalone"},{"name":"GENOTYPE","optional":true,"description":"Requests that the genotype case-control test be performed. If none of the three test options (ALLELE, GENOTYPE, or TREND) are specified, then all three tests are performed by default.","type":"standalone"},{"name":"INDIVIDUAL=","optional":true,"aliases":["INDIV="],"description":"Specifies the individual ID variable when using the TALL option. This variable can be character or numeric.","help":"INDIVIDUAL=*variable*","type":"value"},{"name":"MARKER=","optional":true,"description":"Specifies the marker ID variable when using the TALL option. This variable contains the names of the markers that are used in all output and can be character or numeric.","help":"MARKER=*variable*","type":"value"},{"name":"NDATA=","optional":true,"description":"Names the input SAS data set containing names, or identifiers, for the markers used in the output. There must be a NAME variable in this data set, which should contain the same number of rows as there are markers in the input data set specified in the DATA= option.","help":"NDATA=*SAS-data-set*","type":"dataSet"},{"name":"NULLSNPS=","optional":true,"description":"Names the markers to be used in calculating the variance inflation factor for genomic control that is applied to the chi-square statistic(s) from the trend test. Only biallelic markers that are listed are used. Note that if GENOCOL is specified, there should be one variable for each marker listed; otherwise, there should be two variables per marker. By default, if VIF is specified in the PROC CASECONTROL statement, all biallelic markers listed in the VAR statement are used. This option must be specified if both the VIF option and the PERMS= option are used; otherwise the variance inflation factor is not applied. This option is ignored if the VIF option is not specified or if the TALL option is used.","type":"value"},{"name":"OR","optional":true,"description":"Requests that odds ratios based on allele counts for biallelic markers be included in the OUTSTAT= data set, along with (1–α)% confidence limits for the value specified in the ALPHA= option. Odds ratios are not reported for markers with more than two alleles.","type":"standalone"},{"name":"OUTSTAT=","optional":true,"description":"Names the output SAS data set containing counts for the two trait values, the chi-square statistics, degrees of freedom, and p-values for the tests performed. When this option is omitted, an output data set is created by default and named according to the DATAn convention.","help":"OUTSTAT=*SAS-data-set*","type":"dataSet"},{"name":"PERMS=","optional":true,"aliases":["EXACT="],"description":"Indicates that Monte Carlo estimates of the exact p-values for the case-control tests should be calculated instead of the p-values from the asymptotic χ² distribution. In each of the number permutation samples, the trait values are permuted among the individuals in the sample. Large values of number (10,000 or more) are usually recommended for accuracy, but long execution times can result, particularly with large data sets. When this option is omitted, no permutations are performed and p-values from the asymptotic χ² distribution are reported.","type":"value"},{"name":"PREFIX=","optional":true,"description":"Specifies a prefix to use in constructing names for marker variables in all output. For example, if PREFIX=VAR, the names of the variables are VAR1, VAR2, ..., VARn. Note that this option is ignored when the NDATA= option is specified, unless there are fewer names in the NDATA data set than there are markers; it is also ignored if the TALL option is specified, in which case the marker variable names are taken from the marker ID variable specified in the MARKER= option. Otherwise, if this option is omitted, PREFIX=M is the default when variables contain alleles; if GENOCOL is specified, then the names of the variables specified in the VAR statement are used as the marker names.","help":"PREFIX=*prefix*","type":"value"},{"name":"SEED=","optional":true,"description":"Specifies the initial seed for the random number generator used for permuting the data to calculate estimates of exact p-values. This option is ignored if PERMS= is not specified. The value for number must be an integer; the computer clock time is used if the option is omitted or an integer less than or equal to 0 is specified.","help":"SEED=*number*","type":"value"},{"name":"TALL","optional":true,"description":"Indicates that the input data set is of an alternative format. This tall-skinny format contains the following columns: two containing marker alleles (or one containing marker genotypes if GENOCOL is specified), one for the marker identifier, and one for the individual identifier. The MARKER= and INDIV= options must also be specified in order for this option to be in effect. Note that when this option is used, the DATA= data set must first be sorted by any BY variables, then sorted by the marker ID variable, and then sorted by the individual ID variable.","type":"standalone"},{"name":"TREND","optional":true,"description":"Requests that the linear trend test for allelic effects be performed. If none of the three test options (ALLELE, GENOTYPE, or TREND) are specified, then all three tests are performed by default.","type":"standalone"},{"name":"VIF","optional":true,"description":"Specifies that the variance inflation factor λ should be applied to the trend chi-square statistic for genomic control. This adjustment is applied only when the trend test is performed and to markers in the VAR statement that are biallelic.","type":"standalone"}]},{"name":"BY","description":"You can specify a BY statement with PROC ALLELE to obtain separate analyses on observations in groups defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in the order of the BY variables. The variables are one or more variables in the input data set.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"STRATA","description":"The STRATA statement names the variables defining strata or representing matched or nested sets of individuals in a case-control study. Each STRATA variable can be either character or numeric, and the formatted values of the STRATA variables determine the levels. Thus, you can also use formats to group values into levels.","help":"STRATA &lt;INFO&gt; &lt;MISSING&gt; ","arguments":[{"name":"INFO","optional":true,"followsDelimiter":"/","description":"Displays the \"Strata Information\" table, which includes the stratum number, levels of the STRATA variables that define the stratum, total number of individuals, and counts for the two trait values that define cases and controls in each stratum. Since the number of strata can be very large, this table is displayed only on request.","type":"standalone"},{"name":"MISSING","optional":true,"followsDelimiter":"/","description":"Treats missing values (‘.’, ‘.A’,...,‘.Z’ for numeric variables and blanks for character variables) as valid STRATA variable values.","type":"standalone"}]},{"name":"TRAIT","description":"The TRAIT statement identifies a binary variable indicating which individuals are cases and which are controls or a binary variable representing a dichotomous trait. This variable can be character or numeric, but it must have only two nonmissing levels.","help":"TRAIT variable "},{"name":"VAR","description":"The VAR statement identifies the variables containing either the marker alleles or, if GENOCOL is specified, the marker genotypes. The following number of variables should be specified in this statement for a data set containing m markers according to whether the options GENOCOL and TALL are used: o When both GENOCOL and TALL are specified, there should be 1 variable named containing marker genotypes. o When only TALL is specified, there should be 2 variables named containing marker alleles. o When only GENOCOL is specified, there should be m variables named, one for each marker containing marker genotypes. o When neither option is specified, there should be 2m variables named, two for each marker containing marker alleles. All variables specified must be of the same type, either character or numeric.","help":"VAR variables "}]}