{"name":"GIMPORT","statements":[{"name":"PROC GIMPORT","description":"Identifies the input file to be processed, and specifies its file type and format. Optionally specifies an output catalog.","help":"PROC GIMPORT &lt;FILEREF=cgm-fileref | 'external-file'&gt; &lt;FILETYPE=CGM&gt; &lt;FORMAT=BINARY | CHARACTER | CLEARTEXT&gt; &lt;GOUT=&lt;libref.&gt;output-catalog&gt;; ","arguments":[{"name":"FILEREF=","optional":true,"description":"Specifies the computer graphics metafile (CGM) that is input for PROC GIMPORT. Following are the possible values for FILEREF=: cgm-fileref a fileref that is associated with the CGM and that has been previously defined using a FILENAME statement or host command.","type":"value"},{"name":"FILETYPE=","optional":true,"description":"Specifies the type of the input file, that is, the graphics standard to which the file conforms. CGM is the only valid value for the FILETYPE= argument. If the FILETYPE= argument is omitted, an error is issued and the procedure stops.","help":"FILETYPE=CGM<i>CGM</i>","type":"value","arguments":[{"name":"CGM","description":"Specifies a CGM input file.","type":"standalone"}]},{"name":"FORMAT=","optional":true,"description":"Specifies the format of the input file. CGMs can be encoded in one of three formats.","help":"FORMAT=BINARY | CHARACTER | CLEARTEXT","type":"choice","arguments":[{"name":"BINARY","description":"Specifies binary encoding. It is not printable.","type":"standalone"},{"name":"CHARACTER","description":"Specifies an encoding suitable for transfer through networks that cannot support binary transfers. It is printable but not readable.","type":"standalone"},{"name":"CLEARTEXT","description":"Specifies a text format that can be read using a standard text editor.","type":"standalone"}]},{"name":"GOUT=","optional":true,"description":"Specifies the SAS catalog in which to save the graphics output produced by the GIMPORT procedure. If you omit the libref, SAS/GRAPH looks for the catalog in the temporary library called WORK and creates the catalog if it does not exist.","type":"value"}]}]}