{"name":"HPTMSCORE","statements":[{"name":"PROC HPTMSCORE","description":"For high-performance text mining, scoring is the process of applying the parsing and SVD projections to new textual data. The HPTMSCORE procedure performs this scoring of new documents, and its primary output is a document data set Outdocpro, which holds the reduced dimensional representation of the score collection. PROC HPTMSCORE uses some of the output data sets of the HPTMINE procedure as input data to ensure consistency between scoring and training. During scoring, the new textual data must be parsed with the same settings that the training data were parsed with, indexed using only the subset of terms that were used during training, and projected onto the reduced dimensional subspace of the singular value decomposition that was derived from the training data. The three data sets, Outconfig, Outterms and Svdu, which were created with PROC HPTMINE facilitate this process and serve as input to PROC HPTMSCORE with the CONFIG=, TERMS=, and SVDU= options, respectively. The purpose of these three data sets are summarized below under their respective options. † The HPTMSCORE procedure processes large-scale textual data in parallel to achieve efficiency and scalability. The following list summarizes the basic features of PROC HPTMSCORE: † o Functionalities related to document parsing, term-by-document matrix creation, and dimension reduction are integrated into one procedure to process data more efficiently. o Parsing and term-by-document matrix creation are performed in parallel. o Computation of document projection is performed in parallel. o Analysis can be performed on a massively parallel SAS high-performance appliance. o All phases of processing make use of a high degree of multithreading. o Input data can be read in parallel when the data source is the appliance database.","help":"PROC HPTMSCORE &lt;CONFIG=SAS-data-set&gt; &lt;DATA=SAS-data-set | DOC=SAS-data-set&gt; &lt;NOPRINT&gt; &lt;OUTPARENT=SAS-data-set&gt; &lt;SVDDOCPRO=SAS-data-set&gt; &lt;SVDU=SAS-data-set&gt; &lt;TERMS=SAS-data-set&gt;;     \n\tDOC_ID &lt;DUPLICATIONCHECK | DUPCHK&gt; ;\n    \n\tPERFORMANCE &lt;COMMIT=n&gt; &lt;CPUCOUNT=&lt;ACTUAL | &lt;num&gt;&gt;&gt; &lt;DATASERVER=“name”&gt; ...;\n    \n\tVARIABLE|VAR variable ;\n","arguments":[{"name":"CONFIG=","optional":true,"description":"Specifies the input SAS data set that contains configuration information for PROC HPTMSCORE. The data set used for this option should be the one generated by the OUTCONFIG option in the PARSE statement of the HPTMINE procedure during training.","help":"CONFIG=<i>SAS-data-set</i>","type":"dataSet"},{"name":"DATA=","optional":true,"aliases":["DOC="],"description":"Specifies the input SAS data set of documents to be used by PROC HPTMSCORE. The default is the most recently created data set. If PROC HPTMSCORE executes in MPP mode, the input data are distributed to memory on the appliance nodes and analyzed in parallel, unless the data are already distributed in the appliance database. When data are already distributed, PROC HPTMSCORE reads the data alongside the distributed database.","type":"value"},{"name":"NOPRINT","optional":true,"description":"Suppresses the generation of ODS output.","type":"standalone"},{"name":"OUTPARENT=","optional":true,"description":"Specifies the output data set to contain a compressed representation of the sparse term-by-document frequency matrix. The data set contains only the kept, representative terms, and the child frequencies are attributed to the corresponding parent.","help":"OUTPARENT=<i>SAS-data-set</i>","type":"dataSet"},{"name":"SVDDOCPRO=","optional":true,"description":"Specifies the output data set to contain the reduced dimensional projections for each document. The contents of this data set are formed by multiplying the term-by-document frequency matrix by the input data set that is specified in the SVDU= option and then normalizing the result.","help":"SVDDOCPRO=<i>SAS-data-set</i>","type":"dataSet"},{"name":"SVDU=","optional":true,"description":"Specifies the input data set that contains the U matrix, which is created during training by PROC HPTMINE. The data set contains the information needed to project each document into the reduced dimensional space.","help":"SVDU=<i>SAS-data-set</i>","type":"dataSet"},{"name":"TERMS=","optional":true,"description":"Specifies the input SAS data set of terms to be used by PROC HPTMSCORE. The data set used for this option should be the one generated by the OUTTERMS= option in the PARSE statement of the HPTMINE procedure during training. This data set conveys to PROC HPTMSCORE which terms should be used in the analysis, if they should be mapped to a parent, and assigns them a key that corresponds to the key used on the input data set that is specified by the SVDU= option.","help":"TERMS=<i>SAS-data-set</i>","type":"dataSet"}]},{"name":"DOC_ID","description":"This statement specifies the variable that contains the ID of each document. In the input data set, each row corresponds to one document. The ID of each document must be unique; it can be either a number or a string of characters.","help":"DOC_ID &lt;DUPLICATIONCHECK | DUPCHK&gt; ","arguments":[{"name":"DUPLICATIONCHECK","optional":true,"aliases":["DUPCHK"],"description":"Checks the uniqueness of the ID of each document. When this option is not specified, no duplication check is performed. When this option is specified in the DOC_ID statement and duplicate document IDs are detected, the HPTMSCORE procedure outputs a warning message, which shows the number of duplicate document IDs that have been detected.","type":"standalone"}]},{"name":"PERFORMANCE","description":"The PERFORMANCE statement defines performance parameters for multithreaded and distributed computing, passes variables about the distributed computing environment, and requests detailed results about the performance characteristics of the HPTMSCORE procedure. You can also use the PERFORMANCE statement to control whether the HPTMSCORE procedure executes in SMP or MPP mode.","help":"PERFORMANCE &lt;COMMIT=n&gt; &lt;CPUCOUNT=&lt;ACTUAL | &lt;num&gt;&gt;&gt; &lt;DATASERVER=“name”&gt; ...","arguments":[{"name":"COMMIT=","optional":true,"description":"This option specifies the minimum number of observations transferred from the client to the appliance necessary to update the SAS Log. For instance, if you specify COMMIT=5000, then every time the number of observations sent exceeds an integer multiple of 5000 a log message is produced. This message indicates the actual number of observations distributed, not the COMMIT= value that triggered the message.","help":"COMMIT=<i>n</i>","type":"value"},{"name":"CPUCOUNT=","optional":true,"description":"This argument specifies how many processors PROC HPBIN assumes are available on each host in the computing environment. Valid values for number are integers between 1 and 256, inclusive. Setting CPUCOUNT= to a value greater than the actual number of available CPUs might results in reduced performance. Specify CPUCOUNT=ACTUAL to set CPUCOUNT= to the number of processors physically available. This number can be less than the physical number of CPUs if the SAS process has been restricted by system administration tools. This option overrides the CPUCOUNT= SAS system option. If PROC HPBIN executes in SMP mode, then this option referes to the client machine of the SAS session. If PROC HPBIN executes in MPP mode, then this option applies the nodes on the appliance.","help":"CPUCOUNT=ACTUAL | &lt;num&gt;","type":"choice","arguments":[{"name":"ACTUAL","description":"Sets CPUCOUNT to the number of processors physically available. This number can be less than the physical number of CPUs if the SAS process has been restricted by system administration tools.","type":"standalone"},{"name":"<num>","description":"Replace <num> with an actual number. Setting CPUCOUNT= to a number greater than the actual number of available CPUs might result in reduced performance. This option overrides the CPUCOUNT= SAS system option.","type":"standalone"}]},{"name":"DATASERVER=","optional":true,"description":"Specifies the name of the server on Teradata systems as defined through the hosts file and as used in the LIBNAME statement for Teradata. For example, if the hosts file defines myservercop1 33.44.55.66 as the server for Teradata, then a LIBNAME specification would be as follows: libname TDLib teradata server=myserver user= password= database= ; A PERFORMANCE statement to induce running alongside the Teradata server would specify the following:","type":"value"},{"name":"DETAILS","optional":true,"description":"Specify this option to request a table that shows a timing breakdown of the procedure steps.","type":"standalone"},{"name":"HOST=","optional":true,"aliases":["GRIDHOST="],"description":"This option specifies the name of the appliance host. The HOST= option overrides the value of the GRIDHOST environment variable.","type":"value"},{"name":"INSTALL=","optional":true,"aliases":["INSTALLLOC="],"description":"This option specifies the directory where the High-Performance Analytics shared libraries are installed on the appliance. Specifying the INSTALL= option overrides the GRIDINSTALLLOC environment variable.","type":"value"},{"name":"NODES=","optional":true,"aliases":["NNODES="],"description":"This option specifies the number of nodes in the distributed computing environment, provided that the data are not processed alongside the database. Specify NODES=0 to indicate that you want to process the data in SMP mode on the client machine. If the input data are not alongside the database, this is the default setting. The HPBIN procedure then performs multithreaded analysis on the client. If the data are not read alongside the database, the NODES= option specifies the number of nodes on the appliance that are involved in the analysis. If the number of nodes can be modified by the application, you can specify a NODES= option where n exceeds the number of physical nodes on the appliance. The High-Performance Analytics software then oversubscribes the nodes and associates nodes with multiple units of work. For example, on a system with 16 appliance nodes, the following statement would oversubscribe the system by a factor of 3:","type":"value"},{"name":"NTHREADS=","optional":true,"description":"This option specifies the number of threads used for analytic computations and overrides the SAS system option THREADS | NOTHREADS. If you do not specify the NTHREADS= option, then the number of threads is determined based on the number of CPUs on the host machine where the analytic computations execute. By default, High-Performance Analytics procedures execute in multiple concurrent threads, unless you disable this behavior with the NOTHREADS system option or you specify NTHREADS=1 to force single-threaded execution. The value specified here must not exceed 256.","help":"NTHREADS=<i>n</i>","type":"value"},{"name":"TIMEOUT=","optional":true,"description":"This options specifies the length of time, in seconds, PROC HPBIN should wait for a connection to the appliance and to establish a connection back to the client. The default value for s is 120 seconds. If jobs are submitted to the appliance through workload management tools that might suspend access to the appliance for a longer period, you might want to increase the timeout value.","help":"TIMEOUT=<i>s</i>","type":"value"}]},{"name":"VARIABLE","description":"This statement specifies the variable that contains the text to be processed.","help":"VARIABLE|VAR variable "}]}