{"name":"ISHIKAWA","statements":[{"name":"PROC ISHIKAWA","description":"The Ishikawa diagram, also known as a cause-and-effect diagram or fishbone diagram, is one of the seven basic tools for quality improvement in Japanese industry. It is used to display the factors that affect a particular quality characteristic or problem. † An Ishikawa diagram is typically the result of a brainstorming session to improve a product, process, or service. The main goal is represented by a main arrow or trunk, and primary factors are represented as sub-arrows or branches. Secondary factors are then added as stems, tertiary factors as leaves, and so on.","help":"PROC ISHIKAWA &lt;DATA=SAS-data-set&gt; &lt;DESCRIPTION='description'&gt; &lt;NAME='name'&gt; &lt;NEW&gt; &lt;NOFS&gt;; ","arguments":[{"name":"DATA=","optional":true,"description":"Identifies the name of a SAS data set that specifies an existing Ishikawa diagram. By default, the procedure will prompt you to edit an existing Ishikawa diagram or start a new one. When you specify the DATA= option, the procedure bypasses this initial menu.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"DESCRIPTION=","optional":true,"description":"(No description available)","help":"DESCRIPTION='*description*'","type":"value"},{"name":"NAME=","optional":true,"description":"(No description available)","help":"NAME='*name*'","type":"value"},{"name":"NEW","optional":true,"description":"Starts a new Ishikawa diagram. By default, the procedure will prompt you to edit an existing Ishikawa diagram or start a new one. When you specify the NEW option, the procedure bypasses this initial menu and starts with a new diagram. Do not specify any other options when using the NEW option.","type":"standalone"},{"name":"NOFS","optional":true,"description":"Allows you to create hard copies of Ishikawa diagrams saved as SAS data sets without invoking the interactive features of the procedure. You must specify the DATA= option when you use the NOFS option.","type":"standalone"}]}],"interactive":true}