{"name":"PSMOOTH","statements":[{"name":"PROC PSMOOTH","description":"In the search for complex disease genes, linkage and/or association tests are often performed on markers from a genome-wide scan or SNPs from a finely scaled map. This means hundreds or even thousands of hypotheses are being simultaneously tested. Plotting the negative log p-values of all the marker tests will reveal many peaks that indicate significant test results, some of which are false positives. In order to reduce the number of false positives or improve power, smoothing methods can be applied that take into account p-values from neighboring, and possibly correlated, markers. That is, the peak length can be used to indicate significance in addition to the peak height. The PSMOOTH procedure offers smoothing methods that implement Simes’ method (1986), Fisher’s method (1932), and/or the truncated product method (TPM) (Zaykin et al. 2002) for multiple hypothesis testing. These methods modify the p-value from each marker test by using a function of its original p-value and the p-values of the tests on the nearest markers. Since the number of hypothesis tests being performed is not reduced, adjustments to correct the smoothed p-values for multiple testing are available as well. † PROC PSMOOTH can take any data set containing any number of columns of p-values as an input data set, including the output data sets from the CASECONTROL and FAMILY procedures.","help":"PROC PSMOOTH <ADJUST=NONE | BONFERRONI|BON | FDR... > <BANDWIDTH=number-list> <DATA=SAS-data-set> <FISHER> <NEGLOG> <NEGLOG10> <OUT=SAS-data-set> <SIMES> <TAU=number> <TPM>;     \n\tBY <DESCENDING> <NOTSORTED> ;\n    \n\tID variables ;\n    \n\tVAR variables ;\n","arguments":[{"name":"ADJUST=","optional":true,"description":"Indicates which adjustment for multiple testing to apply to the set(s) of p-values in the output data set. This adjustment is applied after any smoothing has occurred.","help":"ADJUST=NONE | BONFERRONI|BON | FDR | SIDAK","type":"choice","arguments":[{"name":"NONE","description":"Specifies no adjustment for multiple testing.","type":"standalone"},{"name":"BONFERRONI","description":"Specifies the Bonferroni method.","help":"BONFERRONI|BON","type":"choice"},{"name":"FDR","description":"Specifies the false discovery rate method.","type":"standalone"},{"name":"SIDAK","description":"Specifies the Sidak method.","type":"standalone"}]},{"name":"BANDWIDTH=","optional":true,"description":"Gives the values for the bandwidths to use in combining p-values. A bandwidth of w indicates that w p-values on each side of the original p-value are included in the combining method to create a sliding window of size 2w + 1.","help":"BANDWIDTH=number-list","type":"value"},{"name":"DATA=","optional":true,"description":"Names the input SAS data set to be used by PROC PSMOOTH. The default is to use the most recently created data set.","help":"DATA=SAS-data-set","type":"dataSet"},{"name":"FISHER","optional":true,"description":"Requests that Fisher’s method for combining p-values from multiple hypotheses be applied to the original p-values.","type":"standalone"},{"name":"NEGLOG","optional":true,"description":"Requests that all p-values, original and combined, be transformed to their negative log (base e) in the output data set; that is, for each p-value, -log(p-value) is reported in the OUT= data set. This option is useful for graphing purposes.","type":"standalone"},{"name":"NEGLOG10","optional":true,"description":"Requests that all p-values, original and combined, be transformed to their negative log (base 10) in the output data set; that is, for each p-value, -log10(p-value) is reported in the OUT= data set. This option is useful for graphing purposes.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Names the output SAS data set containing the original p-values and the new combined p-values. When this option is omitted, an output data set is created by default and named according to the DATAn convention.","help":"OUT=SAS-data-set","type":"dataSet"},{"name":"SIMES","optional":true,"description":"Requests that Simes’ method for combining p-values from multiple hypotheses be applied to the original p-values.","type":"standalone"},{"name":"TAU=","optional":true,"description":"Indicates the value of τ to be used in the TPM. The significance level for the tests can be used as the value for number, although this is not the only possibility. The value of number must be greater than 0 and less than or equal to 1. By default, number is set to 0.05. This option is ignored if the TPM option is not specified.","help":"TAU=number","type":"value"},{"name":"TPM","optional":true,"description":"Requests that the TPM for combining p-values from multiple hypotheses be applied to the original p-values.","type":"standalone"}]},{"name":"BY","description":"You can specify a BY statement with PROC PSMOOTH to obtain separate analyses on observations in groups defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in the order of the BY variables. The variables are one or more variables in the input data set.","help":"BY <DESCENDING> <NOTSORTED> ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"ID","description":"The ID statement identifies the variables from the DATA= data set that should be included in the OUT= data set.","help":"ID variables "},{"name":"VAR","description":"The VAR statement identifies the variables containing the original p-values on which the combining methods should be performed.","help":"VAR variables "}]}