{"name":"TRANS","statements":[{"name":"PROC TRANS","description":"Transportation networks are a special type of network, called bipartite networks, that have only supply and demand nodes and arcs directed from supply nodes to demand nodes. For these networks, data can be given most efficiently in a rectangular or matrix form. The TRANS procedure takes cost, capacity, and lower bound data in this form. The observations in these data sets correspond to supply nodes, and the variables correspond to demand nodes. † The TRANS procedure puts the solution in a single output data set. As with the other optimization procedures, the TRANS procedure defines a macro variable, named _ORTRANS, that has a character string that describes the solution status.","help":"PROC TRANS &lt;CAPACITY=SAS-data-set&gt; &lt;COST=SAS-data-set&gt; &lt;DEFCAPACITY=c&gt; &lt;DEFMINFLOW=s&gt; &lt;DEMAND=d&gt; &lt;MAXIMUM&gt; &lt;MINFLOW=SAS-data-set&gt; &lt;NOTHRUNET&gt; &lt;OUT=SAS-data-set&gt; &lt;THRUNET&gt;;     \n\tHEADNODE variables ;\n    \n\tSUPPLY variable ;\n    \n\tTAILNODE variable ;\n","arguments":[{"name":"CAPACITY=","optional":true,"description":"Names the SAS data set that contains the capacity on each arc in the transportation network. These data specify the maximum allowable flow on each network arc. If the CAPACITY= option is omitted, then the value of the DEFCAPACITY= option is used for each arc in the network.","help":"CAPACITY=<i>SAS-data-set</i>","type":"dataSet"},{"name":"COST=","optional":true,"description":"Names the SAS data set that contains the cost, supply, and demand data for the transportation network. If the COST= option is omitted, the most recently created SAS data set is used.","help":"COST=<i>SAS-data-set</i>","type":"dataSet"},{"name":"DEFCAPACITY=","optional":true,"description":"Specifies the default capacity for the arcs in the network. The default value of c is +∞.","help":"DEFCAPACITY=<i>c</i>","type":"value"},{"name":"DEFMINFLOW=","optional":true,"description":"Specifies the default minimum flow for the arcs in the network. The default value of s is 0.","help":"DEFMINFLOW=<i>s</i>","type":"value"},{"name":"DEMAND=","optional":true,"description":"Gives the number of the observation that contains the number of units demanded at each destination node. The default value of d is 1.0.","help":"DEMAND=<i>d</i>","type":"value"},{"name":"MAXIMUM","optional":true,"description":"Tells the procedure to maximize rather than minimize the objective function.","type":"standalone"},{"name":"MINFLOW=","optional":true,"description":"Names the SAS data set that contains the minimum flow data for the transportation network. These data specify the minimum required flow on each arc in the network. If the MINFLOW= option is omitted, then the value of the DEFMINFLOW= option is used for each arc in the network.","help":"MINFLOW=<i>SAS-data-set</i>","type":"dataSet"},{"name":"NOTHRUNET","optional":true,"description":"Tells PROC TRANS to drain away any excess supply (the amount that total supply exceeds total demand) or excess demand (the amount that total demand exceeds total supply). If total supply exceeds total demand and if a destination node demands d units of flow, then at least d units and maybe more will flow to that node. Similarly, if total demand exceeds total supply and if a source node supplies s units of flow, then at least s units and possibly more will flow from that node. If a transportation problem has unequal total supply and total demand, and you do not specify either the THRUNET or NOTHRUNET option, then PROC TRANS assumes that the problem is infeasible and does not proceed with the optimization.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Specifies a name for the output data set. If the OUT= option is omitted, the SAS System creates a data set and names it according to the DATAn convention.","help":"OUT=<i>SAS-data-set</i>","type":"dataSet"},{"name":"THRUNET","optional":true,"aliases":["ADDSUPPLY"],"description":"Tells the procedure to force through the network any excess supply (the amount that total supply exceeds total demand) or any excess demand (the amount that total demand exceeds total supply), as is required. If a transportation problem has unequal total supply and total demand, and you do not specify either THRUNET or NOTHRUNET, then PROC TRANS assumes that the problem is infeasible and does not proceed with the optimization.","type":"standalone"}]},{"name":"HEADNODE","description":"The HEADNODE statement is a list of SAS variables in the COST= data set. Some or all of these variables are in the CAPACITY= data set and the MINFLOW= data set. The names of these SAS variables are also the names of the destination nodes in the transportation problem.","help":"HEADNODE variables "},{"name":"SUPPLY","description":"The SUPPLY statement identifies the variable in the COST= data set that contains the number of units of supply at each supply node. The SUPPLY statement is required. Values of the SUPPLY variable must be numeric.","help":"SUPPLY variable "},{"name":"TAILNODE","description":"The TAILNODEstatement identifies the variable in all input data sets that names each of the source nodes. This variable is included in the output data set. The TAILNODE statement is required, and the values of the TAILNODE variable must be character.","help":"TAILNODE variable "}]}