{"Procedure":{"Name":"ALLELE","ProductGroup":"SAS/GENETICS","ProcedureHelp":{"#cdata":"Syntax: PROC ALLELE <options> ; \n    BY variables ; \n    POP variable </ options> ; \n    VAR variables ; \n    WITH variables ;      \n  \nThe ALLELE procedure performs preliminary analyses on genetic marker data. These \nanalyses serve to characterize the markers themselves or the population from which \nthey were sampled, and can also serve as the basis for joint analyses on markers and \ntraits. A genetic marker is any heritable unit that obeys the laws of transmission \ngenetics, and the analyses presented here assume the marker genotypes are determined \nwithout error. With an underlying assumption of random sampling, the analyses rest on \nthe multinomial distribution of marker alleles, and many standard statistical techniques \ncan be invoked with little modification. The ALLELE procedure uses the notation and \nconcepts described by Weir (1996); this is the reference for all equations and methods \nnot otherwise cited."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"ALLELEMIN=|AMIN=","ProcedureOptionHelp":{"#cdata":"[Syntax: ALLELEMIN=number] \n      \nIndicates that only alleles with a frequency greater than or equal to number should \nbe included in the \"Allele Frequencies\" table. By default, any allele that appears \nin a nonmissing genotype in the sample is included in the table. The value of number \nmust be between 0 and 1."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"ALPHA=","ProcedureOptionHelp":{"#cdata":"[Syntax: ALPHA=number] \n      \nSpecifies that a confidence level of 100(1-number)% is to be used in forming bootstrap \nconfidence intervals for estimates of allele frequencies and disequilibrium coefficients. \nThe value of number must be between 0 and 1, and is set to 0.05 by default."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"BOOTSTRAP=|BOOT=","ProcedureOptionHelp":{"#cdata":"[Syntax: BOOTSTRAP=number] \n      \nIndicates that bootstrap confidence intervals should be formed for the estimates \nof allele frequencies and one-locus disequilibrium coefficients by using number \nrandom samples. One thousand samples are usually recommended to form confidence \nintervals. If this statement is omitted, no confidence limits are reported."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"CORRCOEFF","ProcedureOptionHelp":{"#cdata":"Requests that the \"Linkage Disequilibrium Measures\" table be displayed and contain \nthe correlation coefficient r, a linkage disequilibrium measure."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nNames the input SAS data set to be used by PROC ALLELE. The default is to use the \nmost recently created data set."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"DELIMITER=","ProcedureOptionHelp":{"#cdata":"[Syntax: DELIMITER=’string’] \n      \nIndicates the string that is used to separate the two alleles that compose the \ngenotypes contained in the variables specified in the VAR statement. This option \nis ignored if GENOCOL is not specified."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"DELTA","ProcedureOptionHelp":{"#cdata":"Requests that the \"Linkage Disequilibrium Measures\" table be displayed and contain \nthe population attributable risk δ, a linkage disequilibrium measure. This option \nis ignored if HAPLO=NONE or NONEHWD."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"DPRIME","ProcedureOptionHelp":{"#cdata":"Requests that the \"Linkage Disequilibrium Measures\" table be displayed and contain \nLewontin’s D', a linkage disequilibrium measure."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"GENOCOL","ProcedureOptionHelp":{"#cdata":"Indicates that columns specified in the VAR statement contain genotypes instead of \nalleles. When this option is specified, there is one column per marker. The genotypes \nmust consist of the two alleles separated by a delimiter. For a genotype with one missing \nallele, use a blank space to indicate a missing value; if both alleles are missing, either \nuse a single missing value for the entire genotype or use the delimiter alone."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"GENOMIN=|GMIN=","ProcedureOptionHelp":{"#cdata":"[Syntax: GENOMIN=number] \n      \nIndicates that only genotypes with a frequency greater than or equal to number \nshould be included in the \"Genotype Frequencies\" table. By default, any genotype \nthat appears at least once in the sample is included in the table. The value of \nnumber must be between 0 and 1."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"HAPLO=","ProcedureOptionHelp":{"#cdata":"Indicates whether haplotype frequencies should not be used, haplotype frequencies \nshould be estimated, or observed haplotype frequencies in the data should be used. \nThis option affects all linkage disequilibrium tests and measures."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"NONE","@Value2":"EST","@Value3":"GIVEN","@Value4":"NONEHWD"},"ProcedureOptionToolTips":{"@ToolTip1":"The composite linkage disequilibrium (CLD) coefficient is used in place of the  usual linkage disequilibrium (LD) coefficient. In addition, the composite  haplotype frequencies are used to form the linkage disequilibrium measures  indicated by the options CORRCOEFF and DPRIME.","@ToolTip2":"The maximum likelihood estimates of the haplotype frequencies are used to calculate  the LD test statistic as well as the LD measures.","@ToolTip3":"Indicates that the haplotypes have been observed, and thus the observed haplotype  frequencies are used in the LD test statistic and measures.","@ToolTip4":"The composite linkage disequilibrium (CLD) coefficient is used in place of the  usual linkage disequilibrium (LD) coefficient. In addition, the composite  haplotype frequencies are used to form the linkage disequilibrium measures  indicated by the options CORRCOEFF and DPRIME."}},{"ProcedureOptionName":"HAPLOMIN=|HMIN=","ProcedureOptionHelp":{"#cdata":"[Syntax: HAPLOMIN=number] \n      \nIndicates that only haplotypes with a frequency greater than or equal to number should \nbe included in the \"Linkage Disequilibrium Measures\" table. By default, any haplotype \nthat appears in the sample (or is estimated to appear at least once) is included in the \ntable. The value of number must be between 0 and 1."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"INDIVIDUAL=|INDIV=","ProcedureOptionHelp":{"#cdata":"[Syntax: INDIVIDUAL=variable] \n      \nSpecifies the individual ID variable when using the TALL option. This variable \ncan be character or numeric."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"LOGNOTE","ProcedureOptionHelp":{"#cdata":"Requests that notes be written to the log indicating the status of the LD calculations."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"MARKER=","ProcedureOptionHelp":{"#cdata":"[Syntax: MARKER=variable] \n      \nSpecifies the marker ID variable when using the TALL option. This variable contains \nthe names of the markers that are used in all output and can be character or numeric."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"MAXDIST=","ProcedureOptionHelp":{"#cdata":"[Syntax: MAXDIST=number] \n      \nSpecifies the maximum distance possible between a pair of markers in order for linkage \ndisequilibrium calculations to be performed on that pair. If the NDATA= option is not \nspecified or the NDATA= data set does not contain a LOCATION variable, then the distance \nbetween a pair of markers is the number of markers apart that they are, assuming that \nmarkers are specified in the VAR statement in the physical order in which they appear \non a chromosome. For example, if MAXDIST=1 is specified, linkage disequilibrium measures \nand statistics are calculated only for pairs of markers that are one marker apart, such \nas M1 and M2, M2 and M3, and so on. If there is an NDATA= data set specified that contains \na LOCATION variable, then distances between markers are calculated as differences between \nvalues of this variable. Note that markers with missing values for the LOCATION variable \nare paired with all other markers for LD calculations. \n\nThe default value is MAXDIST=50."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NDATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: NDATA=SAS-data-set] \n      \nNames the input SAS data set containing names, or identifiers, for the markers \nused in the output. There must be a NAME variable in this data set, which should \ncontain the same number of rows as there are markers in the input data set specified \nin the DATA= option."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"NOFREQ","ProcedureOptionHelp":{"#cdata":"Suppresses the display of the \"Allele Frequencies\" and the \"Genotype Frequencies\" tables."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOPRINT","ProcedureOptionHelp":{"#cdata":"Suppresses the normal display of results. Note that this option temporarily disables \nthe Output Delivery System (ODS)."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"OUTSTAT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUTSTAT=SAS-data-set] \n      \nNames the output SAS data set containing the disequilibrium statistics, for both \nwithin-marker and between-marker disequilibria."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"PERMS=|EXACT=","ProcedureOptionHelp":{"#cdata":"[Syntax: PERMS=number | EXACT=number] \n      \nIndicates that Monte Carlo estimates of the exact p-values for the disequilibrium tests \nshould be calculated using number permutations. Large values of number (10,000 or more) \nare usually recommended for accuracy, but long execution times can result, particularly \nwith large data sets. When this option is omitted, no permutations are performed and \nasymptotic p-values are reported. If HAPLO=EST, then only the exact tests for Hardy-Weinberg \nequilibrium are performed; the exact tests for linkage disequilibrium cannot be performed \nsince haplotypes are unknown."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"PREFIX=","ProcedureOptionHelp":{"#cdata":"[Syntax: PREFIX=prefix] \n      \nSpecifies a prefix to use in constructing names for marker variables in all output. \nFor example, if PREFIX=VAR, the names of the variables are VAR1, VAR2, ..., VARn. \nNote that this option is ignored when the NDATA= option is specified, unless there \nare fewer names in the NDATA data set than there are markers; it is also ignored if \nthe TALL option is specified, in which case the marker variable names are taken from \nthe marker ID variable specified in the MARKER= option. Otherwise, if this option is \nomitted, PREFIX=M is the default when variables contain alleles; if GENOCOL is specified, \nthen the names of the variables specified in the VAR statement are used as the marker \nnames."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"PROPDIFF","ProcedureOptionHelp":{"#cdata":"Requests that the \"Linkage Disequilibrium Measures\" table be displayed and contain \nthe proportional difference d, a linkage disequilibrium measure. This option is \nignored if HAPLO=NONE or NONEHWD."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"RHO","ProcedureOptionHelp":{"#cdata":"Requests that the \"Linkage Disequilibrium Measures\" table be displayed and contain ρ, \na linkage disequilibrium measure, and its information Kρ. This option is ignored if \nHAPLO=NONE or NONEHWD."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"SEED=","ProcedureOptionHelp":{"#cdata":"[Syntax: SEED=number] \n      \nSpecifies the initial seed for the random number generator used for permuting the data \nin the exact tests and for the bootstrap samples. The value for number must be an integer; \nthe computer clock time is used if the option is omitted or the integer specified is less \nthan or equal to 0."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"TALL","ProcedureOptionHelp":{"#cdata":"Indicates that the input data set is of an alternative format. This format contains \nthe following columns: two containing marker alleles (or one containing marker \ngenotypes if GENOCOL is specified), one for the marker identifier, and one for \nthe individual identifier. The MARKER= and INDIV= options must also be specified \nfor this option to be in effect. Note that when this option is used, the DATA= \ndata set must first be sorted by any BY variables, then sorted by the marker ID \nvariable, and then sorted by the individual ID variable."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"YULESQ","ProcedureOptionHelp":{"#cdata":"Requests that the \"Linkage Disequilibrium Measures\" table be displayed and contain \nYule’s Q, a linkage disequilibrium measure. This option is ignored if HAPLO=NONE \nor NONEHWD."},"ProcedureOptionType":"S"}]},"ProcedureStatements":[{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nYou can specify a BY statement with PROC ALLELE to obtain separate analyses on \nobservations in groups defined by the BY variables. When a BY statement appears, \nthe procedure expects the input data set to be sorted in the order of the BY \nvariables. The variables are one or more variables in the input data set."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"POP","StatementHelp":{"#cdata":"Syntax: POP variable </ options> ; \n\nOne variable can be specified in the POP statement to designate population groups \nof individuals. By default, the appropriate F statistics, combined across all alleles \nand loci, are reported in the \"Combined F Statistics\" table. This statement is ignored \nif the TALL option is used."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"FPERMS=","StatementOptionHelp":{"#cdata":"[Syntax: FPERMS=number] \n          \nIndicates that number permutations of the data should be used to calculate p-values \nfor testing that the F statistics are significantly greater than 0. Large values of \nnumber (10,000 or more) are usually recommended for accuracy, but long execution times \ncan result, particularly with large data sets. When FPERMS=0 (the default) or the option \nis omitted, no p-values are reported."},"StatementOptionType":"V"},{"StatementOptionName":"INDIVLOCI","StatementOptionHelp":{"#cdata":"Requests that the F statistics be reported for each individual marker locus \nthat is represented in the VAR statement. When this option is specified, \nthe \"Marker F Statistics\" table is created."},"StatementOptionType":"S"},{"StatementOptionName":"ZEROF","StatementOptionHelp":{"#cdata":"Indicates that HWE should be assumed at all loci for the calculation of the F \nstatistics, thus reducing the number of parameters to be estimated."},"StatementOptionType":"S"}]}},{"StatementName":"VAR","StatementHelp":{"#cdata":"Syntax: VAR variables ; \n\nThe VAR statement identifies the variables containing either the marker alleles or, if \nGENOCOL is specified, the marker genotypes. The following number of variables should be \nspecified in this statement for a data set containing m markers according to whether the \noptions GENOCOL and TALL are used: \n\n  o When both GENOCOL and TALL are specified, there should be one variable named \n    containing marker genotypes. \n\n  o When only TALL is specified, there should be two variables named containing marker \n    alleles. \n\n  o When only GENOCOL is specified, there should be m variables named, one for each marker \n    containing marker genotypes. \n\n  o When neither option is specified, there should be 2m variables named, two for each \n    marker containing marker alleles. \n\nAll variables specified must be of the same type, either character or numeric."},"StatementOptions":null},{"StatementName":"WITH","StatementHelp":{"#cdata":"Syntax: WITH variables ; \n\nThe WITH statement has the same syntax as the VAR statement. It contains variables of \nalleles, or genotypes if GENOCOL is specified, from markers that you want to pair with \nthose specified in the VAR statement for linkage disequilibrium calculations. Each marker \nfrom the VAR statement is paired with each marker from the WITH statement for these \ntwo-marker statistics when the WITH statement is specified. The markers represented by \nvariables in this statement are not included in any of the single-marker calculations \n(marker summary statistics, allele frequencies, or genotype frequencies) and the associated \nODS tables. This statement facilitates the parallelization of the LD calculations. \n\nWhen the WITH statement is used, the MAXDIST= option is ignored. It cannot be used for \ndata in the tall format."},"StatementOptions":null}]},null]}}