{"Procedure":{"Name":"ARIMA","ProductGroup":"SAS/ETS","ProcedureHelp":{"#cdata":"Syntax: PROC ARIMA options ; \n    BY variables ; \n    IDENTIFY VAR=variable options ; \n    ESTIMATE options ; \n    OUTLIER options ; \n    FORECAST options ; \n\nThe ARIMA procedure analyzes and forecasts equally spaced univariate time series data, transfer \nfunction data, and intervention data by using the autoregressive integrated moving-average (ARIMA) \nor autoregressive moving-average (ARMA) model. An ARIMA model predicts a value in a response time \nseries as a linear combination of its own past values, past errors (also called shocks or innovations), \nand current and past values of other time series. \n\nThe ARIMA approach was first popularized by Box and Jenkins, and ARIMA models are often referred \nto as Box-Jenkins models. The general transfer function model employed by the ARIMA procedure was \ndiscussed by Box and Tiao (1975). When an ARIMA model includes other time series as input variables, \nthe model is sometimes referred to as an ARIMAX model. Pankratz (1991) refers to the ARIMAX model \nas dynamic regression. \n\nThe ARIMA procedure provides a comprehensive set of tools for univariate time series model identification, \nparameter estimation, and forecasting, and it offers great flexibility in the kinds of ARIMA or ARIMAX \nmodels that can be analyzed. The ARIMA procedure supports seasonal, subset, and factored ARIMA models; \nintervention or interrupted time series models; multiple regression analysis with ARMA errors; and \nrational transfer function models of any complexity. \n\nBefore you use PROC ARIMA, you should be familiar with Box-Jenkins methods, and you should exercise \ncare and judgment when you use the ARIMA procedure. The ARIMA class of time series models is complex \nand powerful, and some degree of expertise is needed to use them correctly."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nSpecifies the name of the SAS data set that contains the time series. If different DATA= \nspecifications appear in the PROC ARIMA and IDENTIFY statements, the one in the IDENTIFY \nstatement is used. If the DATA= option is not specified in either the PROC ARIMA or IDENTIFY \nstatement, the most recently created SAS data set is used."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"PLOTS=","ProcedureOptionHelp":{"#cdata":"Controls the plots produced through ODS Graphics. \n      \nSyntax: \n(1)PLOTS<(global-plot-options)> <= plot-request <(options)>> | \n(2)PLOTS<(global-plot-options)> <= (plot-request <(options)> <... plot-request <(options)>>)> \n    \nThe following global-plot-options are supported: \n\n  ONLY \n  suppresses the default plots. Only the plots specifically requested are produced. \n\n  UNPACK \n  breaks a graphic that is otherwise paneled into individual component plots."},"ProcedureOptionType":"S|V","ProcedureOptionValues":{"@Value1":"ALL","@Value2":"NONE","@Value3":"SERIES(<series-plot-options>)","@Value4":"RESIDUAL(<residual-plot-options>)","@Value5":"FORECAST(<forecast-plot-options>)"},"ProcedureOptionToolTips":{"@ToolTip1":"Produces all plots appropriate for the particular analysis.","@ToolTip2":"Suppresses all plots.","@ToolTip3":"Produces plots associated with the identification stage of the modeling. The panel plots  corresponding to the CORR and CROSSCORR options are produced by default. The following  series-plot-options are available:     ACF--produces the plot of autocorrelations.    ALL--produces all the plots associated with the identification stage.    CORR--produces a panel of plots that are useful in the trend and correlation analysis of the series.   CROSSCORR--produces panels of cross-correlation plots.   IACF--produces the plot of inverse-autocorrelations.   PACF--produces the plot of partial-autocorrelations.","@ToolTip4":"Produces the residuals plots. The residual correlation and normality diagnostic panels are  produced by default. The following residual-plot-options are available:     ACF--produces the plot of residual autocorrelations.   ALL--produces all the residual diagnostics plots appropriate for the particular analysis.   CORR--produces a summary panel of the residual correlation diagnostics.   HIST--produces the histogram of the residuals.   IACF--produces the plot of residual inverse-autocorrelations.   NORMAL--produces a summary panel of the residual normality diagnostics.   PACF--produces the plot of residual partial-autocorrelations.   QQ--produces the normal quantile plot of the residuals.   SMOOTH--produces a scatter plot of the residuals against time, which has an overlaid smooth fit.   WN--produces the plot of Ljung-Box white-noise test p-values at different lags.","@ToolTip5":"Produces the forecast plots in the forecasting stage. The following forecast-plot-options are  available:     ALL--produces the forecast-only plot as well as the forecast plot.   FORECAST--produces a plot that shows the one-step-ahead forecasts as well as the multistep-ahead forecasts.    FORECASTONLY--produces a plot that shows only the multistep-ahead forecasts in the forecast region."}},{"ProcedureOptionName":"OUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUT=SAS-data-set] \n      \nSpecifies a SAS data set to which the forecasts are output. If different OUT= specifications \nappear in the PROC ARIMA and FORECAST statements, the one in the FORECAST statement is used."},"ProcedureOptionType":"DV"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY variables ; \n\nA BY statement can be used in the ARIMA procedure to process a data set in groups of \nobservations defined by the BY variables. Note that all IDENTIFY, ESTIMATE, and FORECAST \nstatements specified are applied to all BY groups."},"StatementOptions":null},{"StatementName":"IDENTIFY","StatementHelp":{"#cdata":"Syntax: IDENTIFY VAR=variable options ; \n\nThe IDENTIFY statement specifies the time series to be modeled, differences the \nseries if desired, and computes statistics to help identify models to fit. Use an \nIDENTIFY statement for each time series that you want to model."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=significance-level] \n          \nThe ALPHA= option specifies the significance level for tests in the IDENTIFY statement.\nThe default is 0.05."},"StatementOptionType":"V"},{"StatementOptionName":"CENTER","StatementOptionHelp":{"#cdata":"Centers each time series by subtracting its sample mean. The analysis is done on the centered \ndata. Later, when forecasts are generated, the mean is added back. Note that centering is done \nafter differencing. The CENTER option is normally used in conjunction with the NOCONSTANT option \nof the ESTIMATE statement."},"StatementOptionType":"S"},{"StatementOptionName":"CLEAR","StatementOptionHelp":{"#cdata":"Deletes all old models. This option is useful when you want to delete old models so that \nthe input variables are not prewhitened."},"StatementOptionType":"S"},{"StatementOptionName":"CROSSCORR=","StatementOptionHelp":{"#cdata":"Syntax: CROSSCORR=variable (d11, d12, ..., d1k )\n    | CROSSCORR= (variable (d11, d12, ..., d1k )... variable (d21, d22, ..., d2k ))\n          \nNames the variables cross-correlated with the response variable given by the VAR= specification. \nEach variable name can be followed by a list of differencing lags in parentheses, the same as for \nthe VAR= specification. If differencing is specified for a variable in the CROSSCORR= list, the \ndifferenced series is cross-correlated with the VAR= option series, and the differenced series \nis used when the ESTIMATE statement INPUT= option refers to the variable."},"StatementOptionType":"V"},{"StatementOptionName":"DATA=","StatementOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n          \nSpecifies the input SAS data set that contains the time series. If the DATA= option is omitted, \nthe DATA= data set specified in the PROC ARIMA statement is used; if the DATA= option is omitted \nfrom the PROC ARIMA statement as well, the most recently created data set is used."},"StatementOptionType":"DV"},{"StatementOptionName":"ESACF","StatementOptionHelp":{"#cdata":"Computes the extended sample autocorrelation function and uses these estimates to tentatively \nidentify the autoregressive and moving-average orders of mixed models. \n\nThe ESACF option generates two tables. The first table displays extended sample autocorrelation \nestimates, and the second table displays probability values that can be used to test the significance \nof these estimates."},"StatementOptionType":"S"},{"StatementOptionName":"MINIC","StatementOptionHelp":{"#cdata":"Uses information criteria or penalty functions to provide tentative ARMA order identification. \nThe MINIC option generates a table that contains the computed information criterion associated \nwith various ARMA model orders."},"StatementOptionType":"S"},{"StatementOptionName":"NLAG=","StatementOptionHelp":{"#cdata":"[Syntax: NLAG=number] \n          \nIndicates the number of lags to consider in computing the autocorrelations and cross-correlations. \nTo obtain preliminary estimates of an ARIMA(p, d, q ) model, the NLAG= value must be at least p+q+d. \nThe number of observations must be greater than or equal to the NLAG= value. The default value for \nNLAG= is 24 or one-fourth the number of observations, whichever is less. Even though the NLAG= value \nis specified, the NLAG= value can be changed according to the data set. "},"StatementOptionType":"V"},{"StatementOptionName":"NOMISS","StatementOptionHelp":{"#cdata":"Uses only the first continuous sequence of data with no missing values. By default, all \nobservations are used."},"StatementOptionType":"S"},{"StatementOptionName":"NOPRINT","StatementOptionHelp":{"#cdata":"Suppresses the normal printout (including the correlation plots) generated by the IDENTIFY statement."},"StatementOptionType":"S"},{"StatementOptionName":"OUTCOV=","StatementOptionHelp":{"#cdata":"[Syntax: OUTCOV=SAS-data-set] '\n          \nWrites the autocovariances, autocorrelations, inverse autocorrelations, partial \nautocorrelations, and cross covariances to an output SAS data set. If the OUTCOV= \noption is not specified, no covariance output data set is created."},"StatementOptionType":"DV"},{"StatementOptionName":"P=","StatementOptionHelp":{"#cdata":"[Syntax: P=(Pmin : Pmax)] \n          \nSee the ESACF, MINIC, and SCAN options for details."},"StatementOptionType":"V"},{"StatementOptionName":"PERROR=","StatementOptionHelp":{"#cdata":"[Syntax: PERROR=(Pε,min : Pε,max)] \n          \nDetermines the range of the autoregressive model orders used to estimate the error series\nin MINIC, a tentative ARMA order identification method."},"StatementOptionType":"V"},{"StatementOptionName":"Q=","StatementOptionHelp":{"#cdata":"[Syntax: Q=(qmin : qmax)] \n          \nSee the ESACF, MINIC, and SCAN options for details."},"StatementOptionType":"V"},{"StatementOptionName":"SCAN","StatementOptionHelp":{"#cdata":"Computes estimates of the squared canonical correlations and uses these estimates to tentatively \nidentify the autoregressive and moving-average orders of mixed models. \n\nThe SCAN option generates two tables. The first table displays squared canonical correlation \nestimates, and the second table displays probability values that can be used to test the \nsignificance of these estimates."},"StatementOptionType":"S"},{"StatementOptionName":"STATIONARITY=","StatementOptionHelp":{"#cdata":"Performs stationarity tests. Stationarity tests can be used to determine whether differencing terms \nshould be included in the model specification. In each stationarity test, the autoregressive orders \n(o) can be specified by a range, test=ar-max, or as a list of values, test=(ar-1,...,ar-n), where \ntest is ADF, PP, or RW. The default is (0,1,2)."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"(ADF=o DLAG=s)","@Value2":"(PP=o)","@Value3":"(RW=o)"},"StatementOptionToolTips":{"@ToolTip1":"Performs augmented Dickey-Fuller tests. If the DLAG=s option is specified with s is greater  than one, seasonal Dickey-Fuller tests are performed. The maximum allowable value of s is 12. The default value of s is 1.","@ToolTip2":"Performs Phillips-Perron tests.","@ToolTip3":"Performs random-walk-with-drift tests."}},{"StatementOptionName":"VAR=","StatementOptionHelp":{"#cdata":"[Syntax: VAR=variable | VAR= variable ( d1, d2, ..., dk )] \n          \nNames the variable that contains the time series to analyze. The VAR= option is required. \n\nA list of differencing lags can be placed in parentheses after the variable name to request \nthat the series be differenced at these lags. For example, VAR=X(1) takes the first differences \nof X. VAR=X(1,1) requests that X be differenced twice, both times with lag 1, producing a second \ndifference series"},"StatementOptionType":"V"},{"StatementOptionName":"WHITENOISE=","StatementOptionHelp":{"#cdata":"Specifies the type of test statistic that is used in the white noise test of the series when \n the series contains missing values."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ST","@Value2":"IGNOREMISS"},"StatementOptionToolTips":{"@ToolTip1":"A modification of the Ljung-Box test is used. This is the default.","@ToolTip2":"The standard Ljung-Box test statistic is used."}}]}},{"StatementName":"ESTIMATE","StatementHelp":{"#cdata":"Syntax: <label:> ESTIMATE options ; \n\nThe ESTIMATE statement specifies an ARMA model or transfer function model for the \nresponse variable specified in the previous IDENTIFY statement, and produces estimates \nof its parameters. The ESTIMATE statement also prints diagnostic information by which \nto check the model. The label in the ESTIMATE statement is optional. Include an ESTIMATE \nstatement for each model that you want to estimate."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ALTPARM","StatementOptionHelp":{"#cdata":"Specifies the alternative parameterization of the overall scale of transfer functions in the model."},"StatementOptionType":"S"},{"StatementOptionName":"INPUT=","StatementOptionHelp":{"#cdata":"[Syntax: INPUT=variable | INPUT=( transfer-function variable ...)] \n          \nSpecifies input variables and their transfer functions. \n\nThe variables used on the INPUT= option must be included in the CROSSCORR= list in the \nprevious IDENTIFY statement. If any differencing is specified in the CROSSCORR= list, \nthen the differenced series is used as the input to the transfer function. \n\nThe transfer function specification for an input variable is optional. If no transfer \nfunction is specified, the input variable enters the model as a simple regressor."},"StatementOptionType":"V"},{"StatementOptionName":"METHOD=","StatementOptionHelp":{"#cdata":"Specifies the estimation method to use."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ML","@Value2":"ULS","@Value3":"CLS"},"StatementOptionToolTips":{"@ToolTip1":"Specifies the maximum likelihood method.","@ToolTip2":"Specifies the unconditional least squares method.","@ToolTip3":"Specifies the conditional least squares method."}},{"StatementOptionName":"NOCONSTANT","StatementOptionHelp":{"#cdata":"Suppresses the fitting of a constant (or intercept) parameter in the model. (That is, the \nparameter μ is omitted.)"},"StatementOptionType":"S"},{"StatementOptionName":"NOINT","StatementOptionHelp":{"#cdata":"Suppresses the fitting of a constant (or intercept) parameter in the model. (That is, the \nparameter μ is omitted.)"},"StatementOptionType":"S"},{"StatementOptionName":"NODF","StatementOptionHelp":{"#cdata":"Estimates the variance by dividing the error sum of squares (SSE) by the number of residuals. \nThe default is to divide the SSE by the number of residuals minus the number of free parameters \nin the model."},"StatementOptionType":"S"},{"StatementOptionName":"NOPRINT","StatementOptionHelp":{"#cdata":"Suppresses the normal printout generated by the ESTIMATE statement. If the NOPRINT option is \nspecified for the ESTIMATE statement, then any error and warning messages are printed to the \nSAS log."},"StatementOptionType":"S"},{"StatementOptionName":"P=","StatementOptionHelp":{"#cdata":"[Syntax: P=order | P=(lag, ..., lag ) ...(lag, ..., lag )] \n          \nSpecifies the autoregressive part of the model. By default, no autoregressive parameters are fit."},"StatementOptionType":"V"},{"StatementOptionName":"PLOT","StatementOptionHelp":{"#cdata":"Plots the residual autocorrelation functions. The sample autocorrelation, the sample inverse \nautocorrelation, and the sample partial autocorrelation functions of the model residuals are \nplotted."},"StatementOptionType":"S"},{"StatementOptionName":"Q=","StatementOptionHelp":{"#cdata":"[Syntax: Q=order | Q=(lag, ..., lag ) ...(lag, ..., lag )] \n          \nSpecifies the moving-average part of the model. By default, no moving-average part is included \nin the model."},"StatementOptionType":"V"},{"StatementOptionName":"WHITENOISE=","StatementOptionHelp":{"#cdata":"Specifies the type of test statistic that is used in the white noise test of the series when \nthe series contains missing values."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ST","@Value2":"IGNOREMISS"},"StatementOptionToolTips":{"@ToolTip1":"A modification of the Ljung-Box test is used. This is the default.","@ToolTip2":"The standard Ljung-Box test statistic is used."}},{"StatementOptionName":"OUTEST=","StatementOptionHelp":{"#cdata":"[Syntax: OUTEST=SAS-data-set] \n          \nWrites the parameter estimates to an output data set. If the OUTCORR or OUTCOV option \nis used, the correlations or covariances of the estimates are also written to the OUTEST= \ndata set. See the section OUTEST= Data Set for a description of the OUTEST= output data set."},"StatementOptionType":"DV"},{"StatementOptionName":"OUTCORR","StatementOptionHelp":{"#cdata":"Writes the correlations of the parameter estimates to the OUTEST= data set."},"StatementOptionType":"S"},{"StatementOptionName":"OUTCOV","StatementOptionHelp":{"#cdata":"Writes the covariances of the parameter estimates to the OUTEST= data set."},"StatementOptionType":"S"},{"StatementOptionName":"OUTMODEL=","StatementOptionHelp":{"#cdata":"[Syntax: OUTMODEL=SAS-data-set] \n          \nWrites the model and parameter estimates to an output data set. If OUTMODEL= is not specified, \nno model output data set is created."},"StatementOptionType":"DV"},{"StatementOptionName":"OUTSTAT=","StatementOptionHelp":{"#cdata":"[Syntax: OUTSTAT=SAS-data-set] \n          \nWrites the model diagnostic statistics to an output data set. If OUTSTAT= is not specified, \nno statistics output data set is created."},"StatementOptionType":"DV"},{"StatementOptionName":"AR=","StatementOptionHelp":{"#cdata":"[Syntax: AR=value ...] \n          \nLists starting values for the autoregressive parameters."},"StatementOptionType":"V"},{"StatementOptionName":"INITVAL=","StatementOptionHelp":{"#cdata":"[Syntax: INITVAL=(initializer-spec variable ...)] \n          \nSpecifies starting values for the parameters in the transfer function parts\nof the model."},"StatementOptionType":"V"},{"StatementOptionName":"MA=","StatementOptionHelp":{"#cdata":"[Syntax: MA=value ...] \n          \nLists starting values for the moving-average parameters."},"StatementOptionType":"V"},{"StatementOptionName":"MU=","StatementOptionHelp":{"#cdata":"[Syntax: MU=value] \n          \nSpecifies the MU parameter."},"StatementOptionType":"V"},{"StatementOptionName":"NOEST","StatementOptionHelp":{"#cdata":"Uses the values specified with the AR=, MA=, INITVAL=, and MU= options as final parameter \nvalues. The estimation process is suppressed except for estimation of the residual variance. \nThe specified parameter values are used directly by the next FORECAST statement. When NOEST \nis specified, standard errors, t values, and the correlations between estimates are displayed \nas 0 or missing. (The NOEST option is useful, for example, when you want to generate forecasts \nthat correspond to a published model.)"},"StatementOptionType":"S"},{"StatementOptionName":"BACKLIM=","StatementOptionHelp":{"#cdata":"[Syntax: BACKLIM=-n] \n          \nOmits the specified number of initial residuals from the sum of squares or likelihood function. \nOmitting values can be useful for suppressing transients in transfer function models that are \nsensitive to start-up values."},"StatementOptionType":"V"},{"StatementOptionName":"CONVERGE=","StatementOptionHelp":{"#cdata":"[Syntax: CONVERGE=value] \n          \nSpecifies the convergence criterion. Convergence is assumed when the largest change in the \nestimate for any parameter is less that the CONVERGE= option value. If the absolute value \nof the parameter estimate is greater than 0.01, the relative change is used; otherwise, the \nabsolute change in the estimate is used. The default is CONVERGE=0.001."},"StatementOptionType":"V"},{"StatementOptionName":"DELTA=","StatementOptionHelp":{"#cdata":"[Syntax: DELTA=value] \n          \nSpecifies the perturbation value for computing numerical derivatives. The default \nis DELTA=0.001."},"StatementOptionType":"V"},{"StatementOptionName":"GRID","StatementOptionHelp":{"#cdata":"Prints the error sum of squares (SSE) or concentrated log-likelihood surface in a small grid \nof the parameter space around the final estimates. For each pair of parameters, the SSE is \nprinted for the nine parameter-value combinations formed by the grid, with a center at the \nfinal estimates and with spacing given by the GRIDVAL= specification. The GRID option can \nhelp you judge whether the estimates are truly at the optimum, since the estimation process \ndoes not always converge. For models with a large number of parameters, the GRID option \nproduces voluminous output."},"StatementOptionType":"S"},{"StatementOptionName":"GRIDVAL=","StatementOptionHelp":{"#cdata":"[Syntax: GRIDVAL=number] \n          \nControls the spacing in the grid printed by the GRID option. The default is GRIDVAL=0.005."},"StatementOptionType":"V"},{"StatementOptionName":"MAXITER=|MAXIT=","StatementOptionHelp":{"#cdata":"[Syntax: MAXITER=n] \n          \nSpecifies the maximum number of iterations allowed. The default is MAXITER=50."},"StatementOptionType":"V"},{"StatementOptionName":"NOLS","StatementOptionHelp":{"#cdata":"Begins the maximum likelihood or unconditional least squares iterations from the preliminary \nestimates rather than from the conditional least squares estimates that are produced after four \niterations."},"StatementOptionType":"S"},{"StatementOptionName":"NOSTABLE","StatementOptionHelp":{"#cdata":"Specifies that the autoregressive and moving-average parameter estimates for the noise part \nof the model not be restricted to the stationary and invertible regions, respectively."},"StatementOptionType":"S"},{"StatementOptionName":"PRINTALL","StatementOptionHelp":{"#cdata":"Prints preliminary estimation results and the iterations in the final estimation process."},"StatementOptionType":"S"},{"StatementOptionName":"NOTFSTABLE","StatementOptionHelp":{"#cdata":"Specifies that the parameter estimates for the denominator polynomial of the transfer function \npart of the model not be restricted to the stability region. "},"StatementOptionType":"S"},{"StatementOptionName":"SINGULAR=","StatementOptionHelp":{"#cdata":"[Syntax: SINGULAR=value] \n          \nSpecifies the criterion for checking singularity. If a pivot of a sweep operation is less than \nthe SINGULAR= value, the matrix is deemed singular. Sweep operations are performed on the Jacobian \nmatrix during final estimation and on the covariance matrix when preliminary estimates are obtained. \nThe default is SINGULAR=1E–7."},"StatementOptionType":"V"}]}},{"StatementName":"OUTLIER","StatementHelp":{"#cdata":"Syntax: OUTLIER options ; \n\nThe OUTLIER statement can be used to detect shifts in the level of the response series that \nare not accounted for by the previously estimated model. An ESTIMATE statement must precede \nthe OUTLIER statement."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"TYPE=","StatementOptionHelp":{"#cdata":"Specifies the types of level shifts to search for."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ADDITIVE","@Value2":"SHIFT","@Value3":"TEMP(d1,...,dk)","@Value4":"(ADDITIVE SHIFT)","@Value5":"(ADDITIVE SHIFT TEMP(d1,...,dk))"},"StatementOptionToolTips":{"@ToolTip1":"Requests searching for additive outliers","@ToolTip2":"Requests searching for permanent level shifts.","@ToolTip3":"Requests searching for temporary changes in the level of durations d1,...,dk.","@ToolTip4":"Requests searching for additive outliers and permanent level shifts.","@ToolTip5":"Requests searching for additive outliers, permanent level shifts, and temporary changes  in the level of durations d1,...,dk."}},{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=significance-level] \n          \nSpecifies the significance level for tests in the OUTLIER statement. The default is 0.05."},"StatementOptionType":"V"},{"StatementOptionName":"SIGMA=","StatementOptionHelp":{"#cdata":"Specifies the type of error variance estimate to use in the statistical tests performed during \nthe outlier detection."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ROBUST","@Value2":"MSE"},"StatementOptionToolTips":{"@ToolTip1":"Corresponds to a robust estimate of the error variance. This is the default.","@ToolTip2":"Corresponds to the usual mean squared error (MSE) estimate"}},{"StatementOptionName":"MAXNUM=","StatementOptionHelp":{"#cdata":"[Syntax: MAXNUM=number] \n         \nLimits the number of outliers to search. The default is MAXNUM=5."},"StatementOptionType":"V"},{"StatementOptionName":"MAXPCT=","StatementOptionHelp":{"#cdata":"[Syntax: MAXPCT=number] \n          \nLimits the number of outliers to search for according to a percentage of the series length.\nThe default is MAXPCT=2. When both the MAXNUM= and MAXPCT= options are specified, the minimum \nof the two search numbers is used."},"StatementOptionType":"V"},{"StatementOptionName":"ID=","StatementOptionHelp":{"#cdata":"[Syntax: ID=Date-Time ID variable] \n          \nSpecifies a SAS date, time, or datetime identification variable to label the detected \noutliers. This variable must be present in the input data set."},"StatementOptionType":"V"}]}},{"StatementName":"FORECAST","StatementHelp":{"#cdata":"Syntax: FORECAST options ; \n\nThe FORECAST statement generates forecast values for a time series by using the parameter \nestimates produced by the previous ESTIMATE statement."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ALIGN=","StatementOptionHelp":{"#cdata":"[Syntax: ALIGN=option] \n          \nControls the alignment of SAS dates used to identify output observations."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BEGINNING","@Value2":"MIDDLE","@Value3":"ENDING"},"StatementOptionToolTips":{"@ToolTip1":"Alignment of SAS dates: beginning","@ToolTip2":"Alignment of SAS dates: middle","@ToolTip3":"Alignment of SAS dates: ending"}},{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=n] \n          \nSets the size of the forecast confidence limits. The ALPHA= value must be between 0 and 1. \nWhen you specify ALPHA=α, the upper and lower confidence limits have a 1 - α confidence level. \nThe default is ALPHA=0.05, which produces 95% confidence intervals. ALPHA values are rounded \nto the nearest hundredth."},"StatementOptionType":"V"},{"StatementOptionName":"BACK=","StatementOptionHelp":{"#cdata":"[Syntax: BACK=n] \n          \nSpecifies the number of observations before the end of the data where the multistep forecasts \nare to begin. The BACK= option value must be less than or equal to the number of observations \nminus the number of parameters. \n\nThe default is BACK=0, which means that the forecast starts at the end of the available data. \nThe end of the data is the last observation for which a noise value can be calculated. If there \nare no input series, the end of the data is the last nonmissing value of the response time series. \nIf there are input series, this observation can precede the last nonmissing value of the response \nvariable, since there may be missing values for some of the input series."},"StatementOptionType":"V"},{"StatementOptionName":"ID=","StatementOptionHelp":{"#cdata":"[Syntax: ID=variable] \n          \nNames a variable in the input data set that identifies the time periods associated with the \nobservations. The ID= variable is used in conjunction with the INTERVAL= option to extrapolate \nID values from the end of the input data to identify forecast periods in the OUT= data set. \n\nIf the INTERVAL= option specifies an interval type, the ID variable must be a SAS date or \ndatetime variable with the spacing between observations indicated by the INTERVAL= value. \nIf the INTERVAL= option is not used, the last input value of the ID= variable is incremented \nby one for each forecast period to extrapolate the ID values for forecast observations."},"StatementOptionType":"V"},{"StatementOptionName":"INTERVAL=","StatementOptionHelp":{"#cdata":"Specifies the time interval between observations. The value of the INTERVAL= option is used \nby PROC ARIMA to extrapolate the ID values for forecast observations and to check that the \ninput data are in order with no missing periods."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"DAY","@Value2":"HOUR","@Value3":"MINUTE","@Value4":"SECOND","@Value5":"WEEK","@Value6":"MONTH","@Value7":"YEAR","@Value8":"QTR","@Value9":"TENDAY","@Value10":"SEMIMONTH","@Value11":"SEMIYEAR","@Value12":"DTDAY","@Value13":"DTHOUR","@Value14":"DTMINUTE","@Value15":"DTSECOND","@Value16":"DTWEEK","@Value17":"DTMONTH","@Value18":"DTYEAR","@Value19":"DTQTR","@Value20":"DTSEMIMONTH","@Value21":"DTSEMIYEAR"},"StatementOptionToolTips":{"@ToolTip1":"DAY interval","@ToolTip2":"HOUR interval","@ToolTip3":"MINUTE interval","@ToolTip4":"SECOND interval","@ToolTip5":"WEEK interval","@ToolTip6":"MONTH interval","@ToolTip7":"YEAR interval","@ToolTip8":"QTR interval","@ToolTip9":"TENDAY interval","@ToolTip10":"SEMIMONTH interval","@ToolTip11":"SEMIYEAR interval","@ToolTip12":"Datetime DAY interval","@ToolTip13":"Datetime HOUR interval","@ToolTip14":"Datetime MINUTE interval","@ToolTip15":"Datetime SECOND interval","@ToolTip16":"Datetime WEEK interval","@ToolTip17":"Datetime MONTH interval","@ToolTip18":"Datetime YEAR interval","@ToolTip19":"Datetime QTR interval","@ToolTip20":"Datetime SEMIMONTH interval","@ToolTip21":"Datetime SEMIYEAR interval"}},{"StatementOptionName":"LEAD=","StatementOptionHelp":{"#cdata":"[Syntax: LEAD=n] \n          \nSpecifies the number of multistep forecast values to compute. For example, if LEAD=10, \nPROC ARIMA forecasts for ten periods beginning with the end of the input series (or earlier \nif BACK= is specified). It is possible to obtain fewer than the requested number of forecasts \nif a transfer function model is specified and insufficient data are available to compute the \nforecast. The default is LEAD=24. "},"StatementOptionType":"V"},{"StatementOptionName":"NOOUTALL","StatementOptionHelp":{"#cdata":"Includes only the final forecast observations in the OUT= output data set, not the one-step \nforecasts for the data before the forecast period."},"StatementOptionType":"S"},{"StatementOptionName":"NOPRINT","StatementOptionHelp":{"#cdata":"Suppresses the normal printout of the forecast and associated values."},"StatementOptionType":"S"},{"StatementOptionName":"OUT=","StatementOptionHelp":{"#cdata":"[Syntax: OUT=SAS-data-set] \n          \nWrites the forecast (and other values) to an output data set. If OUT= is not specified, \nthe OUT= data set specified in the PROC ARIMA statement is used. If OUT= is also not \nspecified in the PROC ARIMA statement, no output data set is created."},"StatementOptionType":"DV"},{"StatementOptionName":"PRINTALL","StatementOptionHelp":{"#cdata":"Prints the FORECAST computation throughout the whole data set. The forecast values for the \ndata before the forecast period (specified by the BACK= option) are one-step forecasts. "},"StatementOptionType":"S"},{"StatementOptionName":"SIGSQ=","StatementOptionHelp":{"#cdata":"[Syntax: SIGSQ=value] \n          \nSpecifies the variance term used in the formula for computing forecast standard errors \nand confidence limits. The default value is the variance estimate computed by the preceding \nESTIMATE statement. This option is useful when you wish to generate forecast standard errors \nand confidence limits based on a published model. It would often be used in conjunction with \nthe NOEST option in the preceding ESTIMATE statement."},"StatementOptionType":"V"}]}}]}}}