{"Procedure":{"Name":"BINNING","ProductGroup":"CAS","ProcedureHelp":{"#cdata":"Syntax: PROC BINNING DATA=CAS-libref.data-table < options > ;\n    CODE FILE=filename ;\n    FREQ variable ;\n    INPUT variables < / option > ;\n    OUTPUT OUT=CAS-libref.data-table < option > ;\n    TARGET variable / EVENT=“category” ;\n    \nBinning is a common step in the data preparation stage of the model-building process. You can use binning\nto classify missing variables, reduce the impact of outliers, and generate multiple effects. The generated\neffects are useful and contain certain nonlinear information about the original interval variables.\nThe BINNING procedure supports a few binning methods that are described in the following subsections.\nThe BINNING procedure can also calculate the weight of evidence (WOE) and information value (IV) based\non binning results."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"Syntax: DATA=CAS-libref.data-table\n      \nNames the input data table for PROC BINNING to use. CAS-libref.data-table is a two-level name,\nwhere\n\n  CAS-libref refers to a collection of information that is defined in the LIBNAME statement and\n    includes the caslib, which includes a path to the data, and a session identifier, which\n    defaults to the active session but which can be explicitly defined in the LIBNAME\n    statement.\n    \n  data-table specifies the name of the input data table."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"METHOD=","ProcedureOptionHelp":{"#cdata":"Syntax: METHOD=BUCKET| QUANTILE | WINSOR(RATE=) | CUTPTS(NUMLIST=)\n          \nSpecifies which binning method to use. You can specify one of the following methods:\n\n  BUCKET specifies the bucket binning method.\n  QUANTILE specifies the quantile binning method.\n  WINSOR(RATE=) specifies the Winsorized binning method and the rate that it uses. The range of\n  the RATE= suboption is between 0 and 0.5, exclusive.\n  CUTPTS(NUMLIST=) specifies the cut-points binning method and the bin lower and upper bounds."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"BUCKET","@Value2":"QUANTILE","@Value3":"WINSOR(RATE=)","@Value4":"CUTPTS(NUMLIST=)"},"ProcedureOptionToolTips":{"@ToolTip1":"Specifies the bucket binning method.","@ToolTip2":"Specifies the quantile binning method.","@ToolTip3":"Specifies the Winsorized binning method and the rate that it uses. The range of the RATE= suboption is between 0 and 0.5, exclusive.","@ToolTip4":"Specifies the cut-points binning method and the bin lower and upper bounds."},"SubOptionsKeywords":"RATE=|NUMLIST="},{"ProcedureOptionName":"NTHREADS=","ProcedureOptionHelp":{"#cdata":"Syntax: NTHREADS=number-of-threads\n      \nSpecifies the number of threads to be used. The default is the CPU count on each node. The number of\nthreads can be specified between 1 and 64, inclusive."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NUMBIN=","ProcedureOptionHelp":{"#cdata":"Syntax: NUMBIN=integer\n      \nSpecifies the global number of binning levels for all binning variables. The value of integer can be any\ninteger between 2 and 1,000, inclusive.\n\nBy default, NUMBIN=16."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"WOE","ProcedureOptionHelp":{"#cdata":"Syntax: WOE(WOEADJUST=number)\n      \nEnables computation of the weight of evidence and information values.\nWOEADJUST specifies the adjustment factor which is between 0 and 1, inclusive, for the weight-\nof-evidence calculation.\n\nBy default, WOEADJUST=0.5."},"ProcedureOptionType":"S","SubOptionsKeywords":"WOEADJUST="}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"CODE","StatementHelp":{"#cdata":"Syntax: CODE option ;\n      \nThe CODE statement generates score code and stores it in a file that can be used for scoring purposes. Only\none CODE statement is processed. If you specify multiple CODE statements, only the first one is used. You\nmust specify the following option:\n\nFILE=filename\n  specifies the filename of the file to write the SAS score code to."},"StatementOptions":{"StatementOption":{"StatementOptionName":"FILE=","StatementOptionHelp":{"#cdata":"Syntax: FILE= filename \n          \nSpecifies the filename of the file to write the SAS score code to."},"StatementOptionType":"V"}}},{"StatementName":"FREQ","StatementHelp":{"#cdata":"Syntax: FREQ variable ; \n\nThe variable in the FREQ statement identifies a numeric variable in the data set that contains the frequency\nof occurrence of each observation. PROC BINNING treats each observation as if it appears f times, where f is \nthe value of the FREQ variable for the observation. If f is not an integer, it is truncated to an integer. If \nf is less than 1 or missing, the observation is not used in the analysis. When the FREQ statement is not specified,\neach observation is assigned a frequency of 1."},"StatementOptions":null},{"StatementName":"INPUT","StatementHelp":{"#cdata":"Syntax: INPUT variables < / option > ;\n      \nThe INPUT statement names one or more variables as input variables for binning. The specified variables\nmust be interval variables. If classification variables are provided, PROC BINNING stops with an error\nmessage. PROC BINNING does not support duplicate variables. If the INPUT statement contains a duplicate\nvariable, PROC BINNING takes only the first variable and provides a warning message."},"StatementOptions":{"StatementOption":{"StatementOptionName":"NUMBIN=","StatementOptionHelp":{"#cdata":"Syntax: NUMBIN=integer\n          \nSpecifies the number of binning levels for all binning variables in the current INPUT statement. The\nvalue of integer can be any integer between 2 and 1,000, inclusive. \n\nThe number of binning levels that you specify in an INPUT statement overwrites the global number of\nbinning levels, which is specified in the NUMBIN= option in the PROC BINNING statement (or is 16\nby default)."},"StatementOptionType":"V"}}},{"StatementName":"OUTPUT","StatementHelp":{"#cdata":"Syntax: OUTPUT OUT=CAS-libref.data-table < option > ;\n      \nThe OUTPUT statement enables you to write an output table back to the CAS server by creating an output\ndata table that contains the results of PROC BINNING. If you do not specify the OUTPUT statement, the\nwrite-back process is skipped. This is useful when you want only the ODS output. By default, the output\ntable contains the new binned variables. If you specify the COPYVARS= option, the output table contains\nthe “copied variables” and the “binned variables.”\n\nNOTE: If an input variable value is missing, then the binning output level value is 0."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"OUT=","StatementOptionHelp":{"#cdata":"Syntax: OUT=CAS-libref.data-table\n          \nnames the output data table for PROC BINNING to use. CAS-libref.data-table is a two-level name,\nwhere\n\n  CAS-libref refers to a collection of information that is defined in the LIBNAME statement and\n    includes the caslib, which includes a path to where the data table is to be stored, and\n    a session identifier, which defaults to the active session but which can be explicitly\n    defined in the LIBNAME statement.\n    \n  data-table specifies the name of the output data table."},"StatementOptionType":"V"},{"StatementOptionName":"COPYVAR=|COPYVARS=","StatementOptionHelp":{"#cdata":"Syntax: COPYVAR=variable | COPYVARS=(variables)\n          \nLists one or more variables from the input data table to be transferred to the output data table."},"StatementOptionType":"V"}]}},{"StatementName":"TARGET","StatementHelp":{"#cdata":"Syntax: TARGET variable / EVENT=“category” ;\n      \nThe TARGET statement names the variable that PROC BINNING uses to calculate the weight of evidence\nand information value."},"StatementOptions":{"StatementOption":{"StatementOptionName":"EVENT=","StatementOptionHelp":{"#cdata":"Syntax: EVENT=“category”\n          \nSpecifies the target event category that PROC BINNING uses to calculate the weight of evidence and\ninformation value in a quoted string of characters."},"StatementOptionType":"V"}}}]}}}