{"Procedure":{"Name":"BOM","ProductGroup":"SAS/OR","ProcedureHelp":{"#cdata":"Syntax: PROC BOM options ; \n    STRUCTURE / options ;\n\nThe BOM procedure performs bill-of-material processing. It reads all product structure records \nfrom a product structure data file and all part \"master\" records from a part master file, and \ncomposes the combined information into indented bills of material. In addition, PROC BOM can also \noutput a summarized parts list, which lists all items and their total quantities required (needed \nto be made or ordered) in order to fill a given production plan. A production plan is an agreed-upon \nplan that comes from the aggregate planning function; specifically, it is the overall level of \nmanufacturing output planned to be produced for each product family in each planning period (Cox \nand Blackstone, J. H., Jr. 1998). Production plan information can be included in the part master file."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=|PSDATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nNames the input SAS data set that contains all the product structure records (parent-component \nrelationship, quantity per assembly, scrap factor, etc.) for a product, product line, plant or \ncompany. More than one product structure record can be specified in one observation if they have \nthe same parent item. This data set is also referred to as the Product Structure data set, the \nSingle-level BOM data set, or the Parent-Component Relationship Structure data set."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"DUPLICATE=","ProcedureOptionHelp":{"#cdata":"Specifies how to handle identical product structure records in the Product Structure data set. Two \nproduct structure records are called identical if they have exactly the same values for the parent, \ncomponent, lead-time offset, and all the RID variables."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"COMBINE","@Value2":"DISCARD","@Value3":"KEEP"},"ProcedureOptionToolTips":{"@ToolTip1":"Combines the values of the quantity per assembly and scrap factor of all identical product structure  records together.","@ToolTip2":"Discards all identical product structure records except the first one.","@ToolTip3":"Keeps all identical product structure records."}},{"ProcedureOptionName":"NOUTIL","ProcedureOptionHelp":{"#cdata":"Specifies that the procedure should not use utility data sets for memory management."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NPARTS=","ProcedureOptionHelp":{"#cdata":"[Syntax: NPARTS=nparts] \n      \nSpecifies the number of part master records for which memory is initially allocated in core \nby the procedure."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NRELATIONSHIPS=|NRELTS=","ProcedureOptionHelp":{"#cdata":"[Syntax: NRELATIONSHIPS=nrelts | NRELTS=nrelts] \n      \nSpecifies the number of product structure records for which memory is initially allocated \nin core by the procedure."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"OUT=|INDBOM=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUT=SAS-data-set | INDBOM=SAS-data-set] \n      \nSpecifies a name for the output SAS data set that contains the indented bills of material for \nall final products in the input data sets or all end items specified in the ENDITEM= option."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"PMDATA=|PMASTER=","ProcedureOptionHelp":{"#cdata":"[Syntax: PMDATA=SAS-data-set | PMASTER=SAS-data-set] \n      \nNames the input SAS data set that contains all the part (item) master records for a product, \nproduct line, plant or company."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"SUMMARYOUT=|SUMPART=","ProcedureOptionHelp":{"#cdata":"[Syntax: SUMMARYOUT=SAS-data-set | SUMPART=SAS-data-set] \n      \nSpecifies a name for the output SAS data set that contains the summarized parts list for the \nproduction plan specified in the Part Master data set."},"ProcedureOptionType":"DV"}]},"ProcedureStatements":{"ProcedureStatement":{"StatementName":"STRUCTURE","StatementHelp":{"#cdata":"Syntax: STRUCTURE / options ; \n      \nThe STRUCTURE statement lists the variables in the Product Structure and the Part Master input \ndata sets. The main variable in the Part Master data set is the Part variable; the main variables \nin the Product Structure data set are the Parent and Component variables. If all the part master \ndata are contained in the Product Structure data set, you need not specify a Part Master data set. \n\nIf two separate input data sets are specified, you must specify both a Part variable and a Parent \nvariable. Otherwise, you may specify either a Parent variable or a Part variable, or both. You must \nalways specify at least one Component variable. The number of Component variables specified must be \nequal to the number of the product structure records (number of relationships specified) in each \nobservation of the Product Structure data set. All other variables are optional. However, if you \nspecify the Quantity, Offset, or Factor variables, you must have the same number of these variables \nas the number of Component variables. \n\nIn this statement, you can also explicitly specify the items that are to be used as the end (level-0) \nitems."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"COMPONENT=|COMP=","StatementOptionHelp":{"#cdata":"[Syntax: COMPONENT=(variables)] \n          \nSpecifies variables in the Product Structure input data set that contain the part numbers (identifications) \nof the components that are directly used in the common parent item identified by the Parent variable. These \nvariables are also referred to as Component variables."},"StatementOptionType":"V"},{"StatementOptionName":"ENDITEM=","StatementOptionHelp":{"#cdata":"[Syntax: ENDITEM=(enditems)] \n          \nSpecifies the items that are to be used as the highest level or level-0 items (also referred to as \nend items) in the indented bills of material. In other words, this option can be used to construct \nindented bills of material and summarized parts list for sub-assemblies."},"StatementOptionType":"V"},{"StatementOptionName":"FACTOR=|SFACTOR=","StatementOptionHelp":{"#cdata":"[Syntax: FACTOR=(variables) | SFACTOR=(variables)] \n          \nIdentifies variables in the Product Structure data set that contain the scrap factor information \nfor each product structure record with the parent item identified by the Parent variable and the \ncomponent identified by each of the Component variables; the ith factor variable corresponds to \nthe i-th Component variable."},"StatementOptionType":"V"},{"StatementOptionName":"ID=","StatementOptionHelp":{"#cdata":"[Syntax: ID=(variables)] \n          \nIdentifies all variables in the Part Master data set that are not specified in the LEADTIME=, \nPART=, QTYONHAND=, or REQUIREMENT= options, and are to be included in the Indented BOM and the \nSummarized Parts output data sets."},"StatementOptionType":"V"},{"StatementOptionName":"LEADTIME=|DUR=","StatementOptionHelp":{"#cdata":"[Syntax: LEADTIME=variable | DUR=variable] \n          \nIdentifies the variable in the Part Master data set that contains the lead time information for \nthe item identified by the Part variable. The lead time of an item is the length of time between \nrecognition of the need for an order and the receipt of the goods. Individual components of lead \ntime can include order preparation time, queue time, processing time, move or transportation time, \nand receiving and inspection time."},"StatementOptionType":"V"},{"StatementOptionName":"OFFSET=|LTOFFSET=","StatementOptionHelp":{"#cdata":"[Syntax: OFFSET=(variables) | LTOFFSET=(variables)] \n          \nIdentifies variables in the Product Structure data set that contain the lead-time offset information \nfor each product structure record with the parent item identified by the Parent variable and the \ncomponent identified by each of the Component variables; the ith offset variable corresponds to \nthe ith Component variable."},"StatementOptionType":"V"},{"StatementOptionName":"PARENT=","StatementOptionHelp":{"#cdata":"[Syntax: PARENT=variable] \n          \nSpecifies the variable in the Product Structure data set that contains the part number or identification \nfor the immediate parent item of the components identified by the Component variables. This variable is \nalso referred to as the Parent variable."},"StatementOptionType":"V"},{"StatementOptionName":"PART=|ITEM=","StatementOptionHelp":{"#cdata":"[Syntax: PART=variable | ITEM=variable] \n          \nSpecifies the variable in the Part Master data set that contains the part number or identification. \nThis variable is also referred to as the Part variable."},"StatementOptionType":"V"},{"StatementOptionName":"QTYONHAND=|INVENTORY=","StatementOptionHelp":{"#cdata":"[Syntax: QTYONHAND=variable | INVENTORY=variable] \n          \nIdentifies the variable in the Part Master data set that contains the quantity currently \non hand for the item identified by the Part variable."},"StatementOptionType":"V"},{"StatementOptionName":"QUANTITY=|QTYPER=","StatementOptionHelp":{"#cdata":"[Syntax: QUANTITY=(variables) | QTYPER=(variables)] \n          \nIdentifies variables in the Product Structure data set that contain the quantity per assembly \ninformation for each product structure record with the parent item identified by the Parent \nvariable and the components identified by each of the Component variables; the ith quantity \nvariable corresponds to the ith Component variable."},"StatementOptionType":"V"},{"StatementOptionName":"REQUIREMENT=|GROSSREQ=","StatementOptionHelp":{"#cdata":"[Syntax: REQUIREMENT=variable | GROSSREQ=variable] \n          \nIdentifies the variable in the Part Master data set that contains the gross requirement (the quantity \nplanned to be produced in a production plan) for the item identified by the Part variable. This variable \nis also referred to as the Requirement variable and must be numeric."},"StatementOptionType":"V"},{"StatementOptionName":"RID=","StatementOptionHelp":{"#cdata":"[Syntax: RID=(variables)] \n         \nIdentifies all variables in the Product Structure data set that are not specified in the COMPONENT=, \nFACTOR=, OFFSET=, PARENT=, or QUANTITY= options, and are to be included in the Indented BOM data set. \nThese variables are also referred to as RID variables."},"StatementOptionType":"V"}]}}}}}