{"Procedure":{"Name":"BTL","ProductGroup":"SAS/GENETICS","ProcedureHelp":{"#cdata":"Syntax: PROC BTL <options> ; \n    BY variables ; \n    CLASS variables ; \n    MARKER variables </ options> ; \n    MODEL dependent <= fixed-effects> </ options> ; \n    PARMEST <options> ; \n    PARMS (value-list) ...</ options> ; \n    RANDOM random-effects </ options> ; \n    REPEATED <repeated-effect> </ options> ; \n    WEIGHT variable ; \n\nThe BTL procedure analyzes marker and trait data in order to find and characterize \nbinary trait loci (BTL). Mixed model analysis of variance is used to find a locus or \nloci associated with a trait, and a maximum likelihood model is used to estimate the \nrecombination and penetrance parameters for a given set of BTL. \n\nThe data consist of marker genotype and a binary trait for a set of individuals. \nMarker genotypes can be of single nucleotide polymorphisms (SNPs), microsatellite \ndata, or any other kind of marker as long as it is a heritable unit that obeys the \nlaws of transmission genetics. However, only biallelic markers can be used to estimate \nBTL parameters; multiallelic markers can be used to find BTL but not to estimate \nparameters. \n\nThe output of PROC BTL is a \"Model Statistics\" table that contains a sorted list of the \nBTL models evaluated by a user-specified model selection criterion (p-value by default). \nAdditionally, the maximum likelihood parameter estimates for a selected BTL model are \nwritten to a \"Parameter Estimates\" table if the PARMEST statement is used. The penetrance \nparameters can be calculated for a specified set of recombination parameters, or \nalternatively, a grid search can be performed over a specified range of possible \nrecombination parameters. Finally, a 100(1-α) confidence interval can be computed for \nthe parameter estimates of a given model."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nNames the SAS data set to be used by PROC BTL. The default is the most recently \ncreated data set."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"MAP=","ProcedureOptionHelp":{"#cdata":"[Syntax: MAP=SAS-data-set] \n      \nNames the marker map data set to be used. It can include the variables Marker, Location, \nand Name and a user-designated linkage group variable. The user can specify the name of \nthe numeric linkage group variable in the GROUP= option in the MARKER statement, and this \ndata set must be sorted by this variable. The variable Marker must contain the names of \nthe variables specified in the MARKER statement."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"NOMCMPR","ProcedureOptionHelp":{"#cdata":"Suppresses the display of the \"Marker Class Means\" table."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOPARMPR","ProcedureOptionHelp":{"#cdata":"Suppresses the display of the \"Parameter Estimates\" table."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NOPRINT","ProcedureOptionHelp":{"#cdata":"Suppresses all output."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOREGPR","ProcedureOptionHelp":{"#cdata":"Suppresses the display of the \"Model Statistics\" table."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"ORDER=","ProcedureOptionHelp":{"#cdata":"Specifies the sorting order for the levels of all CLASS variables. This ordering \ndetermines which parameters in the model correspond to each level in the data."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"DATA","@Value2":"FORMATTED","@Value3":"FREQ","@Value4":"INTERNAL"},"ProcedureOptionToolTips":{"@ToolTip1":"Levels are sorted by the order of appearance in the input data set.","@ToolTip2":"Levels are sorted by the external formatted value, except for numeric variables with no explicit  format, which are sorted by their unformatted (internal) value.","@ToolTip3":"Levels are sorted by the descending frequency count; levels with the most observations come first  in the order.","@ToolTip4":"Levels are sorted by the unformatted value."}}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nYou can specify a BY statement with PROC BTL to obtain separate analyses on \nobservations in groups defined by the BY variables. When a BY statement appears, \nthe procedure expects the input data set to be sorted in the order of the BY \nvariables. The variables are one or more variables in the input data set."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"CLASS","StatementHelp":{"#cdata":"Syntax: CLASS variables </ TRUNCATE > ; \n\nThe CLASS statement names the classification variables to be used in the analysis. \nIf the CLASS statement is used, it must appear before the MODEL statement. \n\nClassification variables can be either character or numeric. By default, class levels \nare determined from the entire formatted values of the CLASS variables. You can use \nformats to group values into levels."},"StatementOptions":{"StatementOption":{"StatementOptionName":"TRUNCATE","StatementOptionHelp":{"#cdata":"Specifies that class levels should be determined using only the first 16 characters \nof the formatted values of CLASS variables."},"StatementOptionType":"S"}}},{"StatementName":"MARKER","StatementHelp":{"#cdata":"Syntax: MARKER variables </ options> ; \n\nThe MARKER statement lists the genetics marker variables used in constructing the BTL model. \nThis statement is required, and at least one marker variable must be listed or an error will \nbe generated. The MARKER statement is similar to a class statement, except the interaction \neffect for all the marker variables listed is implicitly added to the model, as in the \nfollowing code: \n\n   proc btl;\n      marker m1 m2 m3;\n      model trait;\n   run;\n\nThe model trait = m1xm2xm3 is fit by PROC BTL. Additionally, if the PARMEST statement is used, \nthese markers are included in the calculated BTL model and the model recombination and penetrance \nparameters are estimated."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ALL=","StatementOptionHelp":{"#cdata":"[Syntax: ALL=number] \n          \nRequests that regression models be calculated for all combinations of number markers \nfrom the marker statement, where number is a positive integer. Note:If the ALL option \nis used, the PARMEST statement is ignored if specified. If this option and the ALLUPTO= \noption are omitted, then only a model including all markers is fit. This option cannot \nbe used if ALLUPTO= is specified."},"StatementOptionType":"V"},{"StatementOptionName":"ALLUPTO=","StatementOptionHelp":{"#cdata":"[Syntax: ALLUPTO=number] \n          \nRequests that regression models be calculated for all combinations of number and fewer \nmarkers from the marker statement; e.g., ALLUPTO=3 calculates all combinations of 3, 2, \nand 1 markers, where number is a positive integer. \n\nNote: If the ALLUPTO option is used, the PARMEST statement is ignored if specified. If  \nthis option and the ALL= option are omitted, then only a model including all markers is \nfit. This option cannot be used if ALL= is specified."},"StatementOptionType":"V"},{"StatementOptionName":"BEST=","StatementOptionHelp":{"#cdata":"[Syntax: BEST=number] \n          \nRequests that only the top number models be included in the output, where number \nis a positive integer. By default, all models are displayed. If the GROUP= option \nis used, number specifies the number of models per linkage group to include in the \noutput. The ranking of the models is determined using the model selection criterion \nselected using the MC= option or the p-value of the likelihood ratio test by default."},"StatementOptionType":"V"},{"StatementOptionName":"GROUP=","StatementOptionHelp":{"#cdata":"[Syntax: GROUP=variable] \n          \nSpecifies the name of the linkage group variable in the map data set to be used \nin grouping the models in the \"Model Statistics\" output if the output contains \nsingle-gene models only. The output contains the models sorted by linkage group \nand by the criterion specified in the MC= option (or the likelihood ratio p-value \nby default). If the θs are not specified using the THETA option but are calculated \nusing the MAP= data set, then θs between markers from different linkage groups are \nset to 0.5. Note:If this variable is specified, markers in the MAP= data set from \nthe same linkage group must be in consecutive observations. Values for this variable \nmust be nonnegative numbers; any negative values are treated as missing."},"StatementOptionType":"V"},{"StatementOptionName":"MC=","StatementOptionHelp":{"#cdata":"Specifies the model selection criterion used to sort models. The default value \nis the p-value from the likelihood ratio test (MC=P)."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"P","@Value2":"LRCHI","@Value3":"AIC","@Value4":"BIC","@Value5":"AICC"},"StatementOptionToolTips":{"@ToolTip1":"P model selection criterion","@ToolTip2":"LRCHI model selection criterion","@ToolTip3":"AIC model selection criterion","@ToolTip4":"BIC model selection criterion","@ToolTip5":"AICC model selection criterion"}}]}},{"StatementName":"MODEL","StatementHelp":{"#cdata":"Syntax: MODEL dependent <= fixed-effects> < / options> ; \n\nThe MODEL statement names a single dependent variable and the fixed effects. These \nuser-specified fixed effects, along with the interaction effect of all the markers \nin the MARKER statement (that is implicitly added to the model if the MARKER statement \nis used), determine the X matrix of the mixed model. The specification of effects is \nthe same as in the GLM procedure; however, unlike PROC GLM, you do not specify random \neffects in the MODEL statement. The MODEL statement is required. \n\nAn intercept is included in the fixed-effects model by default. If no fixed effects \nor markers are specified, only this intercept term is fit. The intercept can be removed \nby using the NOINT option. \n\nThe dependent variable can be of any type for the computation of model statistics; \nhowever, it needs to be a binary variable if the PARMEST statement is used with values \n0 and 1."},"StatementOptions":{"StatementOption":{"StatementOptionName":"NOINT","StatementOptionHelp":{"#cdata":"Requests that no intercept be included in the model. An intercept is included by default."},"StatementOptionType":"S"}}},{"StatementName":"PARMEST","StatementHelp":{"#cdata":"Syntax: PARMEST <options> ; \n\nThe PARMEST statement requests that PROC BTL estimate the recombination and penetrance \nparameters for a BTL model containing the markers listed in the MARKER statement. The \nmarker class means are calculated from the input data and written to a table. By default \na grid search over the range of all possible values of the recombination parameters is \nperformed, and the resulting penetrance values that are in range for each set of rs are \ndisplayed. Alternatively, a specific set of r values can be specified using the R option."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=number] \n          \nSpecifies that a confidence level of 100(1-number)% is to be used in forming bootstrap \nconfidence intervals for the penetrance parameters when the BOOT= option is given. This \nvalue of number must be between 0 and 1, and is set to 0.05 by default."},"StatementOptionType":"V"},{"StatementOptionName":"BOOT=","StatementOptionHelp":{"#cdata":"[Syntax: BOOT=number] \n          \nRequests that confidence intervals be calculated for the penetrance parameters \nby using number iterations of the bootstrap. You must input which recombination \nparameters (s) to use in the calculation by using the R option or an error is \ngenerated."},"StatementOptionType":"V"},{"StatementOptionName":"CROSS=","StatementOptionHelp":{"#cdata":"Specifies the type of cross for the input data set. The default is CROSS=BACK."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BACK|B|DH","@Value2":"INTER|F"},"StatementOptionToolTips":{"@ToolTip1":"Backcross or, equivalently, DH for a doubled-haploid population.","@ToolTip2":"For an F intercross."}},{"StatementOptionName":"GEN=","StatementOptionHelp":{"#cdata":"[Syntax: GEN=number] \n          \nSpecifies the generation number of the offspring in the input data set. Valid values \ninclude any integer greater than or equal to one. The default is 1."},"StatementOptionType":"V"},{"StatementOptionName":"HETEROZYGOTE=|HE=","StatementOptionHelp":{"#cdata":"[Syntax: HETEROZYGOTE=\"heterozygote\"] \n          \nSpecifies the value for the heterozygous genotype used in the input data set. \nThe default value is \"B\"."},"StatementOptionType":"V"},{"StatementOptionName":"HOMOZYGOTE=|HO=","StatementOptionHelp":{"#cdata":"[Syntax: HOMOZYGOTE=\"homozygote\"] \n          \nSpecifies the value for the homozygous genotype used in the input data set. The default \nvalue is \"A.\" If the experimental design is an F cross, then this is the genotype homozygous \nfor the parent 1 allele."},"StatementOptionType":"V"},{"StatementOptionName":"HOMOZYGOTE2=|HO2=","StatementOptionHelp":{"#cdata":"[Syntax: HOMOZYGOTE=\"homozygote\"] \n          \nSpecifies the value for the genotype homozygous in the parent 2 allele used in the \ninput data set. The default value is \"C\"."},"StatementOptionType":"V"},{"StatementOptionName":"LINKMOD=","StatementOptionHelp":{"#cdata":"Specifies the model to be used to calculate the marker recombination parameters \nfrom the marker location values in the map data set. \n          \nThe default value is Haldane."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"HALDANE|H","@Value2":"KOSAMBI|K"},"StatementOptionToolTips":{"@ToolTip1":"Specifies the Heldane model.","@ToolTip2":"Specifies the Kosambi model."}},{"StatementOptionName":"LINKUNIT=","StatementOptionHelp":{"#cdata":"Specifies the units used for the marker location variable in the marker data set. \nThe options include centimorgans or recombination distance (kilobases). \n          \nThe default value is centimorgans."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"CM|C","@Value2":"RECDIST|R"},"StatementOptionToolTips":{"@ToolTip1":"Specifies the centimorgans unit.","@ToolTip2":"Specifies the recombination distance (kilobases) unit."}},{"StatementOptionName":"OUTSTAT=","StatementOptionHelp":{"#cdata":"[Syntax: OUTSTAT=SAS-data-set] \n          \nNames the SAS data set to be used for the parameter estimates and, when the BOOT= \noption is specified, confidence intervals. "},"StatementOptionType":"DV"},{"StatementOptionName":"PMAX=","StatementOptionHelp":{"#cdata":"[Syntax: PMAX=number] \n          \nSpecifies the highest penetrance value that is considered in range and included \nin the output. Any real number is a valid value as long as it is greater than PMIN. \nThe PMAX option is ignored if the R option, which precludes a grid search, is used. \nBy default, there is no upper limit for the range of penetrance values included in \nthe output."},"StatementOptionType":"V"},{"StatementOptionName":"PMIN=","StatementOptionHelp":{"#cdata":"[Syntax: PMIN=number] \n          \nSpecifies the lowest penetrance value that is considered in range and included \nin the output. Any real number is a valid value as long as it is less than PMAX. \nThe PMIN option is ignored if the R option, which precludes a grid search, is \nused. By default, there is no lower limit for the range of penetrance values \nincluded in the output."},"StatementOptionType":"V"},{"StatementOptionName":"R=","StatementOptionHelp":{"#cdata":"[Syntax: R=number-list] \n          \nSpecifies the values of r(recombination parameters) used to estimate the penetrance \nparameters. There is one r for each of the k adjacent marker/BTL pairs, where k is \nthe number of markers in the MARKER statement. A list of values can be given to specify \na different r for each pair, or a single value can be specified to be used for all r. \nIf there are fewer than k values specified, the last value given is used for the \nremaining r. If the R option is used to specify r, the grid search parameters (RSTART, \nREND, and RINC) are ignored. The R option is required if the BOOT= option is specified. \nThese s are used to calculate the confidence intervals of the penetrance parameters in \nthe bootstrap calculation. Each r must be a real number greater than or equal to 0 and \nless than 0.5, and invalid values are replaced by the default value of 0."},"StatementOptionType":"V"},{"StatementOptionName":"REND=","StatementOptionHelp":{"#cdata":"[Syntax: REND=number] \n          \nSpecifies the ending value for each recombination parameter in the grid search. \nThe default value is 0.5. REND must be a real number greater than 0 and less than \nor equal to 0.5."},"StatementOptionType":"V"},{"StatementOptionName":"RINC=","StatementOptionHelp":{"#cdata":"[Syntax: RINC=number] \n          \nSpecifies the increment to be used for the recombination parameter grid search. \nThe default value is 0.1. Any real number greater than 0 and less than or equal \nto 0.5 is valid."},"StatementOptionType":"V"},{"StatementOptionName":"RSTART=","StatementOptionHelp":{"#cdata":"[Syntax: RSTART=number] \n          \nSpecifies the starting value for each recombination parameter in the grid search. \nThe default value is 0. RSTART must be a real number from 0 to (but not including) \n0.5."},"StatementOptionType":"V"},{"StatementOptionName":"SEED=","StatementOptionHelp":{"#cdata":"[Syntax: SEED=number] \n          \nSpecifies the initial seed for the random number generator used for creating the \nbootstrap samples when the BOOT= option is given. The value for number must be an \ninteger; the computer clock time is used if the option is omitted or the integer \nspecified is less than or equal to 0."},"StatementOptionType":"V"},{"StatementOptionName":"THETA=","StatementOptionHelp":{"#cdata":"[Syntax: THETA=number-list] \n          \nSpecifies the values of recombination probabilities between adjacent pairs of markers \nlisted in the MARKER statement."},"StatementOptionType":"V"}]}},{"StatementName":"PARMS","StatementHelp":{"#cdata":"Syntax: PARMS (value-list) ...</ options> ; \n\nThe PARMS statement specifies initial values for the covariance parameters, or it \nrequests a grid search over the range of several values of these parameters. \n\nThe value-list specification can take any of several forms: \n\n  m -- a single value    \n  \n  m1,m2,...,mn -- several values \n  \n  m to n -- a sequence where m equals the starting value, n equals the ending value, \n    and the increment equals 1 \n    \n  m to n by i -- a sequence where m equals the starting value, n equals the ending value, \n    and the increment equals i \n\n  m1,m2 to m3 -- mixed values and sequences \n\nYou can use the PARMS statement to input known parameters. You can also specify \nknown parameters of g by using the GDATA= option in the RANDOM statement."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"HOLD=|EQCONS=","StatementOptionHelp":{"#cdata":"[Syntax: HOLD=value-list | EQCONS=value-list] \n          \nSpecifies which parameter values PROC BTL should hold to equal the specified values."},"StatementOptionType":"V"},{"StatementOptionName":"LOWERB=","StatementOptionHelp":{"#cdata":"[Syntax: LOWERB=value-list] \n          \nEnables you to specify lower boundary constraints on the covariance parameters. The value-list \nspecification is a list of numbers or missing values (.) separated by commas. You must list the \nnumbers in the order that PROC BTL uses for the covariance parameters, and each number corresponds \nto the lower boundary constraint. A missing value instructs PROC BTL to use its default constraint, \nand if you do not specify numbers for all of the covariance parameters, PROC BTL assumes that the \nremaining ones are missing."},"StatementOptionType":"V"},{"StatementOptionName":"NOBOUND","StatementOptionHelp":{"#cdata":"Requests the removal of boundary constraints on covariance parameters. For example, \nvariance components have a default lower boundary constraint of 0, and the NOBOUND \noption allows their estimates to be negative."},"StatementOptionType":"S"},{"StatementOptionName":"NOITER","StatementOptionHelp":{"#cdata":"Requests that no Newton-Raphson iterations be performed and that PROC BTL use the \nbest value from the grid search to perform inferences. By default, iterations \nbegin at the best value from the PARMS grid search."},"StatementOptionType":"S"},{"StatementOptionName":"NOPROFILE","StatementOptionHelp":{"#cdata":"Specifies a different computational method for the residual variance during the grid \nsearch. By default, PROC BTL estimates this parameter by using the profile likelihood \nwhen appropriate. The NOPROFILE option suppresses the profiling and uses the actual \nvalue of the specified variance in the likelihood calculations."},"StatementOptionType":"S"},{"StatementOptionName":"OLS","StatementOptionHelp":{"#cdata":"Requests starting values corresponding to the usual general linear model. Specifically, \nall variances and covariances are set to zero except for the residual variance, which \nis set equal to its ordinary least-squares (OLS) estimate. This option is useful when \nthe default MIVQUE0 procedure produces poor starting values for the optimization process."},"StatementOptionType":"S"},{"StatementOptionName":"PARMSDATA=|PDATA=","StatementOptionHelp":{"#cdata":"[Syntax: PARMSDATA=SAS-data-set] \n          \nReads in covariance parameter values from a SAS data set. The data set should contain \nthe EST or COVP1–COVPn variables."},"StatementOptionType":"V"},{"StatementOptionName":"RATIOS","StatementOptionHelp":{"#cdata":"Indicates that ratios with the residual variance are specified instead of the covariance \nparameters themselves. The default is to use the individual covariance parameters."},"StatementOptionType":"S"},{"StatementOptionName":"UPPERB=","StatementOptionHelp":{"#cdata":"[Syntax: UPPERB=value-list] \n          \nEnables you to specify upper boundary constraints on the covariance parameters. The \nvalue-list specification is a list of numbers or missing values (.) separated by commas. \nYou must list the numbers in the order that PROC BTL uses for the covariance parameters, \nand each number corresponds to the upper boundary constraint. A missing value instructs \nPROC BTL to use its default constraint, and if you do not specify numbers for all of the \ncovariance parameters, PROC BTL assumes that the remaining ones are missing."},"StatementOptionType":"V"}]}},{"StatementName":"RANDOM","StatementHelp":{"#cdata":"Syntax: RANDOM random-effects </ options> ; \n\nThe RANDOM statement defines the random effects constituting the γ vector in the mixed model. \nIt can be used to specify traditional variance component models (as in the VARCOMP procedure) \nand to specify random coefficients. The random effects can be classification or continuous \nvariables, and multiple RANDOM statements are possible. \n\nThe purpose of the RANDOM statement is to define the Z matrix of the mixed model, the random \neffects in the γ vector, and the structure of G. The Z matrix is constructed exactly like the \nX matrix for the fixed effects, and the G matrix is constructed to correspond with the effects \nconstituting Z. The structure of G is defined by using the TYPE= option."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"GDATA=","StatementOptionHelp":{"#cdata":"[Syntax: GDATA=SAS-data-set] \n          \nRequests that the G matrix be read in from a SAS data set. This G matrix is assumed \nto be known; therefore, only R-side parameters from effects in the REPEATED statement \nare included in the Newton-Raphson iterations. If no REPEATED statement is specified, \nthen only a residual variance is estimated."},"StatementOptionType":"DV"},{"StatementOptionName":"GROUP=|GRP=","StatementOptionHelp":{"#cdata":"[Syntax: GROUP=effect] \n          \nDefines an effect specifying heterogeneity in the covariance structure of G. All \nobservations having the same level of the GROUP effect have the same covariance \nparameters. Each new level of the GROUP effect produces a new set of covariance \nparameters with the same structure as the original group. You should exercise \ncaution in properly defining the GROUP effect, because strange covariance patterns \ncan result from its misuse. Also, the GROUP effect can greatly increase the number \nof estimated covariance parameters, which can adversely affect the optimization \nprocess."},"StatementOptionType":"V"},{"StatementOptionName":"LDATA=","StatementOptionHelp":{"#cdata":"[Syntax: LDATA=SAS-data-set] \n          \nReads the coefficient matrices associated with the TYPE=LIN(number) option. The data \nset must contain the variables PARM, ROW, COL1–COLn, or PARM, ROW, COL, VALUE. The \nPARM variable denotes which of the number coefficient matrices is currently being \nconstructed, and the ROW, COL1–COLn, or ROW, COL, VALUE variables specify the matrix \nvalues, as they do with the RANDOM statement option GDATA=. Unspecified values of \nthese matrices are set equal to 0."},"StatementOptionType":"DV"},{"StatementOptionName":"RATIOS","StatementOptionHelp":{"#cdata":"Indicates that ratios with the residual variance are specified in the GDATA= data \nset instead of the covariance parameters themselves. The default GDATA= data set \ncontains the individual covariance parameters."},"StatementOptionType":"S"},{"StatementOptionName":"SUBJECT=|SUB=","StatementOptionHelp":{"#cdata":"[Syntax: SUBJECT=effect] \n          \nIdentifies the subjects in your mixed model. Complete independence is assumed across \nsubjects; thus, for the RANDOM statement, the SUBJECT= option produces a block-diagonal \nstructure in G with identical blocks. The Z matrix is modified to accommodate this \nblock-diagonality. In fact, specifying a subject effect is equivalent to nesting all \nother effects in the RANDOM statement within the subject effect."},"StatementOptionType":"V"},{"StatementOptionName":"TYPE=","StatementOptionHelp":{"#cdata":"[Syntax: TYPE=covariance-structure] \n          \nSpecifies the covariance structure of G. Although a variety of structures are available, \nmost applications call for either TYPE=VC or TYPE=UN. The TYPE=VC (variance components) \noption is the default structure, and it models a different variance component for each \nrandom effect. \n\nThe TYPE=UN (unstructured) option is useful for correlated random coefficient models. \nFor example, \n\n   random intercept age / type=un subject=person;\n\nspecifies a random intercept-slope model that has different variances for the intercept \nand slope and a covariance between them. You can also use TYPE=FA0(2) here to request a \nG estimate that is constrained to be nonnegative definite. \n\nIf you are constructing your own columns of Z with continuous variables, you can use the \nTYPE=TOEP(1) structure to group them together to have a common variance component. If you \nwant to have different covariance structures in different parts of G, you must use multiple \nRANDOM statements with different TYPE= options."},"StatementOptionType":"V"}]}},{"StatementName":"REPEATED","StatementHelp":{"#cdata":"Syntax: REPEATED <repeated-effect> < / options> ; \n\nThe REPEATED statement is used to specify the R matrix in the mixed model. Its syntax \nis different from that of the REPEATED statement in PROC GLM. If no REPEATED statement \nis specified, R is assumed to be equal to σ²I."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"GROUP=|GRP=","StatementOptionHelp":{"#cdata":"[Syntax: GROUP=effect] \n          \nDefines an effect specifying heterogeneity in the covariance structure of R. All \nobservations having the same level of the GROUP effect have the same covariance \nparameters. Each new level of the GROUP effect produces a new set of covariance \nparameters with the same structure as the original group. You should exercise \ncaution in properly defining the GROUP effect, because strange covariance patterns \ncan result from its misuse. Also, the GROUP effect can greatly increase the number \nof estimated covariance parameters, which can adversely affect the optimization \nprocess."},"StatementOptionType":"V"},{"StatementOptionName":"LDATA=","StatementOptionHelp":{"#cdata":"[Syntax: LDATA=SAS-data-set] \n          \nReads the coefficient matrices associated with the TYPE=LIN(number) option. The data \nset must contain the variables PARM, ROW, COL1–COLn, or PARM, ROW, COL, VALUE. The \nPARM variable denotes which of the number coefficient matrices is currently being \nconstructed, and the ROW, COL1–COLn, or ROW, COL, VALUE variables specify the matrix \nvalues, as they do with the RANDOM statement option GDATA=. Unspecified values of \nthese matrices are set equal to 0."},"StatementOptionType":"DV"},{"StatementOptionName":"LOCAL=","StatementOptionHelp":{"#cdata":"Requests that a diagonal matrix be added to R. With just the LOCAL option, this \ndiagonal matrix equals σ²I, and σ² becomes an additional variance parameter that \nPROC BTL profiles out of the likelihood provided that you do not specify the \nNOPROFILE option in the PROC BTL statement. The LOCAL option is useful if you \nwant to add an observational error to a time series structure (Jones and Boadi-\nBoateng 1991) or a nugget effect to a spatial structure (Cressie 1991)."},"StatementOptionType":"S|V","StatementOptionValues":{"@Value1":"EXP","@Value2":"POM"},"StatementOptionToolTips":{"@ToolTip1":"Syntax: EXP(<effects>)               Option produces exponential local effects, also known as dispersion effects, in a  log-linear variance model.","@ToolTip2":"Syntax: POM(POM-data-set)                                      Specifies the power-of-the-mean structure. The SAS data set specified by POM-data-set  contains the numeric variable Estimate (in previous releases, the variable name was  required to be EST), and it has at least as many observations as there are fixed-effects  parameters."}},{"StatementOptionName":"LOCALW","StatementOptionHelp":{"#cdata":"Specifies that only the local effects and no others be weighted. By default, all \neffects are weighted. The LOCALW option is used in connection with the WEIGHT \nstatement and the LOCAL option in the REPEATED statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOLOCALW","StatementOptionHelp":{"#cdata":"Specifies that only the nonlocal effects and no others be weighted. By default, \nall effects are weighted. The NONLOCALW option is used in connection with the \nWEIGHT statement and the LOCAL option in the REPEATED statement."},"StatementOptionType":"S"},{"StatementOptionName":"SUBJECT=|SUB=","StatementOptionHelp":{"#cdata":"[Syntax: SUBJECT=effect] \n          \nIdentifies the subjects in your mixed model. Complete independence is assumed across \nsubjects; therefore, the SUBJECT= option produces a block-diagonal structure in R with \nidentical blocks. When the SUBJECT= effect consists entirely of classification variables, \nthe blocks of R correspond to observations sharing the same level of that effect. These \nblocks are sorted according to this effect as well."},"StatementOptionType":"V"},{"StatementOptionName":"TYPE=","StatementOptionHelp":{"#cdata":"[Syntax: TYPE=covariance-structure] \n          \nSpecifies the covariance structure of the R matrix. The SUBJECT= option defines \nthe blocks of R, and the TYPE= option specifies the structure of these blocks. \nThe default structure is VC."},"StatementOptionType":"V"}]}},{"StatementName":"WEIGHT","StatementHelp":{"#cdata":"Syntax: WEIGHT variable ; \n\nIf you do not specify a REPEATED statement, the WEIGHT statement operates exactly like \nthe one in PROC GLM. In this case PROC BTL replaces X'X and Z'Z with X'WX and Z'WZ, where  \nW is the diagonal weight matrix. If you specify a REPEATED statement, then the WEIGHT \nstatement replaces R with LRL, where L is a diagonal matrix with elements W^-1/2. \nObservations with nonpositive or missing weights are not included in the PROC BTL \nanalysis."},"StatementOptions":null}]}}}