{"Procedure":{"Name":"CANDISC","ProductGroup":"SAS/STAT","ProcedureHelp":{"#cdata":"Syntax: PROC CANDISC <options> ; \n    CLASS variable ; \n    BY variables ; \n    FREQ variable ; \n    VAR variables ; \n    WEIGHT variable ; \n\nCanonical discriminant analysis is a dimension-reduction technique related to principal \ncomponent analysis and canonical correlation. The methodology used in deriving the canonical \ncoefficients parallels that of a one-way MANOVA. MANOVA tests for equality of the mean \nvector across class levels. Canonical discriminant analysis finds linear combinations of \nthe quantitative variables that provide maximal separation between classes or groups. \nGiven a classification variable and several quantitative variables, the CANDISC procedure \nderives canonical variables, linear combinations of the quantitative variables that summarize \nbetween-class variation in much the same way that principal components summarize total variation. \n\nThe CANDISC procedure performs a canonical discriminant analysis, computes squared Mahalanobis \ndistances between class means, and performs both univariate and multivariate one-way analyses \nof variance. Two output data sets can be produced: one containing the canonical coefficients \nand another containing, among other things, scored canonical variables. The canonical coefficients \noutput data set can be rotated by the FACTOR procedure. It is customary to standardize the canonical \ncoefficients so that the canonical variables have means that are equal to zero and pooled within-class \nvariances that are equal to one. PROC CANDISC displays both standardized and unstandardized canonical \ncoefficients. Correlations between the canonical variables and the original variables as well as the \nclass means for the canonical variables are also displayed; these correlations, sometimes known as \nloadings, are called canonical structures. The scored canonical variables output data set can be \nused in conjunction with ODS Graphics to plot pairs of canonical variables in order to aid visual \ninterpretation of group differences."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"ALL","ProcedureOptionHelp":{"#cdata":"Activates all of the display options."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"ANOVA","ProcedureOptionHelp":{"#cdata":"Displays univariate statistics for testing the hypothesis that the class means are \nequal in the population for each variable."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"BCORR","ProcedureOptionHelp":{"#cdata":"Displays between-class correlations."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"BCOV","ProcedureOptionHelp":{"#cdata":"Displays between-class covariances."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"BSSCP","ProcedureOptionHelp":{"#cdata":"Displays the between-class SSCP matrix."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nSpecifies the data set to be analyzed. The data set can be an ordinary SAS data \nset or one of several specially structured data sets created by SAS statistical \nprocedures."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"DISTANCE|MAHALANOBIS","ProcedureOptionHelp":{"#cdata":"Displays squared Mahalanobis distances between the group means, F statistics, and \nthe corresponding probabilities of greater squared Mahalanobis distances between \nthe group means."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NCAN=","ProcedureOptionHelp":{"#cdata":"[Syntax:NCAN=n] \n      \nSpecifies the number of canonical variables to be computed."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NOPRINT","ProcedureOptionHelp":{"#cdata":"Suppresses the normal display of results. Note that this option temporarily disables \nthe Output Delivery System (ODS)."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"OUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUT=SAS-data-set] \n      \nCreates an output SAS data set containing the original data and the canonical \nvariable scores."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"OUTSTAT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUTSTAT=SAS-data-set] \n      \nCreates a TYPE=CORR output SAS data set that contains various statistics, including \nclass means, standard deviations, correlations, canonical correlations, canonical \nstructures, canonical coefficients, and means of canonical variables for each class."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"PCORR","ProcedureOptionHelp":{"#cdata":"Displays pooled within-class correlations (partial correlations based on the pooled \nwithin-class covariances)."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"PCOV","ProcedureOptionHelp":{"#cdata":"Displays pooled within-class covariances."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"PREFIX=","ProcedureOptionHelp":{"#cdata":"[Syntax: PREFIX=name] \n      \nSpecifies a prefix for naming the canonical variables."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"PSSCP","ProcedureOptionHelp":{"#cdata":"Displays the pooled within-class corrected SSCP matrix."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"SHORT","ProcedureOptionHelp":{"#cdata":"Suppresses the display of canonical structures, canonical coefficients, and class \nmeans on canonical variables; only tables of canonical correlations and multivariate \ntest statistics are displayed."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"SIMPLE","ProcedureOptionHelp":{"#cdata":"Displays simple descriptive statistics for the total sample and within each class."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"SINGULAR=","ProcedureOptionHelp":{"#cdata":"[Syntax: SINGULAR=p] \n      \nSpecifies the criterion for determining the singularity of the total-sample correlation\nmatrix and the pooled within-class covariance matrix, where 0 < p < 1. The default is \nSINGULAR=1E–8."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"STDMEAN","ProcedureOptionHelp":{"#cdata":"Displays total-sample and pooled within-class standardized class means."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"TCORR","ProcedureOptionHelp":{"#cdata":"Displays total-sample correlations."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"TCOV","ProcedureOptionHelp":{"#cdata":"Displays total-sample covariances."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"TSSCP","ProcedureOptionHelp":{"#cdata":"Displays the total-sample corrected SSCP matrix."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"WCORR","ProcedureOptionHelp":{"#cdata":"Displays within-class correlations for each class level."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"WCOV","ProcedureOptionHelp":{"#cdata":"Displays within-class covariances for each class level."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"WSSCP","ProcedureOptionHelp":{"#cdata":"Displays the within-class corrected SSCP matrix for each class level."},"ProcedureOptionType":"S"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"CLASS|CLASSES","StatementHelp":{"#cdata":"Syntax: CLASS variable ;\n      \nThe values of the CLASS variable define the groups for analysis. Class levels \nare determined by the formatted values of the CLASS variable. The CLASS variable \ncan be numeric or character. A CLASS statement is required."},"StatementOptions":null},{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nObtains separate analyses on observations in groups defined by the BY variables."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"FREQ","StatementHelp":{"#cdata":"Syntax: FREQ variable;\n      \nIf one variable in your data set represents the frequency of occurrence for the \nother values in the observation, specify the variable’s name in a FREQ statement. \nPROC CANDISC then treats the data set as if each observation appears ni times, \nwhere ni is the value of the FREQ variable for observation i."},"StatementOptions":null},{"StatementName":"VAR|VARIABLES","StatementHelp":{"#cdata":"VAR variable(s);\n    \nYou specify the quantitative variables to include in the analysis by using a VAR \nstatement. If you do not use a VAR statement, the analysis includes all numeric \nvariables not listed\nin other statements."},"StatementOptions":null},{"StatementName":"WEIGHT","StatementHelp":{"#cdata":"Syntax: WEIGHT variable;\n      \nTo use relative weights for each observation in the input data set, place the \nweights in a variable in the data set and specify the name in a WEIGHT statement."},"StatementOptions":null},{"StatementName":"PROB"}]}}}