{"Procedure":{"Name":"CASECONTROL","ProductGroup":"SAS/GENETICS","ProcedureHelp":{"#cdata":"Syntax: PROC CASECONTROL <options> ; \n    BY variables ; \n    STRATA variables </ options> ; \n    TRAIT variable ; \n    VAR variables ; \n    \nMarker information can be used to help locate the genes that affect susceptibility \nto a disease. The CASECONTROL procedure is designed for the interpretation of marker \ndata when random samples are available from the populations of unrelated individuals \nwho are either affected or unaffected by the disease. Several tests are available in \nPROC CASECONTROL that compare marker allele and/or genotype frequencies in the two \npopulations, with frequency differences indicating an association of the marker with \nthe disease. Although such an association can point to the proximity of the marker \nand disease genes in the genome, it can also reflect population structure, so care \nis needed in interpreting the results; association does not necessarily imply linkage. \n\nThe three chi-square tests available for testing case-control genotypic data are the \ngenotype case-control test, which tests for dominant allele effects on the disease \npenetrance, and the allele case-control test and linear trend test, which test for \nadditive allele effects on the disease penetrance. Since the allele case-control test \nrequires the assumption of Hardy-Weinberg equilibrium (HWE), it might be desirable to \nrun the ALLELE procedure on the data to perform the HWE test on each marker."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"ALLELE","ProcedureOptionHelp":{"#cdata":"Requests that the allele case-control test be performed. If none of the three test options \n(ALLELE, GENOTYPE, or TREND) are specified, then all three tests are performed by default."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"ALPHA=","ProcedureOptionHelp":{"#cdata":"[Syntax: ALPHA=number] \n      \nSpecifies that a confidence level of 100(1-number)% is to be used in forming confidence \nintervals for odds ratios. The value of number must be between 0 and 1, and is set to \n0.05 by default."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nNames the input SAS data set to be used by PROC CASECONTROL. The default is to use the \nmost recently created data set."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"DELIMITER=","ProcedureOptionHelp":{"#cdata":"[Syntax: DELIMITER=’string’] \n      \nIndicates the string that is used to separate the two alleles that compose the \ngenotypes contained in the variables specified in the VAR statement. This option \nis ignored if GENOCOL is not specified."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"GENOCOL","ProcedureOptionHelp":{"#cdata":"Indicates that columns specified in the VAR statement contain genotypes instead of \nalleles. When this option is specified, there is one column per marker. The genotypes \nmust consist of the two alleles separated by a delimiter. For a genotype with one missing \nallele, use a blank space to indicate a missing value; if both alleles are missing, either \nuse a single missing value for the entire genotype or use the delimiter alone."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"GENOTYPE","ProcedureOptionHelp":{"#cdata":"Requests that the genotype case-control test be performed. If none of the three \ntest options (ALLELE, GENOTYPE, or TREND) are specified, then all three tests \nare performed by default."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"INDIVIDUAL=|INDIV=","ProcedureOptionHelp":{"#cdata":"[Syntax: INDIVIDUAL=variable] \n      \nSpecifies the individual ID variable when using the TALL option. This variable \ncan be character or numeric."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"MARKER=","ProcedureOptionHelp":{"#cdata":"[Syntax: MARKER=variable] \n      \nSpecifies the marker ID variable when using the TALL option. This variable contains \nthe names of the markers that are used in all output and can be character or numeric."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NDATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: NDATA=SAS-data-set] \n      \nNames the input SAS data set containing names, or identifiers, for the markers \nused in the output. There must be a NAME variable in this data set, which should \ncontain the same number of rows as there are markers in the input data set specified \nin the DATA= option."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"NULLSNPS=","ProcedureOptionHelp":{"#cdata":"[Syntax: NULLSNPS=(variable list)] \n      \nNames the markers to be used in calculating the variance inflation factor for genomic \ncontrol that is applied to the chi-square statistic(s) from the trend test. Only biallelic \nmarkers that are listed are used. Note that if GENOCOL is specified, there should be one \nvariable for each marker listed; otherwise, there should be two variables per marker. By \ndefault, if VIF is specified in the PROC CASECONTROL statement, all biallelic markers \nlisted in the VAR statement are used. This option must be specified if both the VIF \noption and the PERMS= option are used; otherwise the variance inflation factor is not \napplied. This option is ignored if the VIF option is not specified or if the TALL option \nis used."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"OR","ProcedureOptionHelp":{"#cdata":"Requests that odds ratios based on allele counts for biallelic markers be included in \nthe OUTSTAT= data set, along with (1–α)% confidence limits for the value specified \nin the ALPHA= option. Odds ratios are not reported for markers with more than two \nalleles."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"OUTSTAT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUTSTAT=SAS-data-set] \n      \nNames the output SAS data set containing counts for the two trait values, the chi-square \nstatistics, degrees of freedom, and p-values for the tests performed. When this option is \nomitted, an output data set is created by default and named according to the DATAn convention. "},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"PERMS=|EXACT=","ProcedureOptionHelp":{"#cdata":"[Syntax: PERMS=number | EXACT=number] \n      \nIndicates that Monte Carlo estimates of the exact p-values for the case-control tests \nshould be calculated instead of the p-values from the asymptotic χ² distribution. In each \nof the number permutation samples, the trait values are permuted among the individuals in \nthe sample. Large values of number (10,000 or more) are usually recommended for accuracy, \nbut long execution times can result, particularly with large data sets. When this option \nis omitted, no permutations are performed and p-values from the asymptotic χ² distribution \nare reported."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"PREFIX=","ProcedureOptionHelp":{"#cdata":"[Syntax: PREFIX=prefix] \n      \nSpecifies a prefix to use in constructing names for marker variables in all output. \nFor example, if PREFIX=VAR, the names of the variables are VAR1, VAR2, ..., VARn. \nNote that this option is ignored when the NDATA= option is specified, unless there \nare fewer names in the NDATA data set than there are markers; it is also ignored if \nthe TALL option is specified, in which case the marker variable names are taken from \nthe marker ID variable specified in the MARKER= option. Otherwise, if this option is \nomitted, PREFIX=M is the default when variables contain alleles; if GENOCOL is specified, \nthen the names of the variables specified in the VAR statement are used as the marker \nnames."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SEED=","ProcedureOptionHelp":{"#cdata":"[Syntax: SEED=number] \n      \nSpecifies the initial seed for the random number generator used for permuting the data \nto calculate estimates of exact p-values. This option is ignored if PERMS= is not specified. \nThe value for number must be an integer; the computer clock time is used if the option is \nomitted or an integer less than or equal to 0 is specified."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"TALL","ProcedureOptionHelp":{"#cdata":"Indicates that the input data set is of an alternative format. This tall-skinny \nformat contains the following columns: two containing marker alleles (or one \ncontaining marker genotypes if GENOCOL is specified), one for the marker \nidentifier, and one for the individual identifier. The MARKER= and INDIV= \noptions must also be specified in order for this option to be in effect. \nNote that when this option is used, the DATA= data set must first be sorted \nby any BY variables, then sorted by the marker ID variable, and then sorted \nby the individual ID variable."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"TREND","ProcedureOptionHelp":{"#cdata":"Requests that the linear trend test for allelic effects be performed. If none of \nthe three test options (ALLELE, GENOTYPE, or TREND) are specified, then all \nthree tests are performed by default."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"VIF","ProcedureOptionHelp":{"#cdata":"Specifies that the variance inflation factor λ should be applied to the trend chi-square \nstatistic for genomic control. This adjustment is applied only when the trend test is \nperformed and to markers in the VAR statement that are biallelic."},"ProcedureOptionType":"S"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nYou can specify a BY statement with PROC ALLELE to obtain separate analyses on \nobservations in groups defined by the BY variables. When a BY statement appears, \nthe procedure expects the input data set to be sorted in the order of the BY \nvariables. The variables are one or more variables in the input data set."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"STRATA","StatementHelp":{"#cdata":"Syntax: STRATA variables </ options> ; \n\nThe STRATA statement names the variables defining strata or representing matched \nor nested sets of individuals in a case-control study. Each STRATA variable can \nbe either character or numeric, and the formatted values of the STRATA variables \ndetermine the levels. Thus, you can also use formats to group values into levels."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"INFO","StatementOptionHelp":{"#cdata":"Displays the \"Strata Information\" table, which includes the stratum number, levels \nof the STRATA variables that define the stratum, total number of individuals, and \ncounts for the two trait values that define cases and controls in each stratum. \nSince the number of strata can be very large, this table is displayed only on \nrequest."},"StatementOptionType":"S"},{"StatementOptionName":"MISSING","StatementOptionHelp":{"#cdata":"Treats missing values (‘.’, ‘.A’,...,‘.Z’ for numeric variables and blanks for \ncharacter variables) as valid STRATA variable values."},"StatementOptionType":"S"}]}},{"StatementName":"TRAIT","StatementHelp":{"#cdata":"Syntax: TRAIT variable ; \n\nThe TRAIT statement identifies a binary variable indicating which individuals are cases \nand which are controls or a binary variable representing a dichotomous trait. This variable \ncan be character or numeric, but it must have only two nonmissing levels."},"StatementOptions":null},{"StatementName":"VAR","StatementHelp":{"#cdata":"Syntax: VAR variables ; \n\nThe VAR statement identifies the variables containing either the marker alleles or, \nif GENOCOL is specified, the marker genotypes. The following number of variables \nshould be specified in this statement for a data set containing m markers according \nto whether the options GENOCOL and TALL are used: \n\n  o When both GENOCOL and TALL are specified, there should be 1 variable named \n    containing marker genotypes. \n\n  o When only TALL is specified, there should be 2 variables named containing \n    marker alleles. \n\n  o When only GENOCOL is specified, there should be m variables named, one for \n    each marker containing marker genotypes. \n\n  o When neither option is specified, there should be 2m variables named, two \n    for each marker containing marker alleles. \n\nAll variables specified must be of the same type, either character or numeric."},"StatementOptions":null}]}}}