{"Procedure":{"Name":"CIMPORT","ProductGroup":"BASE","ProcedureHelp":{"#cdata":"Syntax: PROC CIMPORT destination=libref | <libref.>member-name <option(s)>;\n    EXCLUDE SAS file(s) | catalog entry(s)</ MEMTYPE=mtype></ ENTRYTYPE=entry-type>;  \n    SELECT SAS file(s) | catalog entry(s)</ MEMTYPE=mtype></ ENTRYTYPE=entry-type>;  \n  \nThe CIMPORT procedure imports a transport file that was created (exported) by the \nCPORT procedure. PROC CIMPORT restores the transport file to its original form as \na SAS catalog, SAS data set, or SAS library. Transport files are sequential files \nthat each contain a SAS library, a SAS catalog, or a SAS data set in transport format. \nThe transport format that PROC CPORT writes is the same for all environments and for \nmany releases of SAS.\n\nPROC CIMPORT also converts SAS files, which means that it changes the format of a SAS \nfile from the SAS format appropriate for one version of SAS to the SAS format appropriate \nfor another version. For example, you can use PROC CPORT and PROC CIMPORT to move files \nfrom earlier releases of SAS to more recent releases (for example, from SAS 6 to SAS 9) \nor between the same versions (for example, from one SAS 9 operating environment to another \nSAS 9 operating environment). PROC CIMPORT automatically converts the transport file as \nit imports it. \n\nHowever, PROC CPORT and PROC CIMPORT do not allow file transport from a later version to \nan earlier version, which is known as regressing (for example, from SAS 9 to SAS 6). \n\nPROC CIMPORT produces no output, but it does write notes to the SAS log."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"CATALOG=|CAT=|C=","ProcedureOptionHelp":{"#cdata":"[Syntax: CATALOG=<libref.>member-name]\n      \nIdentifies the file or files in the transport file as a single catalog."},"ProcedureOptionType":"RV|DV"},{"ProcedureOptionName":"DATA=|DS=|D=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=<libref.>member-name] \n      \nIdentifies the file or files in the transport file as a single SAS data set."},"ProcedureOptionType":"RV|DV"},{"ProcedureOptionName":"LIBRARY=|LIB=|L=","ProcedureOptionHelp":{"#cdata":"[Syntax: LIBRARY=libref] \n      \nIdentifies the file or files in the transport file as the members of a SAS library."},"ProcedureOptionType":"RV|DV"},{"ProcedureOptionName":"EET=","ProcedureOptionHelp":{"#cdata":"[Syntax: EET=(etype(s))] \n      \nExcludes specified entry types from the import process. If the etype is a single entry type, \nthen you can omit the parentheses. Separate multiple values with spaces.\n\nInteraction: You cannot specify both the EET= option and the ET= option in the same PROC CIMPORT step."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"ENCODINGINFO=","ProcedureOptionHelp":{"#cdata":"[Syntax: ENCODINGINFO=ALL | n] \n      \nSpecifies the number of data set headers to read in order to output the encoding value of the data set to the log.\n\n  ALL\n    specifies that all data set headers are read. The encoding value stored for the data set header is output to the SAS log. \n    \n  n\n    specifies an integer greater than zero. This value represents the number of data set headers to read. The encoding \n    value stored for the data set header is output to the SAS log."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"ET=","ProcedureOptionHelp":{"#cdata":"[Syntax: ET=(etype(s))] \n      \nSpecifies the entry types to import. If the etype is a single entry type, then you can omit the parentheses. Separate multiple values with spaces.\n\nInteraction: You cannot specify both the EET= option and the ET= option in the same PROC CIMPORT step."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"EXTENDSN=","ProcedureOptionHelp":{"#cdata":"Specifies whether to extend by 1 byte the length of short numerics (fewer than 8 bytes) when you import them."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"YES","@Value2":"NO"},"ProcedureOptionToolTips":{"@ToolTip1":"Specififes to extend by 1 byte the length of short numerics (fewer than 8 bytes) when you import them.","@ToolTip2":"Specififes not to extend by 1 byte the length of short numerics (fewer than 8 bytes) when you import them."}},{"ProcedureOptionName":"ISFILEUTF8=","ProcedureOptionHelp":{"#cdata":"Specifies whether to explicitly designate the encoding of a data set that is contained in a transport file as UTF-8."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"YES|Y|TRUE|T","@Value2":"NO|N|FALSE|F"},"ProcedureOptionToolTips":{"@ToolTip1":"Specififes to explicitly designate the encoding of a data set that is contained in a transport  file as UTF-8.","@ToolTip2":"Specififes not to explicitly designate the encoding of a data set that is contained in a transport  file as UTF-8. This is the default."}},{"ProcedureOptionName":"FORCE","ProcedureOptionHelp":{"#cdata":"Enables access to a locked catalog. \n        \nCAUTION:  The FORCE option can lead to unpredictable results. \n          The FORCE option allows multiple users to access the same catalog entry simultaneously."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"INFILE=|FILE=","ProcedureOptionHelp":{"#cdata":"[Syntax: INFILE=fileref | 'filename'] \n      \nSpecifies a previously defined fileref or the filename of the transport file to read."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"MEMTYPE=|MT=","ProcedureOptionHelp":{"#cdata":"Specifies that only data sets, only catalogs, or both, be imported from the transport file."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"ALL","@Value2":"CATALOG|CAT","@Value3":"DATA|DS"},"ProcedureOptionToolTips":{"@ToolTip1":"Both catalogs and data sets","@ToolTip2":"Catalog","@ToolTip3":"SAS data sets"}},{"ProcedureOptionName":"NEW","ProcedureOptionHelp":{"#cdata":"Creates a new catalog to contain the contents of the imported transport file when the destination \nyou specify has the same name as an existing catalog."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOEDIT|NEDIT","ProcedureOptionHelp":{"#cdata":"Imports SAS/AF PROGRAM and SCL entries without edit capability."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOSRC|NSRC","ProcedureOptionHelp":{"#cdata":"Suppresses the importing of source code for SAS/AF entries that contain compiled SCL code."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"SORT","ProcedureOptionHelp":{"#cdata":"Causes the output data set to be re-sorted if sorting it within SAS on the destination machine can \nresult in a different observation ordering. The order of observations in a data set sorted by one \nor more character variables depends upon the session encoding and translation tables used by SAS \nas well as the options used when invoking the SORT procedure."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"TAPE","ProcedureOptionHelp":{"#cdata":"Reads the input transport file from a tape."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"UPCASE","ProcedureOptionHelp":{"#cdata":"Writes the alphabetic characters in uppercase to the output file."},"ProcedureOptionType":"S"}],"#comment":{}},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"EXCLUDE","StatementHelp":{"#cdata":"Syntax: EXCLUDE SAS file(s) | catalog entry(s)</ MEMTYPE=mtype></ ENTRYTYPE= entry-type>;\n      \nExcludes specified files or entries from the import process."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ENTRYTYPE=|ETYPE=|ET=","StatementOptionHelp":{"#cdata":"Specifies a single entry type for one or more catalog entries that are listed in the EXCLUDE statement."},"StatementOptionType":"V"},{"StatementOptionName":"MEMTYPE=|MTYPE=|MT=","StatementOptionHelp":{"#cdata":"Specifies a single member type for one or more SAS files listed in the EXCLUDE statement."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ALL","@Value2":"CATALOG","@Value3":"DATA"},"StatementOptionToolTips":{"@ToolTip1":"Both catalogs and data sets","@ToolTip2":"Catalogs","@ToolTip3":"SAS data sets"}}]}},{"StatementName":"SELECT","StatementHelp":{"#cdata":"Syntax: SELECT SAS file(s) | catalog entry(s)</ MEMTYPE=mtype></ ENTRYTYPE=entry-type>;\n      \nSpecifies individual files or entries to import."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ENTRYTYPE=|ETYPE=|ET=","StatementOptionHelp":{"#cdata":"Specifies a single entry type for one or more catalog entries that are listed in the SELECT statement."},"StatementOptionType":"V"},{"StatementOptionName":"MEMTYPE=|MTYPE=|MT=","StatementOptionHelp":{"#cdata":"Specifies a single member type for one or more SAS files listed in the SELECT statement."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ALL","@Value2":"CATALOG","@Value3":"DATA"},"StatementOptionToolTips":{"@ToolTip1":"Both catalogs and data sets","@ToolTip2":"Catalogs","@ToolTip3":"SAS data sets"}}]}}]}}}