{"Procedure":{"Name":"CLUSTER","ProductGroup":"SAS/STAT","ProcedureHelp":{"#cdata":"Syntax: PROC CLUSTER METHOD = name <options> ; \n    BY variables ; \n    COPY variables ; \n    FREQ variable ; \n    ID variable ; \n    RMSSTD variable ; \n    VAR variables ;\n    \nThe CLUSTER procedure hierarchically clusters the observations in a SAS data set \nby using one of 11 methods. The data can be coordinates or distances.  If the data \nare coordinates, PROC CLUSTER computes (possibly squared) Euclidean distances. If \nyou want non-Euclidean distances, use the DISTANCE procedure to compute an appropriate \ndistance data set that can then be used as input to PROC CLUSTER. \n\nThe clustering methods are: average linkage, the centroid method, complete linkage, \ndensity linkage (including Wong’s hybrid and th-nearest-neighbor methods), maximum \nlikelihood for mixtures of spherical multivariate normal distributions with equal \nvariances but possibly unequal mixing proportions, the flexible-beta method, McQuitty’s \nsimilarity analysis, the median method, single linkage, two-stage density linkage, \nand Ward’s minimum-variance method. \n\nAll methods are based on the usual agglomerative hierarchical clustering procedure. \nEach observation begins in a cluster by itself. The two closest clusters are merged \nto form a new cluster that replaces the two old clusters. Merging of the two closest \nclusters is repeated until only one cluster is left. The various clustering methods \ndiffer in how the distance between two clusters is computed."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"METHOD=","ProcedureOptionHelp":{"#cdata":"Specifies the clustering method used by the procedure."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"AVERAGE|AVE","@Value2":"CENTROID|CEN","@Value3":"COMPLETE|COM","@Value4":"DENSITY|DEN","@Value5":"EML","@Value6":"FLEXIBLE|FLE","@Value7":"MCQUITTY|MCQ","@Value8":"MEDIAN|MED","@Value9":"SINGLE|SIN","@Value10":"TWOSTAGE|TWO","@Value11":"WARD|WAR"},"ProcedureOptionToolTips":{"@ToolTip1":"Requests average linkage (group average, unweighted pair-group method using arithmetic averages, UPGMA).","@ToolTip2":"Requests the centroid method (unweighted pair-group method using centroids, UPGMC, centroid sorting,  weighted-group method).","@ToolTip3":"Requests complete linkage (furthest neighbor, maximum method, diameter method, rank order typal analysis).","@ToolTip4":"Requests density linkage, which is a class of clustering methods using nonparametric probability density estimation.","@ToolTip5":"Requests maximum-likelihood hierarchical clustering for mixtures of spherical multivariate normal distributions  with equal variances but possibly unequal mixing proportions.","@ToolTip6":"Requests the Lance-Williams flexible-beta method.","@ToolTip7":"Requests McQuitty’s similarity analysis (weighted average linkage, weighted pair-group method using arithmetic averages, WPGMA).","@ToolTip8":"Requests single linkage (nearest neighbor, minimum method, connectedness method, elementary linkage  analysis, or dendritic method).","@ToolTip9":"Requests Gower’s median method (weighted pair-group method using centroids, WPGMC).","@ToolTip10":"Requests two-stage density linkage. You must also specify the K=, R=, or HYBRID option to indicate the type of density estimation to be used.","@ToolTip11":"Requests Ward’s minimum-variance method (error sum of squares, trace W)."}},{"ProcedureOptionName":"BETA=","ProcedureOptionHelp":{"#cdata":"[Syntax: BETA=n] \n      \nSpecifies the beta parameter for METHOD=FLEXIBLE. The value of n should be less than 1, \nusually between 0 and -1. By default, BETA=-0.25."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"CCC","ProcedureOptionHelp":{"#cdata":"Displays the cubic clustering criterion and approximate expected R square under the \nuniform null hypothesis."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nNames the input data set containing observations to be clustered."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"DIM=","ProcedureOptionHelp":{"#cdata":"[Syntax: DIM=n] \n      \nSpecifies the dimensionality used when computing density estimates with the TRIM= \noption, METHOD=DENSITY, or METHOD=TWOSTAGE. The values of n must be greater than \nor equal to 1. The default is the number of variables if the data are coordinates; \nthe default is 1 if the data are distances."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"HYBRID","ProcedureOptionHelp":{"#cdata":"Requests Wong’s hybrid clustering method in which density estimates are computed \nfrom a preliminary cluster analysis using the k-means method."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"K=","ProcedureOptionHelp":{"#cdata":"[Syntax: K=n] \n      \nSpecifies the number of neighbors to use for th-nearest-neighbor density estimation. The  \nnumber of neighbors (n) must be at least two but less than the number of observations."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"MODE=","ProcedureOptionHelp":{"#cdata":"[Syntax: MODE=n] \n      \nSpecifies that, when two clusters are joined, each must have at least n members\nin order for either cluster to be designated a modal cluster. If you specify MODE=1, \neach cluster must also have a maximum density greater than the fusion density in \norder for either cluster to be designated a modal cluster."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NOEIGEN","ProcedureOptionHelp":{"#cdata":"Suppresses computation of the eigenvalues of the covariance matrix and substitutes \nthe variances of the variables for the eigenvalues when computing the cubic \nclustering criterion."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOID","ProcedureOptionHelp":{"#cdata":"Suppresses the display of ID values for the clusters joined at each generation \nof the cluster history."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NONORM","ProcedureOptionHelp":{"#cdata":"Prevents the distances from being normalized to unit mean or unit root mean square \nwith most methods."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOPRINT","ProcedureOptionHelp":{"#cdata":"Suppresses the display of all output. Note that this option temporarily disables the\nOutput Delivery System (ODS)."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOSQUARE","ProcedureOptionHelp":{"#cdata":"Prevents input distances from being squared with METHOD=AVERAGE, METHOD=CENTROID, \nMETHOD=MEDIAN, or METHOD=WARD."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOTIE","ProcedureOptionHelp":{"#cdata":"Prevents PROC CLUSTER from checking for ties for minimum distance between clusters \nat each generation of the cluster history."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"OUTTREE=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUTTREE=SAS-data-set] \n      \nCreates an output data set that can be used by the TREE procedure to draw a tree \ndiagram. You must give the data set a two-level name to save it."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"PENALTY=","ProcedureOptionHelp":{"#cdata":"[Syntax: PENALTY=p] \n      \nSpecifies the penalty coefficient used with METHOD=EML."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"PLOTS=","ProcedureOptionHelp":{"#cdata":"Controls the plots produced through ODS Graphics.\n      \nSyntax: \n(1) PLOTS <(global-plot-options)> <= plot-request > \n(2) PLOTS <(global-plot-options)> <= (plot-request <... plot-request >)>\n\nThe global plot options are as follows: \n    MAXCLUS=n -- right-truncates the CCC, PSF, and PST2 plots at the n value. This prevents these \n    plots from losing resolution when a large number of clusters are plotted. The default is MAXCLUS=200. \n\n    MAXPOINTS=n | MAXPTS=n \n    suppresses the dendrogram when the number of clusters exceeds the n value. This prevents an unreadable \n    plot from being produced. The default is MAXPOINTS=200. \n\n    UNPACKPANELS \n    breaks a plot that is otherwise paneled into plots separate plots for each statistic. \n    This option can be abbreviated as UNPACK. \n\n    ONLY -- has no effect, but is accepted for consistency with other procedures. \n\nThe following plot-requests can be specified: \n    ALL -- implicitly specifies the CCC and PSEUDO options and, if possible, produces all three plots. \n    NONE -- suppresses all plots. \n    CCC --  implicitly specifies the CCC option and, if possible, plots the cubic clustering criterion against\n    the number of clusters. \n    PSEUDO -- implicitly specifies the PSEUDO option and, if possible, plots the pseudo f statistic and the pseudo\n    t-square statistic against the number of clusters.  \n    PSF -- implicitly specifies the PSEUDO option and, if possible, plots the pseudo F statistic against the\n    number of clusters. \n    PST2 -- implicitly specifies the PSEUDO option and, if possible, plots the pseudo t-square statistic against\n    the number of clusters."},"ProcedureOptionType":"S|V"},{"ProcedureOptionName":"PRINT=|P=","ProcedureOptionHelp":{"#cdata":"[Syntax: PRINT=n] \n      \nSpecifies the number of generations of the cluster history to display. The P= \noption displays the latest n generations;  for example, P=5 displays the cluster \nhistory from 1 cluster through 5 clusters. The value of P= must be a nonnegative \ninteger. The default is to display all generations. Specify PRINT=0 to suppress \nthe cluster history. "},"ProcedureOptionType":"V"},{"ProcedureOptionName":"PSEUDO","ProcedureOptionHelp":{"#cdata":"Displays pseudo F and t-square statistics."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"R=","ProcedureOptionHelp":{"#cdata":"[Syntax: R=n] \n      \nSpecifies the radius of the sphere of support for uniform-kernel density estimation."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"RMSSTD","ProcedureOptionHelp":{"#cdata":"Displays the root mean square standard deviation of each cluster."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"RSQUARE|RSQ","ProcedureOptionHelp":{"#cdata":"Displays the R square and semipartial R square."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"SIMPLE|S","ProcedureOptionHelp":{"#cdata":"Displays means, standard deviations, skewness, kurtosis, and a coefficient of bimodality."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"STANDARD|STD","ProcedureOptionHelp":{"#cdata":"Standardizes the variables to mean 0 and standard deviation 1. The STANDARD option \napplies only to coordinate data."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"TRIM=","ProcedureOptionHelp":{"#cdata":"[Syntax: TRIM=p] \n      \nOmits points with low estimated probability densities from the analysis."},"ProcedureOptionType":"V"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"FREQ","StatementHelp":{"#cdata":"Syntax: FREQ variable;\n      \nIf one variable in your data set represents the frequency of occurrence for the other \nvalues in the observation, specify the variable’s name in a FREQ statement. PROC CLUSTER \nthen treats the data set as if each observation appears n times, where n is the value of \nthe FREQ variable for observation i."},"StatementOptions":null},{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nObtains separate analyses on observations in groups defined by the BY variables."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"ID","StatementHelp":{"#cdata":"Syntax: ID variable ;\n      \nThe values of the ID variable identify observations in the displayed cluster history \nand in the OUTTREE= data set. If the ID statement is omitted, each observation is denoted \nby OBn, where n is the observation number."},"StatementOptions":null},{"StatementName":"COPY","StatementHelp":{"#cdata":"Syntax: COPY variables ;\n      \nThe variables in the COPY statement are copied from the input data set to the \nOUTTREE= data set. Observations in the OUTTREE= data set that represent clusters \nof more than one observation from the input data set have missing values for the \nCOPY variables. "},"StatementOptions":null},{"StatementName":"VAR|VARIABLES","StatementHelp":{"#cdata":"Syntax: VAR variables ;\n      \nThe VAR statement lists numeric variables to be used in the cluster analysis. If \nyou omit the VAR statement, all numeric variables not listed in other statements \nare used."},"StatementOptions":null},{"StatementName":"RMSSTD","StatementHelp":{"#cdata":"Syntax: RMSSTD variable ;\n      \nIf the coordinates in the DATA= data set represent cluster means (for example, \nformed by the FASTCLUS procedure), you can obtain accurate statistics in the \ncluster histories for METHOD=AVERAGE, METHOD=CENTROID, or METHOD=WARD if the \ndata set contains both of the following: \n\n  o a variable giving the number of original observations in each cluster (see the discussion of the\n    FREQ statement earlier in this chapter) \n\n  o a variable giving the root mean squared standard deviation of each cluster"},"StatementOptions":null}]}}}