{"Procedure":{"Name":"CONVERT","ProductGroup":"BASE","ProcedureHelp":{"#cdata":"Syntax: PROC CONVERT product-specification <option(s)>;\n    \nThe CONVERT procedure converts a BMDP or OSIRIS system file or an SPSS export \nfile to a SAS data set. It produces one output data set, but no printed output.\nThe new data set contains the same information as the input system file;\nexceptions are noted in Output Data Sets. The BMDP, OSIRIS and SPSS engines\nprovide more extensive capabilities.\n\nBecause the BMDP, OSIRIS and SPSS products are maintained by other companies or\norganizations, changes can be made that make the system files incompatible with\nthe current version of PROC CONVERT. SAS upgrades PROC CONVERT only to support\nchanges that are made to these products when a new version of SAS is available."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"BMDP=","ProcedureOptionHelp":{"#cdata":"[Syntax: BMDP=fileref <(CODE=code CONTENT=content-type)>]\n\nConverts into a SAS data set the first member a BMDP save file created under DOS."},"ProcedureOptionType":"V","SubOptionsKeywords":"CODE=|CONTENT="},{"ProcedureOptionName":"OSIRIS=","ProcedureOptionHelp":{"#cdata":"[Syntax: OSIRIS=fileref] \n      \nSpecifies a fileref for the OSIRIS file to be converted into a SAS data set. If\nyou use this product specification, you must also use the DICT= option, which\nspecifies the OSIRIS dictionary to use."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SPSS=","ProcedureOptionHelp":{"#cdata":"[Syntax: SPSS=fileref ]\n\nSpecifies a fileref for the SPSS export file to be converted into a SAS data\nset. The SPSS export file must be created by using the SPSS EXPORT command from\nany operating environment."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"DICT=","ProcedureOptionHelp":{"#cdata":"[Syntax: DICT=fileref ]\n\nSpecifies a fileref of the dictionary file for the OSIRIS file. The DICT=\noption is valid only when used with the OSIRIS product specification."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"FIRSTOBS=","ProcedureOptionHelp":{"#cdata":"[Syntax: FIRSTOBS=n]\n\nGives the number of the observation where the conversion is to begin. This \noption enables you to skip over observations at the beginning of the OSIRIS or\nSPSS/PC system file."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"OBS=","ProcedureOptionHelp":{"#cdata":"[Syntax: OBS=n]\n\nSpecifies the number of the last observation to convert. This option enables you\nto exclude observations at the end of the file."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"OUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUT=n] \n      \nNames the SAS data set created to hold the converted data. If the OUT= option\nis omitted, SAS still creates a Work data set and automatically names it DATAn,\njust as if you omitted a data set name in a DATA statement. If it is the first\nsuch data set in a job or session, SAS names it DATA1, the second is DATA2, and\nso on. If the OUT= option is omitted or if you do not specify a two-level name\n(including a libref) in the OUT= option, the converted data set is stored in\nyour Work data library and by default it is not permanent."},"ProcedureOptionType":"V"}]},"ProcedureStatements":null}}