{"Procedure":{"Name":"CORRELATION","ProductGroup":"CAS|VIYA|VISUAL STATISTICAL PROCEDURES","ProcedureHelp":{"#cdata":"Syntax: PROC CORRELATION <options>; \n    BY variables; \n    DISPLAY <table-list> </ options>; \n    DISPLAYOUT table-spec-list </ options>; \n    FREQ variable; \n    VAR variables; \n    WEIGHT variable; \n    WITH variables; \n    \nThe CORRELATION procedure computes Pearson correlation coefficients and the probabilities associated \nwith these statistics in SAS Viya. \n\nThe Pearson product-moment correlation is a parametric measure of a linear relationship between two \nvariables. When only one set of analysis variables is specified, the default correlation analysis \nincludes descriptive statistics for each analysis variable and pairwise Pearson correlation statistics \nfor these variables. When two sets of analysis variables are specified, the default correlation analysis \nincludes descriptive statistics for each analysis variable and pairwise Pearson correlation statistics \nbetween the two sets of variables. When the relationship between two variables is nonlinear or when \noutliers are present, the correlation coefficient might incorrectly estimate the strength of the \nrelationship."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"ALPHA","ProcedureOptionHelp":{"#cdata":"Calculates and prints Cronbach’s coefficient alpha. PROC CORRELATION computes separate coefficients \nusing raw and standardized values (scaling the variables to a unit variance of 1). For each VAR \nstatement variable, PROC CORRELATION computes the correlation between the variable and the total \nof the remaining variables. It also computes Cronbach’s coefficient alpha by using only the remaining \nvariables."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"BEST=","ProcedureOptionHelp":{"#cdata":"Syntax: BEST=n \n      \nPrints the n highest correlation coefficients for each variable, n ≥ 1. Correlations are ordered \nfrom highest to lowest in absolute value. Otherwise, PROC CORRELATION prints correlations in a \nrectangular table, using the variable names as row and column labels."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"COV","ProcedureOptionHelp":{"#cdata":"Displays the variance and covariance matrix. When you specify the COV option, the Pearson correlations \nwill also be displayed. If you specify the OUTP= option, the output data table also contains the covariance\nmatrix with the corresponding _TYPE_ variable value 'COV.'"},"ProcedureOptionType":"S"},{"ProcedureOptionName":"CSSCP","ProcedureOptionHelp":{"#cdata":"Displays a table of the corrected sums of squares and crossproducts."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"Syntax: DATA=CAS-libref.data-table \n      \nNames the input data table for PROC CORRELATION to use. The default is the most recently created data \ntable. CAS-libref.data-table is a two-level name, where \n\nCAS-libref\n  refers to a collection of information that is defined in the LIBNAME statement and includes the caslib, \n  which includes a path to the data, and a session identifier, which defaults to the active session but \n  which can be explicitly defined in the LIBNAME statement.\n\ndata-table\n  specifies the name of the input data table. "},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"EXCLNPWGT|EXCLNPWGTS","ProcedureOptionHelp":{"#cdata":"Excludes observations with nonpositive weight values from the analysis. By default, PROC CORRELATION \ntreats observations with negative weights like those with zero weights and counts them in the total \nnumber of observations."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOCORR","ProcedureOptionHelp":{"#cdata":"Suppresses displaying of Pearson correlations."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOMISS","ProcedureOptionHelp":{"#cdata":"Excludes observations with missing values from the analysis."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOPROB","ProcedureOptionHelp":{"#cdata":"Suppresses displaying the probabilities associated with each correlation coefficient."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOSIMPLE","ProcedureOptionHelp":{"#cdata":"Suppresses printing simple descriptive statistics for each variable."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"OUTP=","ProcedureOptionHelp":{"#cdata":"Syntax: OUTP=CAS-libref.data-table \n      \nCreates an output data table that contains Pearson correlation statistics. CAS-libref specifies \nthe CAS library where the output data table is to be created, and data-table specifies the name \nof the output data table. This data table also includes means, standard deviations, and the number \nof observations. If you specify the ALPHA option, the output data table also contains six observations \nwith Cronbach’s coefficient alpha."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"RANK","ProcedureOptionHelp":{"#cdata":"Displays the ordered correlation coefficients for each variable. Correlations are ordered from highest \nto lowest in absolute value."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"SSCP","ProcedureOptionHelp":{"#cdata":"Displays a table of the sums of squares and crossproducts."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"VARDEF=","ProcedureOptionHelp":{"#cdata":"Specifies the variance divisor in the calculation of variances and covariances. The default is VARDEF=DF."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"DF","@Value2":"N","@Value3":"WDF","@Value4":"WEIGHT|WGT"},"ProcedureOptionToolTips":{"@ToolTip1":"Degrees of freedom","@ToolTip2":"Number of observations","@ToolTip3":"Sum of weights minus one","@ToolTip4":"Sum of weights"}}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY variables;\n\nYou can specify a BY statement in PROC CORRELATION to obtain separate analyses of observations in groups \nthat are defined by the values of the BY variables. If you specify more than one BY statement, only \nthe last one specified is used."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"DISPLAY","StatementHelp":{"#cdata":"Syntax: DISPLAY <table-list> </ options>;\n      \nThe DISPLAY statement enables you to specify a list of display tables to display or exclude. This statement \nis similar to the ODS SELECT, ODS EXCLUDE, and ODS TRACE statements. However, the DISPLAY statement can improve \nperformance when a large number of tables could be generated (such as in BY-group processing). The procedure \nprocesses the DISPLAY statement on a CAS server and thus sends only a subset of ODS tables to the SAS client. \nBecause ODS statements are processed on a SAS client, all the display tables generated are first sent to the \nclient and then the client creates a subset. If both DISPLAY and ODS statements are used together, the DISPLAY \nstatement takes precedence over the ODS statements."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"CASESENSITIVE","StatementOptionHelp":{"#cdata":"Performs a case-sensitive comparison of table names in the table-list to display table names when \ntables are subsetted for display. To preserve case, you must enclose table names in the table-list \nin quotation marks."},"StatementOptionType":"S"},{"StatementOptionName":"EXCLUDE","StatementOptionHelp":{"#cdata":"Displays all display tables except those specified in the table-list."},"StatementOptionType":"S"},{"StatementOptionName":"EXCLUDEALL","StatementOptionHelp":{"#cdata":"Suppresses display of all tables. This option takes precedence over the other options."},"StatementOptionType":"S"},{"StatementOptionName":"TRACE","StatementOptionHelp":{"#cdata":"Displays the display table names, labels, and paths."},"StatementOptionType":"S"}]}},{"StatementName":"DISPLAYOUT","StatementHelp":{"#cdata":"Syntax: DISPLAYOUT table-spec-list < / options > ;\n      \nThe DISPLAYOUT statement enables you to create CAS output tables from your displayed output. This\nstatement is similar to the ODS OUTPUT statement.\n\nThe table-spec-list specifies a list of CAS output tables to create. Each entry in the list has either a key or a\nkey=value format:\n\n  key=value specifies key as the ODS table name, path, or partial pathname, and specifies value as the\n    CAS output table name.\n  key specifies key as the ODS table name and also as the CAS output table name.\n  \nTable names and partial pathnames are discussed under the DISPLAY statement. The DISPLAYOUT\nstatement does not support regular expressions."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"INCLUDEALL","StatementOptionHelp":{"#cdata":"Creates output CAS tables for all display tables. The name of the created output CAS table is the \nsame as the corresponding display table name. If you specify this option, the table-spec-list specification \nis ignored."},"StatementOptionType":"S"},{"StatementOptionName":"NOREPLACE","StatementOptionHelp":{"#cdata":"Does not replace an existing CAS output table of the same name."},"StatementOptionType":"S"},{"StatementOptionName":"REPEATED","StatementOptionHelp":{"#cdata":"Replicates the CAS output tables on all nodes."},"StatementOptionType":"S"}]}},{"StatementName":"FREQ","StatementHelp":{"#cdata":"Syntax: FREQ variable;\n\nThe variable in the FREQ statement identifies a numeric variable in the data set that contains the \nfrequency of occurrence of each observation. PROC CORRELATION treats each observation as if it appears \nf times, where f is the value of the FREQ variable for the observation. If f is not an integer, it is \ntruncated to an integer. If f is less than 1 or missing, the observation is not used in the analysis. \nWhen the FREQ statement is not specified, each observation is assigned a frequency of 1."},"StatementOptions":null},{"StatementName":"VAR","StatementHelp":{"#cdata":"Syntax: VAR variables;\n\nThe VAR statement lists variables for which to compute correlation coefficients. If the VAR statement \nis not specified, PROC CORRELATION computes correlations for all numeric variables not listed in other \nstatements."},"StatementOptions":null},{"StatementName":"WEIGHT","StatementHelp":{"#cdata":"Syntax: WEIGHT variable;\n\nThe variable in the WEIGHT statement is used in the calculation of Pearson weighted product-moment \ncorrelations. \n\nThe observations with missing weights are excluded from the analysis. By default, for observations \nwith nonpositive weights, weights are set to zero and the observations are included in the analysis. \nYou can use the EXCLNPWGT option to exclude observations with negative or zero weights from the analysis. \nIf a WEIGHT statement is not included, all observations that are used in the analysis are assigned a \nweight of 1."},"StatementOptions":null},{"StatementName":"WITH","StatementHelp":{"#cdata":"Syntax: WITH variables;\n\nThe WITH statement lists variables with which correlations of the VAR statement variables are to be computed."},"StatementOptions":null}]}}}