{"Procedure":{"Name":"CPANEL","ProductGroup":"SAS ECONOMETRICS","ProcedureHelp":{"#cdata":"Syntax: PROC CPANEL <options>;\n    BY variables;\n    CLASS variable <(options)>…<variable <(options)>> </ global-options> ;\n    COMPARE <model-list> </ options>;\n    CORRELATED effects;\n    ENDOGENOUS effects </ option>;\n    ID cross-section-id <time-series-id>;\n    INSTRUMENTS effects </ option>;\n    MODEL response = <effects> </ options>;\n    OUTPUT OUT=CAS-libref.data-table <options>;\n    PREDETERMINED effects </ option>;\n    RESTRICT equation1 <, equation2…>;\n    TEST equation1 <, equation2…>;\n    \nThe CPANEL procedure analyzes a class of linear econometric models that arise when time series \nand cross-sectional data are combined. This type of data is called panel data. Typical examples \nof panel data include observations over time on people, households, countries, or firms. For \nexample, in the case of survey data on household income, the panel is created by repeatedly \nsurveying the same households over many years. The individual entities that are followed over \ntime are called cross sections."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"Syntax: DATA=CAS-libref.data-table\n      \nNames the input data table for PROC CPANEL to use. The default is the most recently created data table. \nCAS-libref.data-table is a two-level name, where\n\nCAS-libref\n  refers to a collection of information that is defined in the LIBNAME statement and includes the caslib, \n  which includes a path to the data, and a session identifier, which defaults to the active session but \n  which can be explicitly defined in the LIBNAME statement.\n  \ndata-table\nspecifies the name of the input data table."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"NOPART","ProcedureOptionHelp":{"#cdata":"Prevents repartitioning of the data. Normally, the CPANEL procedure redistributes the data table so \nthat observations for each cross section are not divided among multiple machines."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOPRINT","ProcedureOptionHelp":{"#cdata":"Suppresses all printed output."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"PRINTALL","ProcedureOptionHelp":{"#cdata":"Prints all available output."},"ProcedureOptionType":"S"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY variables ; \n      \nYou can specify a BY statement in PROC CPANEL to obtain separate analyses of observations in groups \nthat are defined by the values of the BY variables. If you specify more than one BY statement, only \nthe last one specified is used."},"StatementOptions":null},{"StatementName":"CLASS","StatementHelp":{"#cdata":"Syntax: CLASS variable <(options)> <variable <(options)>> </ global-options>;\n\nThe CLASS statement names the classification variables to be used as explanatory variables in the analysis."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING|DESC","StatementOptionHelp":{"#cdata":"Reverses the sort order of the classification variable. If both the DESCENDING and ORDER= options \nare specified, PROC BCHOICE orders the categories according to the ORDER= option and then reverses \nthat order."},"StatementOptionType":"S"},{"StatementOptionName":"MISSING","StatementOptionHelp":{"#cdata":"Treats missing values (., ._, .A, …, .Z for numeric variables and blanks for character variables) \nas valid values for the CLASS variable."},"StatementOptionType":"S"},{"StatementOptionName":"ORDER=","StatementOptionHelp":{"#cdata":"Specifies the sort order for the levels of classification variables. This ordering determines which \nparameters in the model correspond to each level in the data. By default, ORDER=FORMATTED. \nFor ORDER=FORMATTED and ORDER=INTERNAL, the sort order is machine-dependent. When ORDER=FORMATTED \nis in effect for numeric variables for which you have supplied no explicit format, the levels are \nordered by their internal values."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FORMATTED","@Value2":"FREQ","@Value3":"INTERNAL"},"StatementOptionToolTips":{"@ToolTip1":"Levels sorted by the external formatted value, except for numeric variables with no explicit  format, which are sorted by their unformatted (internal) value.","@ToolTip2":"Levels sorted by the descending frequency count (levels that have more observations come ealier  in the order).","@ToolTip3":"Levels sorted by the unformatted value. The sort order is machine-dependent."}},{"StatementOptionName":"PARAM=","StatementOptionHelp":{"#cdata":"Specifies the parameterization method for the classification variable or variables."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"EFFECT","@Value2":"GLM","@Value3":"ORDINAL|THERMOMETER","@Value4":"POLYNOMIAL|POLY","@Value5":"REFERENCE|REF","@Value6":"ORTHEFFECT","@Value7":"ORTHORDINAL|ORTHOTHERM","@Value8":"ORTHPOLY","@Value9":"ORTHREF"},"StatementOptionToolTips":{"@ToolTip1":"Specifies effect coding.","@ToolTip2":"Specifies less-than-full-rank, reference-cell coding; this option can be used  only as a global option.","@ToolTip3":"Specifies the cumulative parameterization for an ordinal CLASS variable.","@ToolTip4":"Specifies polynomial coding.","@ToolTip5":"Specifies reference-cell coding.","@ToolTip6":"Orthogonalizes PARAM=EFFECT.","@ToolTip7":"Orthogonalizes PARAM=ORDINAL.","@ToolTip8":"Orthogonalizes PARAM=POLYNOMIAL.","@ToolTip9":"Orthogonalizes PARAM=REFERENCE."}},{"StatementOptionName":"REFERENCE=|REF=","StatementOptionHelp":{"#cdata":"Syntax: REFERENCE='level'|keyword | REF='level'|keyword \n\nSpecifies the reference level that is used when you specify a nonsingular parameterization. "},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"'<level>'","@Value2":"FIRST","@Value3":"LAST"},"StatementOptionToolTips":{"@ToolTip1":"Specifies the level of the variable to use as the reference level. Specify the formatted value of the variable  if a format is assigned. Replace <level> with an actual value.","@ToolTip2":"Designates the first ordered level as reference.","@ToolTip3":"Designates the last ordered level as reference."}}]}},{"StatementName":"COMPARE","StatementHelp":{"#cdata":"Syntax: COMPARE <model-list> </ options>;\n\nThe COMPARE statement creates tables of side-by-side comparisons of parameter estimates and other model \nstatistics. You can fit multiple models simultaneously by specifying multiple MODEL statements, and you \ncan specify a COMPARE statement to create tables that compare the models.\n\nThe COMPARE statement creates two tables: the first table compares model fit statistics such as R-square \nand mean square error; the second table compares regression coefficients, their standard errors, and \n(optionally) t tests."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"MSTAT","StatementOptionHelp":{"#cdata":"Syntax: MSTAT (mstat-list)\n          \nSpecifies a list of model fit statistics to be displayed. A set of statistics is displayed by default, \nbut you can use this option to specify a custom set of model statistics.\n\nThe mstat-list can contain one or more of the following keywords:\n\nALL displays all model fit statistics.\nDFE displays the error degrees of freedom. This statistic is displayed by default.\nF displays the F statistic of the overall test for no fixed effects.\nFNUMDF displays the numerator degrees of freedom of the overall test for no fixed effects.\nFDENDF displays the denominator degrees of freedom of the overall test for no fixed effects.\nM displays the Hausman test m statistic.\nMDF displays the Hausman test degrees of freedom.\nMSE displays the model mean square error. This statistic is displayed by default.\nNCS displays the number of cross sections. This statistic is displayed by default.\nNOBS displays the number of observations. This statistic is displayed by default.\nNONE suppresses the table of model fit statistics when specified alone.\nNTS displays the maximum length of the time series. This statistic is displayed by default.\nPROBF displays the significance level of the overall test for no fixed effects.\nPROBM displays the significance level of the Hausman test.\nRMSE displays the model root mean square error.\nRSQUARE displays the model R-square fit statistic. This statistic is displayed by default.\nSSE displays the model sum of squares.\nVARCS displays the variance component that corresponds to cross sections in random-effects models.\nVARERR displays the variance component that corresponds to error in random-effects models.\nVARTS displays the variance component that corresponds to time series in random-effects models."},"StatementOptionType":"S","SubOptionsKeywords":"ALL|DFE|F|FNUMDF|FDENDF|M|MDF|MSE|NCS|NOBS|NONE|NTS|PROBF|PROBM|RMSE|RSQUARE|SSE|VARCS|VARERR|VARTS"},{"StatementOptionName":"OUTPARM=","StatementOptionHelp":{"#cdata":"Syntax: OUTPARM=CAS-libref.data-table\n          \nNames an output data set to contain the data from the comparison table for parameter estimates, \nstandard errors, and t tests. CAS-libref.data-table is a two-level name, where CAS-libref refers \nto the caslib and session identifier, and data-table specifies the name of the output data table."},"StatementOptionType":"V"},{"StatementOptionName":"OUTSTAT=","StatementOptionHelp":{"#cdata":"Syntax: OUTSTAT=CAS-libref.data-table\n          \nNames an output data set to contain the data from the comparison table for model fit statistics, \nsuch as R-square and mean square error. CAS-libref.data-table is a two-level name, where CAS-libref\nrefers to the caslib and session identifier, and data-table specifies the name of the output data table."},"StatementOptionType":"V"},{"StatementOptionName":"PSTAT","StatementOptionHelp":{"#cdata":"Syntax: PSTAT (pstat-list)\n          \nSpecifies a list of parameter statistics to be displayed. By default, estimated regression coefficients\nand their standard errors are displayed. Use this option to specify a custom set of parameter statistics.\n\npstat-list can contain one or more of the following keywords:\n\nALL displays all parameter statistics.\nESTIMATE displays the estimated regression coefficient. This statistic is displayed by default.\nNONE suppresses the table of parameter statistics when specified alone.\nSTDERR displays the standard error. This statistic is displayed by default.\nPROBT displays the significance level of the t test.\nT displays the t statistic."},"StatementOptionType":"S","SubOptionsKeywords":"ALL|ESTIMATE|NONE|STDERR|PROBT|T"}]}},{"StatementName":"CORRELATED","StatementHelp":{"#cdata":"Syntax: CORRELATED effects; \n\nThe CORRELATED statement selects the subset of effects from the MODEL statement that are correlated \nwith the individual (or cross-sectional) error term. This statement is valid only when you specify \nthe AMACURDY or HTAYLOR model estimation method in the MODEL statement."},"StatementOptions":null},{"StatementName":"ENDOGENOUS","StatementHelp":{"#cdata":"Syntax: ENDOGENOUS effects </ option>; \n\nThe ENDOGENOUS statement declares a set of effects that are treated as endogenous during estimation, \nand is valid only when performing either instrumental variables regression or dynamic panel estimation."},"StatementOptions":{"StatementOption":{"StatementOptionName":"EQ=","StatementOptionHelp":{"#cdata":"Syntax: EQ=BOTH | DIFF | LEVEL\n          \nSpecifies which equations include the endogenous instruments."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BOTH","@Value2":"DIFF","@Value3":"LEVEL"},"StatementOptionToolTips":{"@ToolTip1":"Includes the endogenous instruments in both the difference and level equations.","@ToolTip2":"Includes the endogenous instruments only in the difference equations.","@ToolTip3":"Includes the endogenous instruments only in the level equations."}}}},{"StatementName":"ID","StatementHelp":{"#cdata":"Syntax: ID cross-section-id <time-series-id>;\n\n\nThe ID statement specifies variables in the input data set that identify the cross section and time \nperiod for each observation. Sometimes estimation does not require a time variable, in which case \nspecifying the time-series-id variable is optional."},"StatementOptions":null},{"StatementName":"INSTRUMENTS","StatementHelp":{"#cdata":"Syntax: INSTRUMENTS effects </ option>;\n\nThe INSTRUMENTS statement specifies instrumental variables and effects, and is valid only when performing \neither instrumental variables regression or dynamic panel estimation."},"StatementOptions":{"StatementOption":{"StatementOptionName":"EQ=","StatementOptionHelp":{"#cdata":"Syntax: EQ=BOTH | DIFF | LEVEL\n          \nSpecifies which equations include the standard instruments."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BOTH","@Value2":"DIFF","@Value3":"LEVEL"},"StatementOptionToolTips":{"@ToolTip1":"Includes the standard instruments in both the difference and level equations.","@ToolTip2":"Includes the standard instruments only in the difference equations.","@ToolTip3":"Includes the standard instruments only in the level equations."}}}},{"StatementName":"MODEL","StatementHelp":{"#cdata":"Syntax: MODEL response = <effects> </ options>;\n\nThe MODEL statement specifies the regression model, the error structure that is assumed for the \nregression residuals, and the estimation technique to be used. The response variable (response) \non the left side of the equal sign is regressed on the independent variables (effects), which \nare listed after the equal sign. You can specify any number of MODEL statements. For each MODEL \nstatement, you can specify only one response."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"AMACURDY","StatementOptionHelp":{"#cdata":"Requests Amemiya-MaCurdy estimation for a model that has correlated individual (cross-sectional) \neffects. You specify the correlated effects by using the CORRELATED statement."},"StatementOptionType":"S"},{"StatementOptionName":"ARTESTS=","StatementOptionHelp":{"#cdata":"Syntax: ARTESTS=integer\n          \nSpecifies the maximum order of the test for the presence of autoregression (AR) effects. By default, \nARTESTS=2."},"StatementOptionType":"V"},{"StatementOptionName":"BIASCORRECTED","StatementOptionHelp":{"#cdata":"Computes the bias-corrected covariance matrix of the two-step generalized method of moments (GMM) estimator."},"StatementOptionType":"S"},{"StatementOptionName":"BTWNG","StatementOptionHelp":{"#cdata":"Estimates a between-groups model."},"StatementOptionType":"S"},{"StatementOptionName":"DLAGS=","StatementOptionHelp":{"#cdata":"Syntax: DLAGS=integer \n          \nSpecifies the number of dependent-variable lags to use as regressors. By default, DLAGS=1."},"StatementOptionType":"V"},{"StatementOptionName":"DYNDIFF","StatementOptionHelp":{"#cdata":"Estimates a dynamic panel by using the generalized method of moments (GMM) on equations that are formed by first differencing."},"StatementOptionType":"S"},{"StatementOptionName":"DYNSYS","StatementOptionHelp":{"#cdata":"Estimates a dynamic panel by using GMM on the system that combines first-differenced equations and level equations."},"StatementOptionType":"S"},{"StatementOptionName":"FDONE","StatementOptionHelp":{"#cdata":"Estimates a one-way model by using first-differenced methods. "},"StatementOptionType":"S"},{"StatementOptionName":"FIXONE","StatementOptionHelp":{"#cdata":"Estimates a one-way fixed-effects model that corresponds to cross-sectional effects only. "},"StatementOptionType":"S"},{"StatementOptionName":"FIXTWO","StatementOptionHelp":{"#cdata":"Estimates a two-way fixed-effects model."},"StatementOptionType":"S"},{"StatementOptionName":"GINV=","StatementOptionHelp":{"#cdata":"Specifies what type of generalized inverse to use."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"G2","@Value2":"G4"},"StatementOptionToolTips":{"@ToolTip1":"Uses the G2 generalized inverse.","@ToolTip2":"Uses the G4 generalized inverse."}},{"StatementOptionName":"GMM=","StatementOptionHelp":{"#cdata":"Syntax: GMM=ONESTEP | TWOSTEP \n          \nSpecifies the number of GMM stages to use in the estimation."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ONESTEP","@Value2":"TWOSTEP"},"StatementOptionToolTips":{"@ToolTip1":"Uses one-step GMM, which is computationally simple but dependent on model assumptions.","@ToolTip2":"Uses two-step GMM, which is computationally intensive but more robust to violations of model assumptions."}},{"StatementOptionName":"HTAYLOR","StatementOptionHelp":{"#cdata":"Requests Hausman-Taylor estimation for a model that has correlated individual (cross-sectional) \neffects. You specify the correlated effects by using the CORRELATED statement."},"StatementOptionType":"S"},{"StatementOptionName":"IBVTWNG","StatementOptionHelp":{"#cdata":"Requests instrumental variables between-groups estimation for a model that has endogenous effects. \nYou specify the endogenous effects by using the ENDOGENOUS statement, and you specify external \ninstruments by using the INSTRUMENTS statement."},"StatementOptionType":"S"},{"StatementOptionName":"IVFIXONE","StatementOptionHelp":{"#cdata":"Requests instrumental variables one-way fixed-effects estimation for a model that has endogenous \neffects. You specify the endogenous effects by using the ENDOGENOUS statement, and you specify \nexternal instruments by using the INSTRUMENTS statement."},"StatementOptionType":"S"},{"StatementOptionName":"IVPOOLED","StatementOptionHelp":{"#cdata":"Requests instrumental variables pooled regression. You specify the endogenous effects by using the \nENDOGENOUS statement, and you specify external instruments by using the INSTRUMENTS statement."},"StatementOptionType":"S"},{"StatementOptionName":"IVRANONE","StatementOptionHelp":{"#cdata":"Requests instrumental variables one-way random-effects estimation for a model that has endogenous \neffects. You specify the endogenous effects by using the ENDOGENOUS statement, and you specify \nexternal instruments by using the INSTRUMENTS statement."},"StatementOptionType":"S"},{"StatementOptionName":"MAXBAND=","StatementOptionHelp":{"#cdata":"Syntax: MAXBAND=integer\n          \nIf specified, sets the maximum number of GMM-style instruments per observation, for each variable."},"StatementOptionType":"V"},{"StatementOptionName":"NOINT","StatementOptionHelp":{"#cdata":"Suppresses the intercept parameter from the model."},"StatementOptionType":"S"},{"StatementOptionName":"NOLABEL","StatementOptionHelp":{"#cdata":"suppresses variable labels from the printed output."},"StatementOptionType":"S"},{"StatementOptionName":"POOLED","StatementOptionHelp":{"#cdata":"Specifies a pooled (OLS) model."},"StatementOptionType":"S"},{"StatementOptionName":"PRINTFIXED","StatementOptionHelp":{"#cdata":"Estimates and prints the fixed effects in models where they would normally be absorbed within the estimation."},"StatementOptionType":"S"},{"StatementOptionName":"RANONE","StatementOptionHelp":{"#cdata":"Estimates a one-way random-effects model."},"StatementOptionType":"S"},{"StatementOptionName":"RANTWO","StatementOptionHelp":{"#cdata":"Estimates a two-way random-effects model."},"StatementOptionType":"S"},{"StatementOptionName":"ROBUST","StatementOptionHelp":{"#cdata":"Computes the robust covariance matrix of the generalized method of moments (GMM) estimator."},"StatementOptionType":"S"},{"StatementOptionName":"VCOMP=","StatementOptionHelp":{"#cdata":"Specifies the type of variance component estimate to use. By default, VCOMP=SA."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FB","@Value2":"NL","@Value3":"SA","@Value4":"WH","@Valu54":"WK"},"StatementOptionToolTips":{"@ToolTip1":"Uses the Fuller-Battese method.","@ToolTip2":"Uses the Nerlove method.","@ToolTip3":"Uses the Swamy-Arora method.","@ToolTip4":"Uses the Wallace-Hussain method.","@ToolTip5":"Uses the Wansbeek-Kapteyn method."}}],"ProcedureOption":[{"ProcedureOptionName":"CORRB","ProcedureOptionHelp":{"#cdata":"Prints the matrix of estimated correlations between the parameter estimates."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"COVB","ProcedureOptionHelp":{"#cdata":"Prints the matrix of estimated covariances between the parameter estimates."},"ProcedureOptionType":"S"}]}},{"StatementName":"OUTPUT","StatementHelp":{"#cdata":"Syntax: OUTPUT OUT=CAS-libref.data-table <options>;\n\nThe OUTPUT statement creates a data table that contains observationwise statistics that PROC CPANEL \ncomputes after fitting the model. In order to avoid data duplication for large data tables, only \nthe identification and dependent variables are included in the output data table unless you specify \nadditional variables in the COPYVAR= option. To avoid further data duplication, the OUTPUT statement \nis allowed only with MODEL statements that request a single estimation. If you have multiple MODEL \nstatements, then each OUTPUT statement is associated with the MODEL statement that immediately \nprecedes it."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"OUT=","StatementOptionHelp":{"#cdata":"Syntax: OUT=CAS-libref.data-table \n          \nNames the output data table for PROC CPANEL to use. You must specify this option before any other options. \nCAS-libref.data-table is a two-level name, where \n\nCAS-libref\n  refers to a collection of information that is defined in the LIBNAME statement and includes the caslib, \n  which includes a path to where the data table is to be stored, and a session identifier, which defaults \n  to the active session but which can be explicitly defined in the LIBNAME statement."},"StatementOptionType":"V"},{"StatementOptionName":"COPYVAR=|COPYVARS=","StatementOptionHelp":{"#cdata":"Syntax: COPYVAR=variable | COPYVARS=(variables)\n          \nTransfers one or more variables from the input data set to the output data table."},"StatementOptionType":"V"},{"StatementOptionName":"PREDICTED=|P=","StatementOptionHelp":{"#cdata":"Syntax: PREDICTED=name | P=name\n          \nWrites the predicted values to the output data set."},"StatementOptionType":"V"},{"StatementOptionName":"RESIDUAL=|R=","StatementOptionHelp":{"#cdata":"Syntax: RESIDUAL=name | R=name\n          \nWrites the residuals to the output data set."},"StatementOptionType":"V"}]}},{"StatementName":"PREDETERMINED","StatementHelp":{"#cdata":"Syntax: REDETERMINED effects </ option>;\n\nThe PREDETERMINED statement specifies a set of variables whose instruments follow a prescribed form \nthat is appropriate for predetermined regressors, and is valid only when you perform dynamic panel \nestimation by specifying the DYNDIFF or DYNSYS options in the MODEL statement."},"StatementOptions":{"StatementOption":{"StatementOptionName":"EQ=","StatementOptionHelp":{"#cdata":"Syntax: EQ=BOTH | DIFF | LEVEL\n          \nSpecifies which equations include the standard instruments."},"StatementOptionValues":{"@Value1":"BOTH","@Value2":"DIFF","@Value3":"LEVEL"},"StatementOptionType":"V","StatementOptionToolTips":{"@ToolTip1":"Includes the predetermined instruments in both the difference and level equations.","@ToolTip2":"Includes the predetermined instruments only in the difference equations.","@ToolTip3":"Includes the predetermined instruments only in the level equations."}}}},{"StatementName":"RESTRICT","StatementHelp":{"#cdata":"Syntax: RESTRICT equation <, equation2…> ;\n\nThe RESTRICT statement specifies linear equality restrictions on the parameters in the previous MODEL \nstatement. There can be as many unique restrictions as the number of parameters in the preceding MODEL \nstatement. Multiple RESTRICT statements are understood as joint restrictions on a model’s parameters. \nRestrictions on the intercept are obtained by the use of the INTERCEPT keyword. RESTRICT statements \nbefore the first MODEL statement are automatically associated with the first MODEL statement, in addition \nto any RESTRICT statements that follow it but precede subsequent MODEL statements."},"StatementOptions":null},{"StatementName":"TEST","StatementHelp":{"#cdata":"Syntax: TEST equation <, equation2…> < / options> ;\n\nThe TEST statement performs Wald, Lagrange multiplier, and likelihood ratio tests of linear hypotheses \nabout the regression parameters in the preceding MODEL statement. Like RESTRICT statements, TEST statements \nbefore the first MODEL statement are automatically associated with the first MODEL statement, in addition \nto any TEST statements that follow it but precede subsequent MODEL statements."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ALL","StatementOptionHelp":{"#cdata":"Requests Wald, Lagrange multiplier, and likelihood ratio tests."},"StatementOptionType":"S"},{"StatementOptionName":"WALD","StatementOptionHelp":{"#cdata":"Requests the Wald test."},"StatementOptionType":"S"},{"StatementOptionName":"LM","StatementOptionHelp":{"#cdata":"Requests the Lagrange multiplier test."},"StatementOptionType":"S"},{"StatementOptionName":"LR","StatementOptionHelp":{"#cdata":"Requests the likelihood ratio test."},"StatementOptionType":"S"}]}}]}}}