{"Procedure":{"Name":"FAMILY","ProductGroup":"SAS/GENETICS","ProcedureHelp":{"#cdata":"Syntax: PROC FAMILY <options> ; \n    BY variables ; \n    ID variables ; \n    TRAIT variable </ AFFECTED= value> ; \n    VAR variables ; \n    XLVAR variables ; \n  \nFamily genotype data, though more difficult to collect, often provide a more effective way \nof testing markers for association with disease status than case-control data. Case-control \ndata can uncover significant associations between markers and a disease that could be caused \nby factors other than linkage, such as population structure. Analyzing family data by using \nthe FAMILY procedure ensures that any significant associations found between a marker and \ndisease status are due to linkage between the marker and disease locus. This is accomplished \nby using the transmission/disequilibrium test (TDT) and several variations of it that can \naccommodate different types of family data. One type of family consists of parents, at least \none heterozygous, and an affected child who have all been genotyped. This family structure is \nsuitable for the original TDT. Families having at least one affected and one unaffected sibling \nfrom a sibship that have both been genotyped can be analyzed using the sibling tests: the sib \nTDT (S-TDT) or the nonparametric sibling disequilibrium test (SDT). Both types of families can \nbe jointly analyzed using the combined versions of the S-TDT and SDT and the reconstruction-\ncombined TDT (RC-TDT). The RC-TDT can additionally accommodate families with no unaffected \nchildren and missing parental genotypes in certain situations."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"COMBINE","ProcedureOptionHelp":{"#cdata":"Specifies that the combined versions of the S-TDT and SDT be performed. Thus, families \ncontaining parental genotypes can be analyzed under certain conditions by using the \nTDT; otherwise the specified sibling test is performed. Note that if TDT is also \nbeing performed, the TDT is done independently of any other tests. By default, the \ncombined versions are not used."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"CONTCORR|CC","ProcedureOptionHelp":{"#cdata":"Specifies that a continuity correction of 0.5 should be used for the TDT, S-TDT, \nand RC-TDT tests in their asymptotic normal approximations. By default, no \ncorrection is used."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nNames the input SAS data set to be used by PROC FAMILY. The default is to use the \nmost recently created data set."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"DELIMITER=","ProcedureOptionHelp":{"#cdata":"[Syntax: DELIMITER=’string’] \n      \nIndicates the string that is used to separate the two alleles that compose the \ngenotypes contained in the variables specified in the VAR statement. This option \nis ignored if GENOCOL is not specified."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"GENOCOL","ProcedureOptionHelp":{"#cdata":"Indicates that columns specified in the VAR statement contain genotypes instead \nof alleles. When this option is specified, there is one column per marker. The \ngenotypes must consist of the two alleles separated by a delimiter."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"MULT=","ProcedureOptionHelp":{"#cdata":"Specifies which multiallelic version of the TDT, S-TDT, SDT, and RC-TDT tests should be performed. \n      \nBy default, the joint version of the multiallelic tests is performed. This option \nhas no effect on biallelic markers."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"JOINT","@Value2":"MAX"},"ProcedureOptionToolTips":{"@ToolTip1":"Combines the analyses for each allele at a marker into one overall test statistic,  with degrees of freedom (df) corresponding to the number of alleles at the  marker.","@ToolTip2":"Determines whether there is at least one allele with a significant test statistic,  using the maximum 1 df statistic over all alleles with a multiple testing  adjustment made."}},{"ProcedureOptionName":"NDATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: NDATA=SAS-data-set] \n      \nNames the input SAS data set containing names, or identifiers, for the markers used in \nthe output. There must be a NAME variable in this data set, which should contain the same \nnumber of rows as there are markers in the input data set specified in the DATA= option. \nWhen there are fewer rows than there are markers, markers without a name are named using \nthe PREFIX= option. Likewise, if there is no NDATA= data set specified, the PREFIX= option \nis used. If both the VAR and XLVAR statements are specified, names are first used for the \nmarkers in the VAR statement, then for the X-linked markers."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"OUTQ=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUTQ=SAS-data-set] \n      \nNames the output SAS data set containing all the variables from the input data set \nin addition to the allelic transmission scores at each marker allele to be used in \ntesting for association and linkage with a quantitative trait. When this option is \nused, the TRAIT statement is not required."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"OUTSTAT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUTSTAT=SAS-data-set] \n      \nNames the output SAS data set containing the p-values for the tests specified in the \nPROC FAMILY statement. When this option is omitted, an output data set is created by \ndefault and named according to the DATAn convention."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"PERMS=","ProcedureOptionHelp":{"#cdata":"[Syntax: PERMS=number] \n      \nIndicates that Monte Carlo estimates of exact p-values for the family-based tests should \nbe calculated using permutation samples instead of the p-values from the asymptotic χ² \ndistribution. Large values of number (10,000 or more) are usually recommended for accuracy, \nbut long execution times can result, particularly with large data sets. When this option is \nomitted, no permutations are performed and p-values from the asymptotic χ² distribution are \nreported."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"PREFIX=","ProcedureOptionHelp":{"#cdata":"[Syntax: PREFIX=prefix] \n      \nSpecifies a prefix to use in constructing names for marker variables in all output. \nFor example, if PREFIX=VAR, the names of the variables are VAR1, VAR2, ..., VARn. \nNote that this option is ignored when the NDATA= option is specified, unless there \nare fewer names in the NDATA data set than there are markers. If this option is \nomitted, PREFIX=M is the default when variables contain alleles; if GENOCOL is \nspecified, then the names of the variables specified in the VAR statement are used \nas the marker names."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"RCTDT","ProcedureOptionHelp":{"#cdata":"Requests that the reconstruction-combined TDT (RC-TDT) be performed. If none of \nthe four test options (RCTDT, SDT, STDT, or TDT) are specified, then all four \ntests are performed by default. Note that error checking is always performed on \nfamilies with at least one untyped parent in order to determine whether or not \nreconstruction of parental genotypes can be attempted."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"SDT","ProcedureOptionHelp":{"#cdata":"Requests that the SDT, a nonparametric alternative to the S-TDT, be performed. If \nnone of the four test options (RCTDT, SDT, STDT, or TDT) are specified, then all \nfour tests are performed by default. The COMBINE option can be used with this test \nto indicate that the combined version of the SDT should be performed."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"SEED=","ProcedureOptionHelp":{"#cdata":"[Syntax: SEED=number] \n      \nSpecifies the initial seed for the random number generator used for permuting the \ndata to calculate estimates of exact p-values. This option is ignored if PERMS= is \nnot specified. The value for number must be an integer; the computer clock time is \nused if the option is omitted or an integer less than or equal to 0 is specified."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SHOWALL","ProcedureOptionHelp":{"#cdata":"Indicates that all families and markers should be included in the \"Family Summary\" \ntable. When this option is omitted, a family is included in the table only for a \nmarker where there is a genotype error according to a Mendelian inconsistency."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"STDT","ProcedureOptionHelp":{"#cdata":"Requests that the sibling TDT (S-TDT), which analyzes data from sibships, be performed. \nIf none of the four test options (RCTDT, SDT, STDT, or TDT) are specified, then all \nfour tests are performed by default. The COMBINE option can be used with this test to \nindicate that the combined version of the S-TDT should be performed."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"TDT","ProcedureOptionHelp":{"#cdata":"Requests that the original TDT be performed. If none of the four test options \n(RCTDT, SDT, STDT, or TDT) are specified, then all four tests are performed\nby default."},"ProcedureOptionType":"S"}]},"ProcedureStatements":[{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nYou can specify a BY statement with PROC FAMILY to obtain separate analyses on \nobservations in groups defined by the BY variables. When a BY statement appears, \nthe procedure expects the input data set to be sorted in the order of the BY \nvariables. The variables are one or more variables in the input data set."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"ID","StatementHelp":{"#cdata":"Syntax: ID variables ; \n\nThe ID statement is required and must contain, in the following order, either of these \nsequences of IDs: \n\n  o the pedigree ID, the individual ID, then the two parental ID variables \n\n  o the individual ID, then the two parental IDs \n\nThus if only three variables are specified in the ID statement, it is assumed that \nthe pedigree identifier has been omitted. The pedigree ID is not necessary if all the \nindividual identifiers are unique. The individual and two parental ID variables can be \neither numeric or character, but all three must be of the same type. The pedigree variable, \nif specified, can be either numeric or character regardless of the type of the other \nthree identifiers."},"StatementOptions":null},{"StatementName":"TRAIT","StatementHelp":{"#cdata":"Syntax: TRAIT variable </ AFFECTED=value> ; \n\nThe TRAIT statement identifies the trait variable and is required when the OUTQ= \noption is omitted. This variable must be binary, but it can be either character \nor numeric. By default, the second value of the TRAIT variable that appears in the \ninput data set is considered to be \"affected\" for the tests."},"StatementOptions":{"StatementOption":{"StatementOptionName":"AFFECTED=","StatementOptionHelp":{"#cdata":"[Syntax: AFFECTED=value] \n          \nBy default, the second value of the TRAIT variable that appears in the input data set \nis considered to be \"affected\" for the tests. To specify a different value for \"affected,\" \nadd the /AFFECTED=value option to the TRAIT statement. For a variable with a numeric format, \nthe number that corresponds to \"affected\" should be specified (AFFECTED=1); if the variable \nhas a character format, the level that corresponds to \"affected\" should be specified in \nquotes (AFFECTED=\"a\")."},"StatementOptionType":"V"}}},{"StatementName":"VAR","StatementHelp":{"#cdata":"Syntax: VAR variables ; \n\nThe VAR statement identifies the variables containing either the marker alleles or, \nif GENOCOL is specified, the marker genotypes. By default, the VAR statement should \ncontain 2m variable names, where m is the number of markers in the data set. Note that \nvariables containing alleles for the same marker should be listed consecutively. \nWhen GENOCOL is specified, there should be one variable per marker."},"StatementOptions":null},{"StatementName":"XLVAR","StatementHelp":{"#cdata":"Syntax: XLVAR variables</ SEX=variable> ; \n\nThe XLVAR statement identifies the variables containing either the X-linked marker \nalleles or, if GENOCOL is specified, genotypes. By default, the XLVAR statement should \ncontain 2m variable names, where m is the number of X-linked markers in the data set. Note \nthat variables containing alleles for the same marker should be listed consecutively. The \nsecond allele variable for males in the data set must be nonmissing but is ignored since \nmales have only one allele at markers on the X-chromosome. When GENOCOL is specified, \nthere should be one variable per marker."},"StatementOptions":{"StatementOption":{"StatementOptionName":"SEX=","StatementOptionHelp":{"#cdata":"[Syntax: SEX=variable] \n          \nWhen X-linked markers are analyzed, there must be a SEX variable in the data set \nindicating whether individuals are male (1 or \"M\") or female (2 or \"F\"). If this \nvariable is named something other than SEX, the /SEX=variable option must be added \nto the XLVAR statement in order to indicate the name of the variable containing \nindividuals’ sex. See X-Linked Version of Tests for more information about X-linked \ntests."},"StatementOptionType":"V"}}}]},null]}}