{"Procedure":{"Name":"FASTKNN","ProductGroup":"CAS|VIYA|DATA MINING AND MACHINE LEARNING","ProcedureHelp":{"#cdata":"Syntax: PROC FASTKNN <options>;\n    DISPLAY <table-list> </ options>;\n    DISPLAYOUT table-spec-list </ options>;\n    ID variables;\n    INPUT variables;\n    OUTPUT OUT=CAS-libref.data-table <options>;\n    \nThe FASTKNN procedure implements the k-nearest neighbor (k-NN) search algorithm in SAS Viya. \nThe k-NN algorithm has numerous applications, including recommendation systems, image search, \nfingerprint recognition, and clustering. You can use the FASTKNN procedure to read and write \ndata in distributed form, and to perform search in parallel by making full use of multicore \ncomputers or distributed computing environments."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"Syntax: DATA=CAS-libref.data-table \n\nNames the input data table for PROC FASTKNN to use. The default is the most recently created data \ntable. CAS-libref.data-table is a two-level name, where \n\nCAS-libref\n  refers to a collection of information that is defined in the LIBNAME statement and includes \n  the caslib, which includes a path to the data, and a session identifier, which defaults to \n  the active session but which can be explicitly defined in the LIBNAME statement.\n  \ndata-table\n  specifies the name of the input data table."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"K=","ProcedureOptionHelp":{"#cdata":"Syntax: K=number\n      \nSpecifies the number of neighbors to return, where number is a positive real number.\n\nBy default, K=2."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NOPRINT","ProcedureOptionHelp":{"#cdata":"Suppresses ODS output."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NTHREADS=","ProcedureOptionHelp":{"#cdata":"Syntax: NTHREADS=number-of-threads\n      \nSpecifies the number of threads to use for the computation, where number-of-threads is an integer \nfrom 1 to 64, inclusive. The default value is the maximum number of available threads per computer."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"OUTDIST=","ProcedureOptionHelp":{"#cdata":"Syntax: OUTDIST=CAS-libref.data-table\n      \nSpecifies the output model data table to contain the computed pairwise distances between query \nand input observations. CAS-libref.data-table is a two-level name, where CAS-libref refers to \nthe caslib and session identifier, and data-table specifies the name of the output data table."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"PARALLELIZATION=","ProcedureOptionHelp":{"#cdata":"Syntax: PARALLELIZATION=INPUT | QUERY\n      \nSpecifies which data table to distribute among worker nodes.\n\nBy default, PARALLELIZATION=QUERY."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"INPUT","@Value2":"QUERY"},"ProcedureOptionToolTips":{"@ToolTip1":"Distributes the input data table among worker nodes. Specify this value only when the input data table is much larger than the query data table.","@ToolTip2":"Distributes the query data table among worker nodes."}},{"ProcedureOptionName":"QUERY=","ProcedureOptionHelp":{"#cdata":"Syntax: QUERY=CAS-libref.data-table\n      \nSpecifies the input data table that contains the query observations. CAS-libref.data-table \nis a two-level name, where CAS-libref refers to the caslib and session identifier, and \ndata-table specifies the name of the input data table."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"THRESHDIST=","ProcedureOptionHelp":{"#cdata":"Syntax: THRESHDIST=number\n      \nSpecifies the distance threshold for the model, where number is an integer greater than 0. \nPROC FASTKNN excludes from the computation distances greater than number.\n\nBy default, THRESHDIST=100."},"ProcedureOptionType":"V"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"DISPLAY","StatementHelp":{"#cdata":"Syntax: DISPLAY <table-list> </ options>;\n      \nThe DISPLAY statement enables you to specify a list of display tables to display or exclude. This statement \nis similar to the ODS SELECT, ODS EXCLUDE, and ODS TRACE statements. However, the DISPLAY statement can improve \nperformance when a large number of tables could be generated (such as in BY-group processing). The procedure \nprocesses the DISPLAY statement on a CAS server and thus sends only a subset of ODS tables to the SAS client. \nBecause ODS statements are processed on a SAS client, all the display tables generated are first sent to the \nclient and then the client creates a subset. If both DISPLAY and ODS statements are used together, the DISPLAY \nstatement takes precedence over the ODS statements."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"CASESENSITIVE","StatementOptionHelp":{"#cdata":"Performs a case-sensitive comparison of table names in the table-list to display table names when \ntables are subsetted for display. To preserve case, you must enclose table names in the table-list \nin quotation marks."},"StatementOptionType":"S"},{"StatementOptionName":"EXCLUDE","StatementOptionHelp":{"#cdata":"Displays all display tables except those specified in the table-list."},"StatementOptionType":"S"},{"StatementOptionName":"EXCLUDEALL","StatementOptionHelp":{"#cdata":"Suppresses display of all tables. This option takes precedence over the other options."},"StatementOptionType":"S"},{"StatementOptionName":"TRACE","StatementOptionHelp":{"#cdata":"Displays the display table names, labels, and paths."},"StatementOptionType":"S"}]}},{"StatementName":"DISPLAYOUT","StatementHelp":{"#cdata":"Syntax: DISPLAYOUT table-spec-list < / options > ;\n      \nThe DISPLAYOUT statement enables you to create CAS output tables from your displayed output. This\nstatement is similar to the ODS OUTPUT statement.\n\nThe table-spec-list specifies a list of CAS output tables to create. Each entry in the list has either a key or a\nkey=value format:\n\n  key=value specifies key as the ODS table name, path, or partial pathname, and specifies value as the\n    CAS output table name.\n  key specifies key as the ODS table name and also as the CAS output table name.\n  \nTable names and partial pathnames are discussed under the DISPLAY statement. The DISPLAYOUT\nstatement does not support regular expressions."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"INCLUDEALL","StatementOptionHelp":{"#cdata":"Creates output CAS tables for all display tables. The name of the created output CAS table is the same \nas the corresponding display table name. If you specify this option, the table-spec-list specification \nis ignored."},"StatementOptionType":"S"},{"StatementOptionName":"NOREPLACE","StatementOptionHelp":{"#cdata":"Does not replace an existing CAS output table of the same name."},"StatementOptionType":"S"},{"StatementOptionName":"REPEATED","StatementOptionHelp":{"#cdata":"Replicates all CAS output tables on all nodes."},"StatementOptionType":"S"}]}},{"StatementName":"ID","StatementHelp":{"#cdata":"Syntax: ID variable;\n\nThe ID statement lists one variable to be copied from the input data table to the output data \ntables that are specified in the OUT= option in the OUTPUT statement and in the OUTDIST= option \nin the PROC FASTKNN statement. You must specify one variable, which must be numeric."},"StatementOptions":null},{"StatementName":"INPUT","StatementHelp":{"#cdata":"Syntax: INPUT variables;\n\nThe INPUT statement specifies the variables to be used in the nearest neighbor search. \nThe variables must be of interval type. You must specify at least one input variable."},"StatementOptions":null},{"StatementName":"OUTPUT","StatementHelp":{"#cdata":"Syntax: OUTPUT OUT=CAS-libref.data-table <options>;\n\nThe OUTPUT statement creates an output data table to contain the results of the procedure run."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"OUT=","StatementOptionHelp":{"#cdata":"Syntax: OUT=CAS-libref.data-table\n          \nNames the output data table for PROC FASTKNN to use. You must specify this option before any other options. \nCAS-libref.data-table is a two-level name, where\n\n  CAS-libref refers to a collection of information that is defined in the LIBNAME statement and\n    includes the caslib, which includes a path to where the data table is to be stored, and\n    a session identifier, which defaults to the active session but which can be explicitly\n    defined in the LIBNAME statement.\n\n  data-table specifies the name of the output data table."},"StatementOptionType":"V"},{"StatementOptionName":"COPYVAR=","StatementOptionHelp":{"#cdata":"Syntax: COPYVAR=variable | COPYVARS=(variables)\n          \nLists one or more variables from the input data table to be transferred to the output data table."},"StatementOptionType":"V"}]}}]}}}