{"Procedure":{"Name":"FISM","ProductGroup":"CAS|VIYA|DATA MINING AND MACHINE LEARNING","ProcedureHelp":{"#cdata":"Syntax: PROC FISM options;\n    CUSTOMER variables;\n    OUTPUT options;\n    TARGET variable;\n    \nThe FISM procedure performs frequent item set mining, which looks for frequent patterns in a large \ndatabase. The FISM procedure finds frequent patterns by using the FP-growth (frequent-pattern growth) \nalgorithm of Han, Pei, and Yin (2000). The FP-growth algorithm uses a special data structure called \nthe frequent-pattern tree (FP-tree), which retains the item set association information. \n\nThe FISM procedure is used by other procedures such as the MBANALYSIS procedure for association rule \nmining."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"Syntax: DATA=CAS-libref.data-table\n      \nNames the input data table for PROC FISM to use. CAS-libref.data-table is a two-level name,\nwhere\n\n  CAS-libref refers to a collection of information that is defined in the LIBNAME statement and\n    includes the caslib, which includes a path to the data, and a session identifier, which\n    defaults to the active session but which can be explicitly defined in the LIBNAME\n    statement.\n    \n  data-table specifies the name of the input data table."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"SUPPORT=","ProcedureOptionHelp":{"#cdata":"Syntax: SUPPORT=number\n      \nSpecifies the minimum level of support (minimum frequency of an item) for a rule, where number \nmust be an integer greater than or equal to 0. This option overrides the specification of the \nPCTSUP= option."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"PCTSUP=|SUPPCT=|SUP_PCT=|PCTSUPPORT=","ProcedureOptionHelp":{"#cdata":"Syntax: PCTSUP=number | SUPPCT=number | SUP_PCT=number | PCTSUPPORT=number\n      \nSpecifies the minimum level of support for a rule as a percentage of the number of baskets in the \ninput data table, where number must be a real number between 0 and 100, inclusive. This option is \nignored if the SUPPORT= option is specified."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"ITEMS=","ProcedureOptionHelp":{"#cdata":"Syntax: ITEMS=number\n      \nSpecifies the number of items in a frequent item set, where number must be an integer between 1 \nand 1,000. By default, ITEMS=2 when you specify the OUT= option in the OUTPUT statement; otherwise, \nITEMS=1 by default. This option is ignored if you specify the NFIS_RANGE= option."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NFIS_RANGE=","ProcedureOptionHelp":{"#cdata":"Syntax: NFIS_RANGE=(number, number)\n      \nSpecifies the range of number of items in the frequent item sets, where number must be an integer \nbetween 1 and 1,000.\n\nBy default, NFIS_RANGE=(1,1000)."},"ProcedureOptionType":"V"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"CUSTOMER","StatementHelp":{"#cdata":"Syntax: CUSTOMER variable;\n\nThe CUSTOMER statement groups one or more specified target variables into a basket. You can \nalso specify this statement as ID variables."},"StatementOptions":null},{"StatementName":"OUTPUT","StatementHelp":{"#cdata":"Syntax: OUTPUT OUTPUT options;\n\nThe OUTPUT statement specifies output tables that contain result of FISM procedure."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"OUT=","StatementOptionHelp":{"#cdata":"Syntax: OUT=CAS-libref.data-table\n          \nThe OUTPUT statement creates a data table to contain the predicted target values of the input table\n\nCAS-libref.data-table is a two-level name,\nwhere\n\n  CAS-libref refers to a collection of information that is defined in the LIBNAME statement and\n    includes the caslib, which includes a path to where the data table is to be stored, and\n    a session identifier, which defaults to the active session but which can be explicitly\n    defined in the LIBNAME statement. \n    \n  data-table specifies the name of the output data table."},"StatementOptionType":"V"},{"StatementOptionName":"OUTFREQ=","StatementOptionHelp":{"#cdata":"Syntax: OUTFREQ=CAS-libref.data-table\n          \nCreates a data table that contains information about the unique frequent items with their \ntransaction counts and support. CAS-libref.data-table is a two-level name, where CAS-libref \nrefers to the caslib and session identifier, and data-table specifies the name of the output \ndata table."},"StatementOptionType":"V"}]}},{"StatementName":"TARGET","StatementHelp":{"#cdata":"Syntax: TARGET variable;\n\nThe TARGET statement specifies a single nominal variable to use as the target variable. If this variable \nis not present in the input data table, then PROC FISM exits with an error."},"StatementOptions":null}]}}}