{"Procedure":{"Name":"FMM","ProductGroup":"SAS/STAT","ProcedureHelp":{"#cdata":"Syntax: PROC FMM <options> ; \n  BAYES bayes-options ; \n  BY variables ; \n  CLASS variables </ TRUNCATE> ; \n  FREQ variable ; \n  ID variables ; \n  MODEL response<(response-options)> = <effects> </ model-options> ; \n  MODEL events/trials = <effects> </ model-options> ; \n  MODEL + <effects> </ model-options> ; \n  OUTPUT <OUT=SAS-data-set> <keyword<(keyword-options)> <=name>>...\n    <keyword<(keyword-options)> <=name>> </ options> ; \n  PERFORMANCE performance-options ; \n  PROBMODEL <effects> </ probmodel-options> ; \n  RESTRICT <’label’> constraint-specification <, ..., constraint-specification>\n    <operator <value>> </ option> ; \n  WEIGHT variable ; \n    \nThe FMM procedure estimates the parameters in univariate finite mixture models and \nproduces various statistics to evaluate parameters and model fit. The following list \nsummarizes some basic features of the FMM procedure: \n\n  o maximum likelihood estimation for all models \n  o Markov chain Monte Carlo estimation for many models, including zero-inflated Poisson models \n  o many built-in link and distribution functions for modeling, including the beta, shifted t, \n    Weibull, beta-binomial, and generalized Poisson distributions, in addition to many standard \n    members of the exponential family of distributions \n  o specialized built-in mixture models such as the binomial cluster model (Morel and \n    Nagaraj 1993, Morel and Neerchal 1997, Neerchal and Morel 1998) \n  o acceptance of multiple MODEL statements to build mixture models in which the model effects, \n    distributions, or link functions vary across mixture components \n  o model-building syntax using CLASS and effect-based MODEL statements familiar from many \n    other SAS/STAT procedures (for example, the GLM, GLIMMIX, and MIXED procedures) \n  o evaluation of sequences of mixture models when you specify ranges for the number of components \n  o simple syntax to impose linear equality and inequality constraints among parameters \n  o ability to model regression and classification effects in the mixing probabilities through \n    the PROBMODEL statement \n  o ability to incorporate full or partially known component membership into the analysis \n    through the PARTIAL= option in the PROC FMM statement \n  o OUTPUT statement that produces a SAS data set with important statistics for interpreting \n    mixture models, such as component log likelihoods and prior and posterior probabilities \n  o ability to add zero-inflation to any model \n  o output data set with posterior parameter values for the Markov chain \n  o high degree of multithreading for high-performance optimization and Monte Carlo sampling \n\nThe FMM procedure uses ODS Graphics to create graphs as part of its output."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"ABSCONV=|ABSTOL=","ProcedureOptionHelp":{"#cdata":"[Syntax: ABSCONV=r | ABSTOL=r] \n      \n Specifies an absolute function convergence criterion. For minimization, termination \n requires f(Ψᵏ) ≤ r, where Ψ is the vector of parameters in the optimization and f(.) \n is the objective function. The default value of  is the negative square root of the \n largest double-precision value, which serves only as a protection against overflows."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"ABSFCONV=|ABSFTOL=","ProcedureOptionHelp":{"#cdata":"[Syntax: ABSFCONV=r<n> | ABSFTOL=r<n>] \n      \n Specifies an absolute function difference convergence criterion. For all techniques \n except NMSIMP, termination requires a small change of the function value in successive \n iterations: \n\n    | f(Ψᵏ ¯¹) - f(Ψᵏ) |  ≤ r\n       \nHere, Ψ denotes the vector of parameters that participate in the optimization, \nand f(.) is the objective function. The same formula is used for the NMSIMP \ntechnique, but Ψ(k) is defined as the vertex with the lowest function value, \nand Ψᵏ ¯¹ is defined as the vertex with the highest function value in the simplex. \nThe default value is r=0. The optional integer value n specifies the number of \nsuccessive iterations for which the criterion must be satisfied before the \nprocess can be terminated."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"ABSGCONV=|ABSGTOL=","ProcedureOptionHelp":{"#cdata":"[Syntax: ABSFCONV=r<n> | ABSFTOL=r<n>] \n      \n Specifies an absolute gradient convergence criterion. Termination requires the \n maximum absolute gradient element to be small: \n\n       max|gᵢf(Ψᵏ)| ≤ r\n\nHere, Ψ denotes the vector of parameters that participate in the optimization, \nand gᵢ(.) is the gradient of the objective function with respect to the ᵢth parameter. \nThis criterion is not used by the NMSIMP technique. The default value is r=1E-5. \nThe optional integer value n specifies the number of successive iterations for \nwhich the criterion must be satisfied before the process can be terminated."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"COMPONENTINFO|COMPINFO|CINFO","ProcedureOptionHelp":{"#cdata":"Produces a table with additional details about the fitted model components."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"COV","ProcedureOptionHelp":{"#cdata":"Produces the covariance matrix of the parameter estimates. For maximum likelihood \nestimation, this matrix is based on the inverse (projected) Hessian matrix. For \nBayesian estimation, it is the empirical covariance matrix of the posterior\nestimates. The covariance matrix is shown for all parameters, even if they did \nnot participate in the optimization or sampling."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"COVI","ProcedureOptionHelp":{"#cdata":"Produces the inverse of the covariance matrix of the parameter estimates. For maximum \nlikelihood estimation, the covariance matrix is based on the inverse (projected) Hessian \nmatrix. For Bayesian estimation, it is the empirical covariance matrix of the posterior \nestimates. This matrix is then inverted by sweeping, and rows and columns that correspond \nto linear dependencies or singularities are zeroed."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"CORR","ProcedureOptionHelp":{"#cdata":"Produces the correlation matrix of the parameter estimates. For maximum likelihood \nestimation this matrix is based on the inverse (projected) Hessian matrix. For \nBayesian estimation, it is based on the empirical covariance matrix of the posterior \nestimates."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"CRITERION=","ProcedureOptionHelp":{"#cdata":"Specifies the criterion by which the FMM procedure ranks models when multiple models \n are evaluated during maximum likelihood estimation. \n \n The default is CRITERION=LOGL."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"LOG|ILL","@Value2":"AIC","@Value3":"AICC","@Value4":"BIC","@Value5":"PEARSON","@Value6":"GRADIENT"},"ProcedureOptionToolTips":{"@ToolTip1":"Based on the mixture log likelihood","@ToolTip2":"Based on Akaike’s information criterion","@ToolTip3":"Based on the bias-corrected AIC criterion","@ToolTip4":"Based on the Bayesian information criterion","@ToolTip5":"Based on the Pearson statistic","@ToolTip6":"Based on the largest element of the gradient (in absolute value)"}},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nNames the SAS data set to be used by PROC FMM. The default is the most recently \ncreated data set."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"EXCLUSION=|EXCLUDE=","ProcedureOptionHelp":{"#cdata":"Specifies how the FMM procedure handles support violations of observations. For \nexample, in a mixture of two Poisson variables, negative response values are not \npossible. However, in a mixture of a Poisson and a normal variable, negative values \nare possible, and their likelihood contribution to the Poisson component is zero. \nAn observation that violates the support of one component distribution of the model \nmight be a valid response with respect to one or more other component distributions. \nThis requires some nuanced handling of support violations in mixture models.\n\nThe default exclusion technique is EXCLUSION=ALL.\n\nIn the single-component case, EXCLUSION=ALL and EXCLUSION=ANY are identical."},"ProcedureOptionType":"S|V","ProcedureOptionValues":{"@Value1":"NONE","@Value2":"ANY","@Value3":"ALL"},"ProcedureOptionToolTips":{"@ToolTip1":"Permits an observation into the analysis regardless of support violations.","@ToolTip2":"Observations from the analysis if the response violates the support of any  component distributions.","@ToolTip3":"Removes an observation from the analysis only if it violates the support of  all component distributions."}},{"ProcedureOptionName":"FCONV=|FTOL=","ProcedureOptionHelp":{"#cdata":"[Syntax: FCONV=r<n> | FTOL=r<n>] \n      \n Specifies a relative function convergence criterion. For all techniques except NMSIMP, \n termination requires a small relative change of the function value in successive iterations, \n\n       | f(Ψᵏ) -  f(Ψᵏ ¯¹) | / |f(Ψᵏ ¯¹)|  ≤ r\n\nHere, Ψ denotes the vector of parameters that participate in the optimization, and f(.) \nis the objective function. The same formula is used for the NMSIMP technique, but Ψᵏ is \ndefined as the vertex with the lowest function value, and Ψᵏ ¯¹ is defined as the vertex \nwith the highest function value in the simplex. The default is r=10**(-FDIGITS), where \nFDIGITS is by default -log₁₀{Ԑ}, and Ԑ is the machine precision. The optional integer \nvalue n specifies the number of successive iterations for which the criterion must be \nsatisfied before the process can terminate."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"FITDETAILS","ProcedureOptionHelp":{"#cdata":"Requests that the \"Optimization Information,\" \"Iteration History,\" and \"Fit Statistics\" \ntables be produced for all optimizations when models with different number of components \nare evaluated. For example, the following statements fit a binomial regression model with \nup to three components and produces fit and optimization information for all three: \n\n  proc fmm fitdetails;\n     model y/n  = x / kmax=3;\n  run;\n\nWithout the FITDETAILS option, only the \"Fit Statistics\" table for the selected model \nis displayed."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"GCONV=|GTOL=","ProcedureOptionHelp":{"#cdata":"[Syntax: FCONV=r<n> | FTOL=r<n>] \n      \n Specifies a relative gradient convergence criterion. The default value is r=1E-8.\n \n The optional integer value n specifies the number of successive iterations for which \n the criterion must be satisfied before the process can terminate."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"HESSIAN","ProcedureOptionHelp":{"#cdata":"Displays the Hessian matrix of the model. This option is not available for \nBayesian estimation."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"INVALIDLOGL=","ProcedureOptionHelp":{"#cdata":"Syntax: INVALIDLOGL=r\n      \nSpecifies the value assumed by the FMM procedure if a log likelihood cannot be \ncomputed (for example, because the value of the response variable falls outside \nof the response distribution’s support). The default value is -1E20."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"ITDETAILS","ProcedureOptionHelp":{"#cdata":"Adds parameter estimates and gradients to the \"Iteration History\" table. If the FMM \nprocedure centers or scales the model variables (or both), the parameter estimates \nand gradients reported during the iteration refer to that scale. You can suppress \ncentering and scaling with the NOCENTER option."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"MAXFUNC=|MAXFU=","ProcedureOptionHelp":{"#cdata":"[Syntax: MAXFUNC=n | MAXFU=n] \n      \nSpecifies the maximum number of function calls in the optimization process. The default \nvalues are as follows, depending on the optimization technique: \n\n  TRUREG, NRRIDG, and NEWRAP: 125 \n\n  QUANEW and DBLDOG: 500 \n\n  CONGRA: 1000 \n\n  NMSIMP: 3000 \n\nThe optimization can terminate only after completing a full iteration. Therefore, \nthe number of function calls that are actually performed can exceed the number that \nis specified by the MAXFUNC= option. You can choose the optimization technique with \nthe TECHNIQUE= option."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"MAXITER=|MAXIT=","ProcedureOptionHelp":{"#cdata":"[Syntax: MAXITER=n | MAXIT=n] \n      \nSpecifies the maximum number of iterations in the optimization process. The default \nvalues are as follows, depending on the optimization technique: \n\n  TRUREG, NRRIDG, and NEWRAP: 50 \n\n  QUANEW and DBLDOG: 200 \n\n  CONGRA: 400 \n\n  NMSIMP: 1000 \n\nThese default values also apply when n is specified as a missing value. You can \nchoose the optimization technique with the TECHNIQUE= option."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"MAXTIME=","ProcedureOptionHelp":{"#cdata":"[Syntax: MAXTIME=r] \n      \nSpecifies an upper limit of r seconds of CPU time for the optimization process. \nThe default value is the largest floating-point double representation of your \ncomputer. The time specified by the MAXTIME= option is checked only once at the \nend of each iteration. Therefore, the actual running time can be longer than \nthat specified by the MAXTIME= option."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"MINITER=|MINIT=","ProcedureOptionHelp":{"#cdata":"[Syntax: MINITER=n | MINIT=n] \n      \nSpecifies the minimum number of iterations. The default value is 0. If you request \nmore iterations than are actually needed for convergence to a stationary point, the \noptimization algorithms can behave strangely. For example, the effect of rounding \nerrors can prevent the algorithm from continuing for the required number of iterations."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NAMELEN=","ProcedureOptionHelp":{"#cdata":"[Syntax: NAMELEN=number] \n      \nSpecifies the length to which long effect names are shortened. The default and \nminimum value is 20."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NOCENTER","ProcedureOptionHelp":{"#cdata":"Requests that regressor variables not be centered or scaled. By default the FMM procedure \ncenters and scales columns of the X matrix if the models contain intercepts. If NOINT \noptions in MODEL statements are in effect, the columns of X are scaled but not centered. \nCentering and scaling can help with the stability of estimation and sampling algorithms. \nThe FMM procedure does not produce a table of the centered and scaled coefficients and \nprovides no user control over the type of centering and scaling that is applied. The \nNOCENTER option turns any centering and scaling off and processes the raw values of the \ncontinuous variables."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOCLPRINT=","ProcedureOptionHelp":{"#cdata":"[Syntax: NOCLPRINT<=number>] \n      \nSuppresses the display of the \"Class Level Information\" table, if you do not specify \nnumber. If you specify number, the values of the classification variables are displayed \nfor only those variables whose number of levels is less than number. Specifying a number \nhelps to reduce the size of the \"Class Level Information\" table if some classification \nvariables have a large number of levels."},"ProcedureOptionType":"S|V"},{"ProcedureOptionName":"NOITPRINT","ProcedureOptionHelp":{"#cdata":"Suppresses the display of the \"Iteration History Information\" table."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOPRINT","ProcedureOptionHelp":{"#cdata":"Suppresses the normal display of tabular and graphical results. The NOPRINT option \nis useful when you want to create only one or more output data sets with the procedure. \nThis option temporarily disables the Output Delivery System (ODS); "},"ProcedureOptionType":"S"},{"ProcedureOptionName":"ORDER=","ProcedureOptionHelp":{"#cdata":"Specifies the sorting order for the levels of CLASS variables. This ordering \ndetermines which parameters in the model correspond to each level in the data. \n\nWhen the default ORDER=FORMATTED is in effect for numeric variables for which you \nhave supplied no explicit format, the levels are ordered by their internal values. \nTo order numeric class levels with no explicit format by their BEST12. formatted \nvalues, you can specify this format explicitly for the CLASS variables. \n\nWhen FORMATTED and INTERNAL values are involved, the sort order is machine-dependent. \n\nThe ORDER= option in the PROC FMM statement has no effect on the sort order of the \nwheeze variable because it does not appear in the CLASS statement. \n\nWhen you specify a response-option in the MODEL statement, it overrides the ORDER= \noption in the PROC FMM statement."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"DATA","@Value2":"FORMATTED","@Value3":"FREQ","@Value4":"INTERNAL","@Value5":"FREQDATA","@Value6":"FREQFORMATTED","@Value7":"FREQINTERNAL"},"ProcedureOptionToolTips":{"@ToolTip1":"Sorts the levels by order of appearance in the input data set.","@ToolTip2":"Sorts the levels by external formatted value, except for numeric variables with no  explicit format, which are sorted by their unformatted (internal) value.","@ToolTip3":"Sorts the levels by descending frequency count; levels with the most observations  come first in the order.","@ToolTip4":"Sorts the levels by unformatted value.","@ToolTip5":"Sorts the levels by order of descending frequency count, and within counts by order  of appearance in the input data set when counts are tied.","@ToolTip6":"Sorts the levels by order of descending frequency count, and within counts by  formatted value (as above) when counts are tied.","@ToolTip7":"Sorts the levels by order of descending frequency count, and within counts by  unformatted value when counts are tied."}},{"ProcedureOptionName":"PARMSTYLE=","ProcedureOptionHelp":{"#cdata":"[Syntax: PARMSTYLE=EFFECT | LABEL] \n      \nSpecifies the display style for parameters and effects. \n\nThe EFFECT style is the default for models that contain effects; otherwise the \nLABEL style is used (for example, in homogeneous mixtures). You can change the \ndisplay style with the PARMSTYLE= option. Regardless of the display style, ODS \noutput data sets that contain information about parameter estimates contain \ncolumns for both styles."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"EFFECT","@Value2":"LABEL"},"ProcedureOptionToolTips":{"@ToolTip1":"Identifies a parameter with an \"Effect\" column and adds separate columns  for the CLASS variables in the model.","@ToolTip2":"Creates one column, named Parameter, that combines the relevant information about  a parameter into a single column. If your model contains multiple CLASS variables,  the LABEL style might use space more economically."}},{"ProcedureOptionName":"PARTIAL=|MEMBERSHIP=","ProcedureOptionHelp":{"#cdata":"[Syntax: PARTIAL=variable | MEMBERSHIP=variable] \n      \nSpecifies a variable in the input data set that identifies component membership. \nYou can specify missing values for observations whose component membership is \nundetermined; this is known as a partial classification (McLachlan and Peel 2000, \np. 75). For observations with known membership, the likelihood contribution is no \nlonger a mixture."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"PLOTS=","ProcedureOptionHelp":{"#cdata":"Controls the plots produced through ODS Graphics. Specify the PLOTS=NONE option in order to \nprevent these plots from being produced when ODS Graphics is enabled.\n\nSyntax:\n(1) PLOTS <(global-plot-options)> <= plot-request <(options)>> \n(2) PLOTS <(global-plot-options)> <= (plot-request <(options)> <... plot-request <(options)>>)> \n\nThe global-plot-options apply to all relevant plots generated by the FMM procedure. \nThe global-plot-options supported by the FMM procedure are as follows: \n\n  UNPACKPANEL | UNPACK \n  breaks a graphic that is otherwise paneled into individual component plots.\n  \n  ONLY \n  produces only the specified plots. This option is useful if you do not want the \n  procedure to generate all default graphics, but only the ones specified."},"ProcedureOptionType":"S|V","ProcedureOptionValues":{"@Value1":"ALL","@Value2":"NONE","@Value3":"DENSITY","@Value4":"TRACE"},"ProcedureOptionToolTips":{"@ToolTip1":"Requests that all plots appropriate for the analysis be produced.","@ToolTip2":"Requests that no ODS graphics be produced.","@ToolTip3":"[Syntax: DENSITY<(density-options)>]                                  Requests a plot of the data histogram and mixture density function. This graphic  is a default graphic in models without effects in the MODEL statements and is  available only in these models. Furthermore, all distributions involved in the  mixture must be continuous. You can specify the following density-options to modify  the plot:     CUMULATIVE | CDF --  displays the histogram and densities in cumulative form.     NBINS=n | BINS=n    specifies the number of bins in the histogram; n is greater than or equal to 0. By default,    the FMM procedure computes a suitable bin width and number of bins, based on the range of    the response and the number of usable observations. The option has no effect for binary data.     NOCOMPONENTS | NOCOMP    suppresses the component densities from the plot. If the component densities are displayed,    they are scaled so that their sum equals the mixture density at any point on the graph. In    single-component models, this option has no effect.     NODENSITY | NODENS    suppresses the computation of the mixture density (and the component densities if the    COMPONENTS suboption is specified). If you specify the NOHISTOGRAM and the NODENSITY    option, no graphic is produced.     NOLABEL    suppresses the component identification with labels. By default, the FMM procedure labels    component densities in the legend of the plot. If you do not specify a model label with the    LABEL= option in the MODEL statement, an identifying label is constructed from the parameter    estimates that are associated with the component.      NOHISTOGRAM | NOHIST    suppresses the computation of the histogram of the raw values. If you specify the NOHISTOGRAM    and the NODENSITY option, no graphic is produced.     NPOINTS=n | N=n    specifies the number of values used to compute the density functions; n is greater than or    equal to 0. The default is N=200.     WIDTH=value| BINWIDTH=value    specifies the bin width for the histogram. The value is specified in units of the response    variable and must be positive. The option has no effect for binary data.","@ToolTip4":"[Syntax: TRACE<(tadpanel-options)>]                                  Requests a trace panel with posterior diagnostics for a Bayesian analysis. If a BAYES statement   is present, the trace panel plots are generated by default, one for each sampled parameter. You   can specify the following tadpanel-options to modify the graphic:      BOX | BOXPLOT -- replaces the autocorrelation plot with a box plot of the posterior sample.     SMOOTH=NONE|MEAN|SPLINE    adds a reference estimate to the trace plot. By default, SMOOTH=NONE. SMOOTH=MEAN uses the    arithmetic mean of the trace as the reference. SMOOTH=SPLINE adds a penalized B-spline.     REFERENCE= reference-style    adds vertical reference lines to the density plot, trace plot, and box plot. The available    options for the reference-style are:         NONE -- suppresses the reference lines        EQT --  requests equal-tail intervals        HPD --  requests intervals of highest posterior density. The level for the credible or HPD          intervals is chosen based on the \"Posterior Interval Statistics\" table.         PERCENTILES -- (or PERC) for percentiles. Up to three percentiles can be displayed, as based        on the \"Posterior Summary Statistics\" table.         The default is REFERENCE=CREDIBLE.     UNPACK -- unpacks the panel graphic and displays its elements as separate plots."},"SubOptionsKeywords":"\n        BOX|BOXPLOT|SMOOTH=|REFERENCE=|UNPACK\n      "},{"ProcedureOptionName":"SEED=","ProcedureOptionHelp":{"#cdata":"[Syntax: SEED=n] \n      \nDetermines the random number seed for analyses that depend on a random number stream. \nIf you do not specify a seed or if you specify a value less than or equal to zero, the \nseed is generated from reading the time of day from the computer clock. The largest \npossible value for the seed is 2³¹-1. The seed value is reported in the \"Model Information\" \ntable. \n\nYou can use the SYSRANDOM and SYSRANEND macro variables after a PROC FMM run to query \nthe initial and final seed values. However, using the final seed value as the starting \nseed for a subsequent analysis does not continue the random number stream where the \nprevious analysis left off. The SYSRANEND macro variable provides a mechanism to pass \non seed values to ensure that the sequence of random numbers is the same every time \nyou run an entire program. \n\nAnalyses that use the same (nonzero) seed are not completely reproducible if they are \nexecuted with a different number of threads since the random number streams in separate \nthreads are independent. You can control the number of threads used by the FMM procedure \nwith system options or through the PERFORMANCE statement in the FMM procedure."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SINGCHOL=","ProcedureOptionHelp":{"#cdata":"[Syntax: SINGCHOL=number] \n      \nTunes the singularity criterion in Cholesky decompositions. The default is 1E4 times \nthe machine epsilon; this product is approximately 1E-12 on most computers."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SINGRES=","ProcedureOptionHelp":{"#cdata":"[Syntax: SINGRES=number] \n      \nSets the tolerance for which the residual variance is considered to be zero. \nThe default is 1E4 times the machine epsilon; this product is approximately \n1E-12 on most computers."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SINGULAR=","ProcedureOptionHelp":{"#cdata":"[Syntax: SINGULAR=number] \n      \nTunes the general singularity criterion applied by the FMM procedure \nin sweeps and inversions. The default is 1E4 times the machine epsilon; \nthis product is approximately 1E-12 on most computers."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"TECHNIQUE=|TECH=","ProcedureOptionHelp":{"#cdata":"[Syntax: TECHNIQUE=keyword | TECH=keyword] \n      \nSpecifies the optimization technique to obtain maximum likelihood estimates."},"ProcedureOptionType":"V","StatementOptionValues":{"@Value1":"CONGRA","@Value2":"DBLDOG","@Value3":"NEWRAP","@Value4":"NMSIMP","@Value5":"NONE","@Value6":"NRRIDG","@Value7":"QUANEW","@Value8":"TRUREG"},"StatementOptionToolTips":{"@ToolTip1":"Performs a conjugate-gradient optimization.","@ToolTip2":"Performs a version of double-dogleg optimization.","@ToolTip3":"Performs a Newton-Raphson optimization combining a line-search algorithm with ridging.","@ToolTip4":"Performs a Nelder-Mead simplex optimization.","@ToolTip5":"Performs no optimization.","@ToolTip6":"Performs a Newton-Raphson optimization with ridging.","@ToolTip7":"Performs a dual quasi-Newton optimization.","@ToolTip8":"Performs a trust-region optimization."}}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BAYES","StatementHelp":{"#cdata":"Syntax: BAYES bayes-options ;  \n      \nThe BAYES statement requests that the parameters of the model be estimated by Markov chain \nMonte Carlo sampling techniques. The FMM procedure can estimate by maximum likelihood the \nparameters of all models supported by the procedure. Bayes estimation, on the other hand, \nis available for only a subset of these models. \n\nIn Bayesian analysis, it is essential to examine the convergence of the Markov chains before \nyou proceed with posterior inference. With ODS Graphics turned on, the FMM procedure produces \ngraphs at the end of the procedure output; these graphs enable you to visually examine the \nconvergence of the chain. Inferences cannot be made if the Markov chain has not converged. \n\nThe output produced for a Bayesian analysis is markedly different from that for a frequentist \n(maximum likelihood) analysis for the following reasons: \n\n  o Parameter estimates do not have the same interpretation in the two analyses. Parameters are \n    fixed unknown constants in the frequentist context and random variables in a Bayesian analysis. \n\n  o The results of a Bayesian analysis are summarized through chain diagnostics and posterior \n    summary statistics and intervals. \n\n  o The FMM procedure samples the mixing probabilities in Bayesian models directly, rather than \n    mapping them onto a logistic (or other) scale. \n\nThe FMM procedure applies highly specialized sampling algorithms in Bayesian models. For \nsingle-component models without effects, a conjugate sampling algorithm is used where \npossible. For models in the exponential family that contain effects, the sampling algorithm \nis based on Gamerman (1997). For the normal and t distributions, a conjugate sampler is the \ndefault sampling algorithm for models with and without effects. In multi-component models, \nthe sampling algorithm is based on latent variable sampling through data augmentation \n(Frühwirth-Schnatter 2006) and the Gamerman or conjugate sampler. Because of this \nspecialization, the options for controlling the prior distributions of the parameters \nare limited."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"BETAPRIORPARMS=","StatementOptionHelp":{"#cdata":"Syntax: BETAPRIORPARMS=pair-specification \nBETAPRIORPARMS(pair-specification ...pair-specification) \n\nSpecifies the parameters for the normal prior distribution of the parameters that \nare associated with model effects (βs). The pair-specification is of the form (a,b), \nand the values a and b are the mean and variance of the normal distribution, respectively. \n\nThe form of the BETAPRIORPARMS with an equal sign and a single pair is used to specify \none pair of prior parameters that applies to all components in the mixture."},"StatementOptionType":"S|V"},{"StatementOptionName":"DIAGNOSTICS=","StatementOptionHelp":{"#cdata":"Controls the number of diagnostics produced."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ALL","@Value2":"NONE","@Value3":"<(keyword-list)>"},"StatementOptionToolTips":{"@ToolTip1":"Requests all posterior diagnostics.","@ToolTip2":"Suppresses the computation of posterior diagnostics.","@ToolTip3":"The following keywords enable you to select subsets of posterior diagnostics;  the default is DIAGNOSTICS=(AUTOCORR):     AUTOCORR<(LAGS= numeric-list)>   Computes for each sampled parameter the autocorrelations of lags specified in the LAGS= list.     ESS -- Computes Carlin’s estimate of the effective sample size, the correlation time, and the efficiency   of the chain for each parameter.      GEWEKE<(geweke-options)>-- Computes the Geweke spectral density diagnostics, which are essentially a two-sample t test   between the first f1 portion and the last f2 portion of the chain. The default is f1=0.1 and f2=0.5. The geweke-options are:       FRAC1=value -- Specifies the fraction f1 for the first window.       FRAC2=value -- Specifies the fraction f2 for the second window.     HEIDELBERGER<(heidel-options)> -- Computes the Heidelberger and Welch diagnostic (which consists of a stationarity test    and a half-width test) for each variable. The heidel-options are:        SALPHA=value -- Specifies the α level for the stationarity test. By default, SALPHA=0.05.       HALPHA=value -- Specifies the α level for the halfwidth test. By default, HALPHA=0.05.       EPS=value -- Specifies a positive number ε such that if the halfwidth is less than ε times the sample mean       of the retained iterates, the halfwidth test is passed.               MCERROR | MCSE --Computes an estimate of the Monte Carlo standard error for each parameter.   MAXLAG=n -- specifies the largest lag used in computing the effective sample size and the Monte Carlo standard error.    Specifying this option implies the ESS and MCERROR options. The default is MAXLAG=250.     RAFTERY<(raftery-options)> -- Computes Raftery and Lewis diagnostics that evaluate accuracy of the estimated    quantile of a chain. raftery-options are:       QUANTILE= | Q=value -- Specifies the order (a value between 0 and 1) of the quantile of interest. The default is 0.025.       ACCURACY= | R=value -- Specifies a small positive number as the margin of error for measuring the accuracy of estimation       of the quantile. The default is 0.005.       PROBABILITY= | S=value -- Specifies the probability of attaining the accuracy of the estimation of the quantile. The default is 0.95.       EPSILON= | EPS=value -- Specifies the tolerance level (a small positive number) for the stationary test. The default is 0.001."},"SubOptionsKeywords":"\n              EPSILON=|EPS=|PROBABILITY=|S=|ACCURACY=|R=|QUANTILE=|Q=|\n              RAFTERY|RL|MCERROR|MCSE|HALPHA=|SALPHA=|HEIDELBERGER|HEIDEL|\n              FRAC1|FRAC2|GEWEKE|ALPHA|NCHAIN|GELMAN|ESS|AUTOCORR|LAGS=\n            "},{"StatementOptionName":"MIXPRIORPARMS=","StatementOptionHelp":{"#cdata":"Syntax: MIXPRIORPARMS=K | MIXPRIORPARMS(value-list) \n\nSpecifies the parameters used in constructing the Dirichlet prior distribution for the \nmixing parameters. If you specify MIXPRIORPARMS=K, the parameters of the k-dimensional \nDirichlet distribution are a vector that contains the number of components in the model (k), \nwhatever that might be. You can specify an explicit list of parameters in value-list. \nIf the MIXPRIORPARMS option is not specified, the default Dirichlet parameter vector \nis a vector of length k of ones. This results in a uniform prior over the unit simplex; \nfor k=2, this is the uniform distribution."},"StatementOptionType":"S|V"},{"StatementOptionName":"ESTIMATE=","StatementOptionHelp":{"#cdata":"Syntax: ESTIMATE=MEAN | MAP \n\nDetermines which overall estimate is used, based on the posterior sample, in the \ncomputation of OUTPUT statistics and certain ODS graphics.\n\nIn any event, a message is written to the SAS log if postprocessing results depend \non a summary estimate of the posterior sample."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"MEAN","@Value2":"MAP"},"StatementOptionToolTips":{"@ToolTip1":"By default, the arithmetic average of the (thinned) posterior sample is used.","@ToolTip2":"The parameter vector is used that corresponds to the maximum log posterior density  in the posterior sample."}},{"StatementOptionName":"INITIAL=","StatementOptionHelp":{"#cdata":"Syntax: INITIAL=DATA | MLE | MODE | RANDOM \n\nDetermines how initial values for the Markov chain are obtained. "},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"DATA","@Value2":"MLE","@Value3":"MODE","@Value4":"RANDOM"},"StatementOptionToolTips":{"@ToolTip1":"The default when a conjugate sampler is used is INITIAL=DATA, in which case the  FMM procedure uses the same algorithm to obtain data-dependent starting values  as it uses for maximum likelihood estimation.","@ToolTip2":"If no conjugate sampler is available or if you use the METROPOLIS option to explicitly  request that it not be used, then the default is INITIAL=MLE, in which case the maximum  likelihood estimates are used as the initial values. If the maximum likelihood optimization  fails, the FMM procedure switches to the default INITIAL=DATA.","@ToolTip3":"Specifies to use the mode draw from the prior distribution to obtain initial values.  If the mode does not exist or if it falls on the boundary of the parameter space,  the prior mean is used instead.","@ToolTip4":"Specifies to use the random draw from the prior distribution to obtain initial values.  If the mode does not exist or if it falls on the boundary of the parameter space, the  prior mean is used instead."}},{"StatementOptionName":"METROPOLIS","StatementOptionHelp":{"#cdata":"Requests that the FMM procedure use the Metropolis-Hastings sampling algorithm based \non Gamerman (1997), even in situations where a conjugate sampler is available."},"StatementOptionType":"S"},{"StatementOptionName":"MUPRIORPARMS=","StatementOptionHelp":{"#cdata":"Syntax: MUPRIORPARMS=pair-specification \nMUPRIORPARMS( pair-specification ...pair-specification)\n\nSpecifies the parameters for the means in homogeneous mixtures without regression \ncoefficients. The pair-specification is of the form (a,b), where a and b are the two \nparameters of the prior distribution, optionally delimited with a comma. The actual \ndistribution of the parameter is implied by the distribution selected in the MODEL \nstatement. For example, it is a normal distribution for a mixture of normals, a \ngamma distribution for a mixture of Poisson variables, a beta distribution for a \nmixture of binary variables, and an inverse gamma distribution for a mixture of \nexponential variables."},"StatementOptionType":"S|V"},{"StatementOptionName":"NBI=","StatementOptionHelp":{"#cdata":"[Syntax: NBI=n \n\nSpecifies the number of burn-in samples. During the burn-in phase, chains are not saved. \n\nThe default is NBI=2000."},"StatementOptionType":"V"},{"StatementOptionName":"NMC=|SAMPLE=","StatementOptionHelp":{"#cdata":"Syntax: NMC=n | SAMPLE=n\n          \nSpecifies the number of Monte Carlo samples after the burn-in. Samples after the burn-in \nphase are saved unless they are thinned with the THIN= option. The default is NMC=10000."},"StatementOptionType":"V"},{"StatementOptionName":"OUTPOST=","StatementOptionHelp":{"#cdata":"[Syntax: OUTPOST<(outpost-options)>=data-set \n\nRequests that the posterior sample be saved to a SAS data set. In addition to variables \nthat contain log likelihood and log posterior values, the OUTPOST data set contains \nvariables for the parameters. The variable names for the parameters are generic \n(Parm_1, Parm_2, , Parm_p). The labels of the parameters are descriptive and correspond \nto the \"Parameter Mapping\" table that is produced when the OUTPOST= option is in effect. \n\nYou can specify the following outpost-options in parentheses: \n  LOGPRIOR \n  adds the value of the log prior distribution to the data set. \n\n  NONSINGULAR|NONSING|COMPRESS \n  eliminates parameters that correspond to singular columns in the design matrix (and were \n  not sampled) from the posterior data set. This is the default. \n\n  SINGULAR|SING \n  adds columns of zeros to the data set in positions that correspond to singularities in \n  the model or to parameters that were not sampled for other reasons. By default, these \n  columns of zeros are not written to the posterior data set."},"StatementOptionType":"S|V","SubOptionsKeywords":"LOGPRIOR|NONSINGULAR|NONSING|COMPRESS|SINGULAR|SING"},{"StatementOptionName":"PHIPRIORPARMS=","StatementOptionHelp":{"#cdata":"Syntax: PHIPRIORPARMS=pair-specification |\nPHIPRIORPARMS( pair-specification ...pair-specification) \n\nSpecifies the parameters for the inverse gamma prior distribution of the scale \nparameters (ϕ’s) in the model. \n\nThe form of the PHIPRIORPARMS with an equal sign and a single pair is used to specify one pair \nof prior parameters that applies to all components in the mixture. For example: \n\n  proc fmm seed=12345;\n     model y = / k=2;\n     bayes phipriorparms=(2.001,1.001);\n  run;\n\nThe form with a list of pairs is used to specify different prior parameters for the scale \nparameters in different components. For example: \n\n  proc fmm seed=12345;\n     model y = / k=2;\n     bayes phipriorparms( (.,1.001)  (3.001,2.001) );\n  run;"},"StatementOptionType":"S|V"},{"StatementOptionName":"PRIOROPTIONS|PRIOROPTS","StatementOptionHelp":{"#cdata":"[Syntax: PRIOROPTIONS <=>(prior-options) | PRIOROPTS <=>(prior-options) \n\nSpecifies options related to the construction of the prior distribution and the \nchoice of their parameters. Some prior-options apply only in particular models. \n\nYou can specify the following prior-options: \n\n  CONDITIONAL|COND \n  chooses a conditional prior specification for the homogeneous normal and t distribution \n  response components. \n\n  DEPENDENT|DEP \n  chooses a data-dependent prior for the homogeneous models without effects.\n  \n  VAR=f \n  specifies the variance for normal prior distributions. The default is VAR=1000. \n  \n  MLE<=r> \n  specifies that the prior distribution for regression variables be based on a multivariate \n  normal distribution centered at the MLEs and whose dispersion is a multiple r of the \n  asymptotic MLE covariance matrix. The default is MLE=10."},"StatementOptionType":"S|V"},{"StatementOptionName":"STATISTICS=|SUMMARIES=","StatementOptionHelp":{"#cdata":"Controls the number of posterior statistics produced.\n          \nSyntax: STATISTICS <(global-options)> = ALL | NONE | keyword | (keyword-list) \n\nThe global-options include the following: \n\nALPHA=numeric-list \ncontrols the probabilities of the credible intervals. The ALPHA= values must be between 0 and 1.\n\nPERCENT=numeric-list \nrequests the percentile points of the posterior samples. The PERCENT= values must be between 0 and 100.\nThe default is PERCENT=25, 50, 75, which yield the 25th, 50th, and 75th percentile points, respectively,\nfor each parameter."},"StatementOptionType":"S|V","StatementOptionValues":{"@Value1":"ALL","@Value2":"NONE","@Value3":"SUMMARY","@Value4":"INTERVAL","@Value5":"(SUMMARY INTERVAL)"},"StatementOptionToolTips":{"@ToolTip1":"Is equivalent to specifying STATISTICS=(SUMMARY INTERVAL).","@ToolTip2":"Suppresses the computation of posterior statistics","@ToolTip3":"Produces the means, standard deviations, and percentile points for the posterior  samples. The default is to produce the 25th, 50th, and 75th percentiles; you can  modify this list with the global PERCENT= option.","@ToolTip4":"Produces equal-tail and HPD credible intervals. The default is to produce the 95%  equal-tail credible intervals and 95% HPD credible intervals, but you can use the  ALPHA= global-option to request credible intervals for any probabilities.","@ToolTip5":"Produces the means, standard deviations, and percentile points for the posterior  samples, and produces equal-tail and HPD credible intervals."},"SubOptionsKeywords":"ALPHA=|PERCENT="},{"StatementOptionName":"THINNING=|THIN=","StatementOptionHelp":{"#cdata":"Syntax: THINNING=n | THIN=n\n          \nControls the thinning of the Markov chain after the burn-in."},"StatementOptionType":"V"},{"StatementOptionName":"TIMEINC=","StatementOptionHelp":{"#cdata":"Syntax: TIMEINC=n\n          \nSpecifies a time interval in seconds to report progress during the burn-in and sampling \nphase. The time interval is approximate, since the minimum time interval in which the \nFMM procedure can respond depends on the multithreading configuration."},"StatementOptionType":"V"}]}},{"StatementName":"MODEL","StatementHelp":{"#cdata":"Syntax: MODEL response <(response-options)> = <effects> </ model-options> ; \nMODEL events/trials = <effects>< / model-options> ; \nMODEL + <effects>< / model-options> ; \n \nThe MODEL statement defines elements of the mixture model, such as the model effects, \nthe distribution, and the link function. At least one MODEL statement is required. You \ncan specify more than one MODEL statement. Each MODEL statement identifies one or more \ncomponents of a mixture. For example, if components differ in their distributions, link \nfunctions, or regressor variables, then you can use separate MODEL statements to define \nthe components. If the finite mixture model is homogeneous—in the sense that all components \nshare the same regressors, distribution, and link function—then you can specify the mixture \nmodel with a single MODEL statement by using the K= option. \n\nAn intercept is included in each model by default. It can be removed with the NOINT option.\n\nThe dependent variable can be specified by using either the response syntax or the events/trials \nsyntax. The events/trials syntax is specific to models for binomial-type data. A binomial(n, π) \nvariable is the sum of n independent Bernoulli trials with event probability π. Each Bernoulli \ntrial results in either an event or a nonevent (with probability 1-π). The value of the second \nvariable, trials, gives the number n of Bernoulli trials. The value of the first variable, \nevents, is the number of events out of n. The values of both events and (trialsevents) must be \nnonnegative, and the value of trials must be positive. Other distributions that allow the \nevents/trials syntax are the beta-binomial distribution and the binomial cluster model. \n\nIf the events/trials syntax is used, the FMM procedure defaults to the binomial distribution. \nIf you use the response syntax, the procedure defaults to the normal distribution unless the \nresponse variable is a character variable or listed in the CLASS statement. \n\nThe FMM procedure supports a continuation-style syntax in MODEL statements. Since a mixture \nhas only one response variable, it is sufficient to specify the response variable in one MODEL \nstatement. Other MODEL statements can use the continuation symbol \"+\" before the specification \nof effects. For example, the following statements fit a three-component binomial mixture model: \n\n class A;\n model y/n = x / k=2;\n model     + A;\n\nThe first MODEL statement uses the \"=\" sign to separate response from effect information \nand specifies the response variable by using the events/trials syntax. This determines the \ndistribution as binomial. This MODEL statement adds two components to the mixture models with \ndifferent intercepts and regression slopes. The second MODEL statement adds another component \nto the mixture where the mean is a function of the classification main effect for variable A. \nThe response is also binomial; it is a continuation from the previous MODEL statement."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=number] \n          \nRequests that confidence intervals be constructed for each of the parameters with confidence \nlevel 1 - number. The value of number must be between 0 and 1; the default is 0.05."},"StatementOptionType":"V"},{"StatementOptionName":"CL","StatementOptionHelp":{"#cdata":"Requests that confidence limits be constructed for each of the parameter estimates. \nThe confidence level is 0.95 by default; this can be changed with the ALPHA= option."},"StatementOptionType":"S"},{"StatementOptionName":"DISTRIBUTION=|DIST=","StatementOptionHelp":{"#cdata":"Specifies the probability distribution for a mixture component. \n          \nIf you do not specify a distribution, the FMM procedure defaults to the normal distribution \nfor continuous response variables and to the binary distribution for classification or \ncharacter variables, unless the events/trial syntax is used in the MODEL statement. If \nyou choose the events/trial syntax, the FMM procedure defaults to the binomial distribution. \n\nFor several distributional specifications you can provide additional parameters to further \ndefine the distribution. These optional parameters are listed in the following: \n\n  DIST=CONSTANT<(c)> \n  The number c specifies the value where the mass is concentrated. The default is \n  DIST=CONSTANT(0), so that adding a MODEL statement with DIST=CONSTANT can be used to \n  add zero-inflation to any model. \n\n  DIST=T<(ν)> \n  The number ν specifies the degrees of freedom for the (shifted) t distribution. The default \n  is DIST=T(3), and this leads to a heavy-tailed distribution for which the variance is \n  defined. \n\n  DIST=UNIFORM<(a,b)> \n  The values a and b define the support of the uniform distribution, a < b. By default, \n  a = 0 and b = 1."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BETA","@Value2":"BETABINOMIAL","@Value3":"BINARY","@Value4":"BINOMIAL","@Value5":"BINOMCLUSTER","@Value6":"CONSTANT","@Value7":"EXPONENTIAL","@Value8":"FOLDEDNORMAL","@Value9":"GAMMA","@Value10":"GAUSSIAN","@Value11":"GENPOISSON","@Value12":"GEOMETRIC","@Value13":"INVGAUSS","@Value14":"LOGNORMAL","@Value15":"NEGBINOMIAL","@Value16":"POISSON","@Value17":"T","@Value18":"TRUNCPOISSON","@Value19":"UNIFORM","@Value20":"WEIBULL"},"StatementOptionToolTips":{"@ToolTip1":"Beta distribution","@ToolTip2":"Beta-binomial distribution","@ToolTip3":"Binary distribution","@ToolTip4":"Binomial distribution                                     If DIST=BINOMIAL is specified without the events/trials syntax, then n=1 is used  for the default number of trials.","@ToolTip5":"Binomial cluster distribution                                     The binomial cluster model is a two-component model described in Morel and Nagaraj (1993),  Morel and Neerchal (1997), and Neerchal and Morel (1998).","@ToolTip6":"Degenerate distribution","@ToolTip7":"Exponential distribution","@ToolTip8":"Folded normal distribution","@ToolTip9":"Gamma distribution","@ToolTip10":"Normal distribution","@ToolTip11":"Generalized Poisson distribution","@ToolTip12":"Geometric distribution","@ToolTip13":"Inverse Gaussian distribution","@ToolTip14":"Lognormal distribution","@ToolTip15":"Negative binomial distribution","@ToolTip16":"Poisson distribution","@ToolTip17":"Student t distribution","@ToolTip18":"Truncated Poisson distribution","@ToolTip19":"Uniform distribution","@ToolTip20":"Weibull distribution"}},{"StatementOptionName":"EQUATE=","StatementOptionHelp":{"#cdata":"Syntax: EQUATE=MEAN | SCALE | NONE \nEQUATE=EFFECTS(effect-list) \n          \nSpecifies simple sets of parameter constraints across the components in a MODEL statement; \nthe default is EQUATE=NONE. This option is available only for maximum likelihood estimation."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"MEAN","@Value2":"SCALE","@Value3":"NONE","@Value4":"EFFECTS(effect-list)"},"StatementOptionToolTips":{"@ToolTip1":"The parameters that determine the mean are reduced to a single set that is applicable  to all components in the MODEL statement.","@ToolTip2":"A single parameter represents the common scale for all components in the MODEL statement.","@ToolTip3":"Specifies no set of parameter constraints across the components in a MODEL statement;  the default is EQUATE=NONE","@ToolTip4":"Enables you to force the parameters for the chosen model effects to be equal across  components; however, the number of parameters is unaffected."}},{"StatementOptionName":"K=|NUMBER=","StatementOptionHelp":{"#cdata":"[Syntax: K=n | NUMBER=n] \n          \nSpecifies the number of components the MODEL statement contributes to the overall \nmixture. For the binomial cluster model, this option is not available, since this \nmodel is a two-component model by definition."},"StatementOptionType":"V"},{"StatementOptionName":"KMAX=","StatementOptionHelp":{"#cdata":"[Syntax: KMAX=n] \n          \nSpecifies the maximum number of components the MODEL statement contributes to the overall mixture. \n\nIf the maximum number of components in the mixture, as determined by all KMAX= options, is larger \nthan the minimum number of components, the FMM procedure fits all possible models and displays \nsummary fit information for the sequence of evaluated models. The \"best\" model according to the \nCRITERION= option in the PROC FMM statement is then chosen, and the remaining output and analyses \nperformed by PROC FMM pertain to this \"best\" model. \n\nThe KMAX= option is available only for maximum likelihood estimation. When you estimate the \nparameters of a mixture by MCMC methods, you need to ensure that the chain for a given value \nof k has converged; otherwise, comparisons among models with varying number of components might \nnot be meaningful."},"StatementOptionType":"V"},{"StatementOptionName":"KMIN=","StatementOptionHelp":{"#cdata":"[Syntax: KMIN=n] \n          \nSpecifies the minimum number of components the MODEL statement contributes to the overall \nmixture. This option is available only for maximum likelihood estimation. When you estimate \nthe parameters of a mixture by MCMC methods, you need to ensure that the chain for a given \nvalue of k has converged; otherwise comparisons among models with varying number of components \nmight not be meaningful."},"StatementOptionType":"V"},{"StatementOptionName":"LABEL=","StatementOptionHelp":{"#cdata":"[Syntax: LABEL=’label’] \n          \nSpecifies an optional label for the model that is used to identify the model in printed \noutput, on graphics, and in data sets created from ODS tables."},"StatementOptionType":"V"},{"StatementOptionName":"LINK=","StatementOptionHelp":{"#cdata":"Specifies the link function in the model."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"CLOGLOG","@Value2":"IDENTITY","@Value3":"LOG","@Value4":"LOGIT","@Value5":"LOGLOG","@Value6":"PROBIT","@Value7":"POWER(λ)","@Value8":"POWERMINUS2","@Value9":"RECIPROCAL"},"StatementOptionToolTips":{"@ToolTip1":"Complementary log-log function","@ToolTip2":"Identity function","@ToolTip3":"Log function","@ToolTip4":"Logit function","@ToolTip5":"Log-log function","@ToolTip6":"Probit function","@ToolTip7":"Power with λ=number function","@ToolTip8":"Power with exponent -2 function","@ToolTip9":"Reciprocal function"}},{"StatementOptionName":"NOINT","StatementOptionHelp":{"#cdata":"Requests that no intercept be included in the model. An intercept is included by \ndefault, unless the distribution is DIST=CONSTANT or DIST=UNIFORM."},"StatementOptionType":"S"},{"StatementOptionName":"OFFSET=","StatementOptionHelp":{"#cdata":"[Syntax: OFFSET=variable] \n          \nSpecifies the offset variable function for the linear predictor in the model. An offset \nvariable can be thought of as a regressor variable whose regression coefficient is known \nto be 1. For example, you can use an offset in a Poisson model when counts have been \nobtained in time intervals of different lengths. With a log link function, you can model \nthe counts as Poisson variables with the logarithm of the time interval as the offset \nvariable."},"StatementOptionType":"V"},{"StatementOptionName":"PARAMETERS|PARMS","StatementOptionHelp":{"#cdata":"Syntax: PARAMETERS(parameter-specification) \nPARMS(parameter-specification)\n          \nSpecifies starting values for the model parameters. If no PARMS option is given, the FMM \nprocedure determines starting values by a data-dependent algorithm. To determine initial \nvalues for the Markov chain with Bayes estimation, see also the INITIAL= option in the \nBAYES statement. The specification of the parameters takes the following form: parameters \nin the mean function precede the scale parameters, and parameters for different components \nare separated by commas. \n\nThe following statements specify starting parameters for a two-component normal model. \nThe initial values for the intercepts are 1 and -3; the initial values for the variances \nare 0.5 and 4. \n\n  proc fmm;\n     model y = / k=2 parms(1 0.5, -3 4);\n  run;\n\nYou can specify missing values for parameters whose starting values are to be determined \nby the default method. Only values for parameters that participate in the optimization \nare specified. The values for model effects are specified on the linear (linked) scale."},"StatementOptionType":"S"}]}},{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nYou can specify a BY statement with PROC FMM to obtain separate analyses on observations \nin groups that are defined by the BY variables. When a BY statement appears, the procedure \nexpects the input data set to be sorted in order of the BY variables. If you specify more \nthan one BY statement, only the last one specified is used."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"The NOTSORTED option does not mean that the data are unsorted but rather that the data \nare arranged in groups (according to values of the BY variables) and that these groups \nare not necessarily in alphabetical or increasing numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"WEIGHT","StatementHelp":{"#cdata":"Syntax: WEIGHT variable;\n      \nThe WEIGHT statement is used to perform a weighted analysis. Consult the section \nLog-Likelihood Functions for Response Distributions for expressions on how weight \nvariables are included in the log-likelihood functions. Because the probability \nstructure of a mixture model is different from that of a classical statistical \nmodel, the presence of a weight variable in a mixture model cannot be interpreted \nas altering the variance of an observation. \n\nObservations with nonpositive or missing weights are not included in the PROC FMM \nanalysis. If a WEIGHT statement is not included, all observations used in the analysis \nare assigned a weight of 1."},"StatementOptions":null},{"StatementName":"FREQ","StatementHelp":{"#cdata":"Syntax: FREQ variable ; \n      \nThe variable in the FREQ statement identifies a numeric variable in the data set that \ncontains the frequency of occurrence for each observation. PROC FMM treats each observation \nas if it appears f times, where f is the value of the FREQ variable for the observation. \nIf it is not an integer, the frequency value is truncated to an integer. If the frequency \nvalue is less than 1 or missing, the observation is not used in the analysis. When the \nFREQ statement is not specified, each observation is assigned a frequency of 1."},"StatementOptions":null},{"StatementName":"ID","StatementHelp":{"#cdata":"Syntax: ID variables ;\n      \nThe ID statement specifies a list of variables that are included in the OUT= data \nset of the OUTPUT statement. If no ID statement is specified, all variables from \nthe input data set are copied into the output data set."},"StatementOptions":null},{"StatementName":"CLASS","StatementHelp":{"#cdata":"Syntax: CLASS variables </ TRUNCATE> ;\n      \nThe CLASS statement names the classification variables to be used in the model. \nTypical classification variables are Treatment, Sex, Race, Group, and Replication. \nIf you use the CLASS statement, it must appear before the MODEL statement. \n\nClassification variables can be either character or numeric. By default, class \nlevels are determined from the entire set of formatted values of the CLASS variables. \n\nNote: Prior to SAS 9, class levels were determined by using no more than the first \n16 characters of the formatted values. To revert to this previous behavior, you can \nuse the TRUNCATE option in the CLASS statement."},"StatementOptions":{"StatementOption":{"StatementOptionName":"TRUNCATE","StatementOptionHelp":{"#cdata":"Specifies that class levels should be determined by using only up to the first 16 \ncharacters of the formatted values of CLASS variables. When formatted values are \nlonger than 16 characters, you can use this option to revert to the levels as \ndetermined in releases prior to SAS 9."},"StatementOptionType":"S"}}},{"StatementName":"PERFORMANCE","StatementHelp":{"#cdata":"Syntax: PERFORMANCE <performance-options> ; \n\nThe PERFORMANCE statement enables you to control the performance characteristics \nof the FMM procedure (for example, the number of CPUs, the number of threads for \nmultithreading, and so on). By default, the FMM procedure performs many analyses \nin multiple threads, and the number of threads equals the number of CPUs. Certain \nsystem and configuration options also can control the number of CPUs available to \na SAS session or whether multithreaded computations are permissible. For example, \nyou can set the number of available processors to two with \n\n  options cpucount=2;\n\nThe FMM procedure then acts as though two processors were available, regardless \nof the number of physically available processors."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"CPUCOUNT=","StatementOptionHelp":{"#cdata":"[Syntax: CPUCOUNT=n | ACTUAL]\n          \nSpecifies the number of processors available to the FMM procedure."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<n>","@Value2":"ACTUAL"},"StatementOptionToolTips":{"@ToolTip1":"Replace n with a number between 1 and 1024.","@ToolTip2":"Sets the number of available processors equal to the number of physical processors."}},{"StatementOptionName":"DETAILS","StatementOptionHelp":{"#cdata":"Requests a table with timing detail for the tasks performed by the FMM procedure."},"StatementOptionType":"S"},{"StatementOptionName":"NOTHREADS","StatementOptionHelp":{"#cdata":"Disables multithreaded computations."},"StatementOptionType":"S"},{"StatementOptionName":"THREADS=","StatementOptionHelp":{"#cdata":"[Syntax: THREADS= YES | NO]\n          \nEnables or disables multithreaded processing. The number of threads used by the \nFMM procedure is displayed in the \"Bayes Information\" or \"Optimization Information\" \ntable. It typically equals the number of available CPUs, which can be different from \nthe number of physical CPUs, and can be modified with the global CPUCOUNT SAS option \nor with the CPUCOUNT= option in the PERFORMANCE statement."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"YES","@Value2":"NO"},"StatementOptionToolTips":{"@ToolTip1":"Enables multithreaded processing.","@ToolTip2":"Disables multithreaded processing."}}]}},{"StatementName":"PROBMODEL","StatementHelp":{"#cdata":"Syntax: PROBMODEL <effects> < / probmodel-options> ; \n\nThe PROBMODEL statement defines the model effects for the mixing probabilities and \ntheir link function. By default, the FMM procedure models mixing probabilities on \nthe logit scale for two-component models and as generalized logit models in situations \nwith more than two components. The PROBMODEL statement is not required, and it is not \nsupported with Bayesian estimation."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=number] \n          \nRequests that confidence intervals be constructed for the parameters in the probability \nmodel with confidence level 1 - number. The value of number must be between 0 and 1; the \ndefault is 0.05. If the probability model is simple—that is, it does not contain any \neffects, the confidence intervals are produced for the estimated parameters (on the \nlogit scale) as well as for the mixing probabilities."},"StatementOptionType":"S"},{"StatementOptionName":"CL","StatementOptionHelp":{"#cdata":"Requests that confidence limits be constructed for each of the parameter estimates. \nThe confidence level is 0.95 by default; this can be changed with the ALPHA= option."},"StatementOptionType":"S"},{"StatementOptionName":"LINK=","StatementOptionHelp":{"#cdata":"[Syntax: LINK=keyword] \n          \nSpecifies the link function in the model for the mixing probabilities. The default \nis a logit link for models with two components. For models with more than two \ncomponents, only the generalized logit link is available."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"CLOGLOG|CLL","@Value2":"LOGIT","@Value3":"LOGLOG","@Value4":"PROBIT|NORMIT"},"StatementOptionToolTips":{"@ToolTip1":"Complementary log-log link function","@ToolTip2":"Logit link function","@ToolTip3":"Log-log link function","@ToolTip4":"Probit link function"}},{"StatementOptionName":"NOINT","StatementOptionHelp":{"#cdata":"Requests that no intercept be included in the model for the mixing probabilities. \nAn intercept is included by default. If you suppress the intercept with the NOINT \noption, you must specify at least one other effect for the mixing probabilities--\nsince an empty probability model is not meaningful."},"StatementOptionType":"S"},{"StatementOptionName":"PARAMETERS|PARMS","StatementOptionHelp":{"#cdata":"[Syntax: PARAMETERS(parameter-specification) | PARMS(parameter-specification)] \n          \nSpecifies starting values for the parameters. The specification of the parameters \ntakes the following form: parameters in the mean function appear in a list, and \nparameters for different components are separated by commas. Starting values are \ngiven on the linked scale, not in terms of probabilities. Also, you need to specify \nstarting values for only up to the first k-1 components in a k-component model. \nThe linear predictor for the last component is always assumed to be zero."},"StatementOptionType":"S"}]}},{"StatementName":"RESTRICT","StatementHelp":{"#cdata":"Syntax: RESTRICT <’label’> constraint-specification <, ..., constraint-specification>\n  <operator <value>> </ option> ; \n\nThe RESTRICT statement enables you to specify linear equality or inequality constraints \namong the parameters of a mixture model. These restrictions are incorporated into the \nmaximum likelihood analysis. The RESTRICT statement is not available for a Bayesian \nanalysis with the FMM procedure. \n\nFollowing are reasons why you might want to place constraints and restrictions on the \nmodel parameters: \n\n  o to fix a parameter at a particular value \n  o to equate parameters in different components in a mixture \n  o to impose order conditions on the parameters in a model \n  o to specify contrasts among the parameters that the fitted model should honor \n\nA restriction is composed of a left-hand side and a right-hand side, separated by an \noperator. If the operator and right-hand side are not specified, the restriction is \nassumed to be an equality constraint against zero. If the right-hand side is not \nspecified, the value is assumed to be zero. \n\nAn individual constraint-specification is written in (nearly) the same form as estimable \nlinear functions are specified in the ESTIMATE statement of the GLM, MIXED, or GLIMMIX \nprocedure. The constraint-specification takes the form \n\n  model-effect value-list < ...model-effect value-list > < (SCALE = value)> \n  \nAt least one model-effect must be specified followed by one or more values in the \nvalue-list. The values in the list correspond to the multipliers of the corresponding \nparameter that is associated with the position in the model effect. If you specify more \nvalues in the value-list than the model-effect occupies in the model design matrix, the \nextra coefficients are ignored."},"StatementOptions":{"StatementOption":{"StatementOptionName":"DIVISOR=","StatementOptionHelp":{"#cdata":"[Syntax: DIVISOR=value] \n          \nSpecifies a value by which all coefficients on the right-hand side and left-hand \nside of the restriction are divided."},"StatementOptionType":"V"}}},{"StatementName":"OUTPUT","StatementHelp":{"#cdata":"Syntax: OUTPUT <OUT=SAS-data-set>\n  <keyword<(keyword-options)> <=name>>...\n  <keyword<(keyword-options)> <=name>> < / options> ; \n\nThe OUTPUT statement creates a data set that contains observationwise statistics that \nare computed after fitting the model. By default, all variables in the original data \nset are included in the output data set. You can use the ID statement to limit the \nvariables copied from the input data set to the output data set. \n\nThe output statistics are computed based on the parameter estimates of the converged \nmodel if the parameters are estimated by maximum likelihood. If a Bayesian analysis is \nperformed, the output statistics are computed based on the arithmetic mean in the \nposterior sample. You can change to the maximum posterior estimate with the ESTIMATE=MAP \noption in the BAYES statement."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"OUT=|DATA=","StatementOptionHelp":{"#cdata":"[Syntax: OUT=SAS-data-set | DATA=SAS-data-set] \n          \nSpecifies the name of the output data set. If the OUT= (or DATA=) option is omitted, \nthe procedure uses the DATAn convention to name the output data set."},"StatementOptionType":"RV"},{"StatementOptionName":"PREDICTED|PRED|MEAN","StatementOptionHelp":{"#cdata":"Syntax: PREDICTED<(COMPONENT|OVERALL)> \nPRED<(COMPONENT|OVERALL)> \nMEAN<(COMPONENT|OVERALL)> \n       \nRequests predicted values (predicted means) for the response variable. The predictions \nin the output data set are mapped onto the data scale. For example, if the response is \nbinomial or binary, the predictions are probabilities. The default is to compute the \npredicted value for the mixture (OVERALL). You can request predictions for the means \nof the component distributions by adding the COMPONENT suboption in parentheses."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"RESIDUAL|RESID","StatementOptionHelp":{"#cdata":"Syntax: RESIDUAL<(COMPONENT|OVERALL)> \nRESID<(COMPONENT|OVERALL)> \n \nRequests residuals for the response or residuals in the component distributions. \nOnly \"raw\" residuals on the data scale are computed (observed minus predicted)."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"VARIANCE|VAR","StatementOptionHelp":{"#cdata":"Syntax: VARIANCE<(COMPONENT|OVERALL)> \nVAR<(COMPONENT|OVERALL)>  \n          \nRequests variances for the mixture or the component distributions."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"LOGLIKE|LOGL","StatementOptionHelp":{"#cdata":"Syntax: LOGLIKE<(COMPONENT|OVERALL)> \nLOGL<(COMPONENT|OVERALL)> \n\nRequests values of the log-likelihood function for the mixture or the components. \nFor observations used in the analysis, the overall computed value is the observations’ \ncontribution to the log likelihood; if a FREQ statement is present, the frequency is \naccounted for in the computed value. In other words, if all observations in the input \ndata set have been used in the analysis, adding the value of the log-likelihood \ncontributions in the OUTPUT data set produces the negative of the final objective \nfunction value in the \"Iteration History\" table. By default, the log-likelihood \ncontribution to the mixture is computed. You can request the individual mixture \ncomponent contributions with the COMPONENT suboption."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"MIXPROBS|MIXPROB|PRIOR|MIXWEIGHTS","StatementOptionHelp":{"#cdata":"Syntax: MIXPROBS<(COMPONENT|MAX)> \nMIXPROB<(COMPONENT|MAX)> \nPRIOR<(COMPONENT|MAX)> \nMIXWEIGHTS<(COMPONENT|MAX)> \n\nRequests that the prior weights πᵢ(Z,αᵢ) be added to the OUTPUT data set. By default, \nthe probabilities are output for all components. You can limit the output to a \nsingle statistic, the largest mixing probability, with the MAX suboption. \n\nNote: The keyword \"prior\" is used here because of long-standing practice to refer \nto the mixing probabilities as prior weights. This must not be confused with the \nprior distribution and its parameters in a Bayesian analysis."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"POSTERIOR|POST|PROB","StatementOptionHelp":{"#cdata":"Syntax: POSTERIOR<(COMPONENT|MAX)> \nPOST<(COMPONENT|MAX)> \nPROB<(COMPONENT|MAX)> \n\nRequests that the posterior weights be added to the OUTPUT data set. By default, \nthe probabilities are output for all components. You can limit the output to a \nsingle statistic, the largest posterior probability, with the MAX suboption. \n\nNote: The keyword \"posterior\" is used here because of long-standing practice to \nrefer to these probabilities as posterior probabilities. This must not be confused \nwith the posterior distribution in a Bayesian analysis."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"LINP|XBETA","StatementOptionHelp":{"#cdata":"Syntax: LINP | XBETA \n          \nRequests that the linear predictors for the models be added to the OUTPUT data set."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"CLASS|CATEGORY|GROUP","StatementOptionHelp":{"#cdata":"Syntax: CLASS|CATEGORY|GROUP \n          \nAdds the estimated component membership to the OUTPUT data set. An observation \nis associated with the component that has the highest posterior probability."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"MAXPOST|MAXPROB","StatementOptionHelp":{"#cdata":"Syntax: MAXPOST|MAXPROB \n          \nAdds the highest posterior probability to the OUTPUT data set."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"ALLSTATS","StatementOptionHelp":{"#cdata":"Requests that all statistics are computed. If you do not use a keyword to assign \na name, the FMM procedure uses the default name."},"StatementOptionType":"S"},{"StatementOptionName":"NOVAR","StatementOptionHelp":{"#cdata":"Requests that variables from the input data set not be added to the output data \nset. This option does not apply to variables listed in the BY statement or to \nvariables listed in the ID statement."},"StatementOptionType":"S"}]}}]}}}