{"Procedure":{"Name":"FONTREG","ProductGroup":"BASE","ProcedureHelp":{"#cdata":"Syntax: PROC FONTREG <option(s)>;  FONTFILE 'file' <...'file'> || 'file-1, pfm-file-1, afm-file-1' <...'file-n'>;  \n      FONTPATH 'directory' <...'directory'>;  \n      REMOVE 'family-name' | 'alias' | family-type | _ALL_;  \n      TRUETYPE 'directory' <...'directory'>;  \n      TYPE1 'directory' <...'directory'>;\n      OPENTYPE <fileref> 'directory' <…'directory'>;\n      \nThe FONTREG procedure enables you to update the SAS registry to include system fonts, \nwhich can then be used in SAS output. PROC FONTREG uses FreeType font-rendering to \nrecognize and incorporate various types of font definitions. Fonts of any type that \ncan be incorporated and used by SAS are known collectively in this documentation as \nfonts in the FreeType library.\n\nNote: Including a system font in the SAS registry means that SAS knows where to find \nthe font file. The font file is not actually used until the font is called for in a SAS \nprogram. Therefore, do not move or delete font files after you have included the fonts \nin the SAS registry."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"MODE=","ProcedureOptionHelp":{"#cdata":"Specifies how to handle new and existing fonts in the SAS registry."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"ADD","@Value2":"ALL","@Value3":"REPLACE"},"ProcedureOptionToolTips":{"@ToolTip1":"Add fonts that do not already exist in the SAS registry. Do not modify existing fonts.","@ToolTip2":"Add new fonts that do not already exist in the SAS registry and replace fonts that already  exist in the SAS registry.","@ToolTip3":"Replace fonts that already exist in the SAS registry. Do not add new fonts."}},{"ProcedureOptionName":"MSGLEVEL=","ProcedureOptionHelp":{"#cdata":"Specifies the level of detail to include in the SAS log."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"VERBOSE","@Value2":"NORMAL","@Value3":"TERSE","@Value4":"NONE"},"ProcedureOptionToolTips":{"@ToolTip1":"SAS log messages include which fonts were added, which fonts were not added, and which  fonts were not understood, as well as a summary that indicates the number of fonts  that were added, not added, and not understood.","@ToolTip2":"SAS log messages include which fonts were added, and a summary that indicates the number  of fonts that were added, not added, and not understood.","@ToolTip3":"SAS log messages include only the summary that indicates the number of fonts that were  added, not added, and not understood.","@ToolTip4":"No messages are written to the SAS log, except for errors (if encountered)."}},{"ProcedureOptionName":"NOUPDATE","ProcedureOptionHelp":{"#cdata":"Specifies that the procedure should run without actually updating the SAS registry. \nThis option enables you to test the procedure on the specified fonts before \nmodifying the SAS registry."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"USESASHELP","ProcedureOptionHelp":{"#cdata":"Specifies that the SAS registry in the SASHELP library should be updated."},"ProcedureOptionType":"S"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"FONTFILE","StatementHelp":{"#cdata":"Syntax: FONTFILE 'file' <...'file'> || 'file-1, pfm-file-1, afm-file-1' <...'file-n'>;\n      \nSpecifies one or more font files to be processed."},"StatementOptions":null},{"StatementName":"FONTPATH","StatementHelp":{"#cdata":"Syntax: FONTPATH 'directory' <...'directory'>;\n      \nSpecifies one or more directories to be searched for valid font files to process."},"StatementOptions":null},{"StatementName":"REMOVE","StatementHelp":{"#cdata":"Syntax: REMOVE 'family-name' | 'alias' | family-type | _ALL_;"},"StatementOptions":{"StatementOption":{"StatementOptionName":"_ALL_","StatementOptionHelp":{"#cdata":"Specifies that all font families in the Core\\Printing\\Freetype\\Fonts key in the \nSAS registry will be deleted."},"StatementOptionType":"S"}}},{"StatementName":"TRUETYPE","StatementHelp":{"#cdata":"Syntax: TRUETYPE 'directory' <...'directory'>;\n      \nSpecifies one or more directories to be searched for TrueType font files."},"StatementOptions":null},{"StatementName":"TYPE1","StatementHelp":{"#cdata":"Syntax: TYPE1 'directory' <...'directory'>;\n      \nSpecifies one or more directories to be searched for valid Type1 font files."},"StatementOptions":null},{"StatementName":"OPENTYPE","StatementHelp":{"#cdata":"Syntax: OPENTYPE <fileref> 'directory' <…'directory'>;\n      \nSpecifies one or more directories to be searched for valid OpenType font files. \n\nRequired Argument:\ndirectory\n  specifies a directory to search. Only files that are recognized as valid OpenType font files \n  are processed. Each directory must be enclosed in quotation marks. If you specify more than one \n  directory, then you must separate the directories with a space.\n  \nOptional Argument:\nfileref\n  specifies a fileref to use with the OPENTYPE statement."},"StatementOptions":null}],"#comment":{}}}}