{"Procedure":{"Name":"FSLETTER","ProductGroup":"SAS/FSP","ProcedureHelp":{"#cdata":"Syntax: PROC FSLETTER LETTER=SAS-catalog<.catalog-entry>  <DATA=data-set>  \n    <NOBORDER>  \n    <PRINTFILE=fileref | 'actual-filename'>;   \n    WHERE expression;  \n    \nThe FSLETTER procedure enables you to create, edit, and print letters and other documents. \nWhen creating and editing documents in the FSLETTER window, you can use all the features of \nthe SAS text editor, including the spelling checker.\n\nYour FSLETTER documents can include named fields. When the document is printed, you can fill \nin these fields manually, or the procedure can fill the fields automatically using values from \na SAS data set. This is convenient for creating and maintaining form letters, for example. You \ncan print individual copies of the document, or you can automatically print a copy for every \nobservation in a data set.\n\nYou can enter the FSLETTER procedure from the FSBROWSE and FSEDIT procedures. \n\nNote: You can also open the FSLETTER window by issuing an FSLETTER command from any \nSAS System command line."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=data-set <(data-set-options)>] \n      \nNames an existing SAS data set that will be used to fill fields in the document. The \nFSLETTER procedure terminates with an error message if the specified data set does not \nexist. \n\nNote: This option is valid only if you also specify the name of an existing LETTER \nentry in the LETTER= argument.  \n\nWhen you use this option, the procedure does not initiate an interactive FSLETTER session. \nA pause occurs while a copy of the document is printed for each observation in the data set; \nthen the procedure ends.\n\nYou can follow the data set name with a list of data set options enclosed in parentheses. \nThe following data set options are valid with the DATA= option: \n\n  DROP RENAME KEEP WHERE"},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"NOBORDER","ProcedureOptionHelp":{"#cdata":"Suppresses the sides and bottom of the FSLETTER window's border in a character-based display \nenvironment.\n\nNote: This option is ignored in graphical windowing environments.  \n\nWhen this option is used in a supported display environment, text can appear in the columns \nand row that the border normally occupies."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"PRINTFILE=|PRTFILE=|PRINT=|DDNAME=|DD=","ProcedureOptionHelp":{"#cdata":"[Syntax: PRINTFILE=|PRTFILE=|PRINT=|DDNAME= fileref |'actual-filename' ] \n      \nSpecifies the fileref or the actual name of an external file to which procedure output \nis directed. By default, procedure output is sent to the destination that is specified \nin the associated FORM entry. When this option is used, output is sent to the specified \nfile instead.\n\nIf you use a fileref, you must have previously assigned the fileref to an external file \nwith the FILENAME statement. If you use an actual filename, enclose it in quotes."},"ProcedureOptionType":"V"}]},"ProcedureStatements":{"ProcedureStatement":{"StatementName":"WHERE","StatementHelp":{"#cdata":"Syntax: WHERE expression; \n      \nwhere expression is any valid WHERE expression that includes one or more of the variables \nin the input data set. \n      \nSpecifies a condition or set of conditions that observations in an input data set must meet \nin order to be used for filling variable fields. \n\nBy default, when you use the DATA= option in the PROC FSLETTER statement, the FSLETTER \nprocedure generates a copy of the document for every observation in the data set. If you \ndo not need a copy for every observation, you can use the WHERE statement to generate copies \nfor only observations that meet a specified condition or list of conditions.\n\nFor example, to print form letters for only observations in which the value of the variable \nYEAR is less than 5, follow the PROC FSLETTER statement with this statement: \n\n  where year<5;\n\nIn this case, the FSLETTER procedure uses only observations that meet the specified condition. \nNo documents are printed for observations that do not satisfy the condition."},"StatementOptions":null}}}}