{"Procedure":{"Name":"GAMMOD","ProductGroup":"CAS|VIYA|VISUAL STATISTICAL PROCEDURES","ProcedureHelp":{"#cdata":"Syntax: PROC GAMMOD <options>; \n    BY variables; \n    CLASS variable <(options)>\n      <variable <(options)>> </ global-options>; \n    DISPLAY <table-list> </ options>; \n    DISPLAYOUT table-spec-list </ options>; \n    FREQ variable; \n    MODEL response <(response-options)> = <PARAM(effects)> <spline-effects> </ model-options>; \n    MODEL events / trials = <PARAM(effects)> <spline-effects> </ model-options>; \n    OUTPUT OUT=CAS-libref.data-table <keyword <=name>>…<keyword <=name>> </ options>; \n    WEIGHT variable; \n    \nThe GAMMOD procedure fits generalized additive models that are based on low-rank regression splines \n(Wood 2006) in SAS Viya. \n\nGeneralized additive models are extensions of generalized linear models. They relax the generalized \nlinear models’ assumption of linearity by allowing spline terms that characterize nonlinear dependency \nstructures. Each spline term is constructed by the thin-plate regression spline technique (Wood 2003). \nA roughness penalty is applied to each spline term by a smoothing parameter that controls the balance \nbetween goodness of fit and the roughness of the spline curve. PROC GAMMOD fits models for standard \ndistributions in the exponential family, such as the normal, Poisson, gamma and Tweedie distributions."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"ALPHA=","ProcedureOptionHelp":{"#cdata":"Syntax: ALPHA=number\n      \nSpecifies a global significance level for the hypothesis testing of smoothing components and the construction \nof Bayesian confidence bands of predictions. The confidence level is 1 – number. The value of number must be \nbetween 0 and 1; the default is 0.05. You can override this global significance level for Bayesian confidence \nbands of predictions by specifying the ALPHA= option in the OUTPUT statement."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"Syntax: DATA=CAS-libref.data-table \n      \nNames the input data table for PROC GAMMOD to use. The default is the most recently created data table. \nCAS-libref.data-table is a two-level name, where \n\nCAS-libref\n  refers to a collection of information that is defined in the LIBNAME statement and includes the caslib, \n  which includes a path to the data, and a session identifier, which defaults to the active session but \n  which can be explicitly defined in the LIBNAME statement.\n  \ndata-table\n  specifies the name of the input data table."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"ITDETAILS","ProcedureOptionHelp":{"#cdata":"Adds to the \"Iteration History\" table the current values of the parameter estimates and their gradients. \nIf the optimization algorithm is used to determine at least one smoothing parameter, the table lists \nvalues for smoothing parameters. If all smoothing parameters are fixed or a parametric generalized \nlinear model is specified, the table lists values for regression parameters. These quantities are \nreported only for parameters that participate in the optimization."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOCLPRINT","ProcedureOptionHelp":{"#cdata":"Syntax: NOCLPRINT<=number> \n      \nSuppresses the display of the \"Class Level Information\" table if you do not specify number. If you specify \nnumber, the values of the classification variables are displayed for only those variables whose number of \nlevels is less than number. Specifying a number helps reduce the size of the \"Class Level Information\" table \nif some classification variables have a large number of levels."},"ProcedureOptionType":"S|V"},{"ProcedureOptionName":"NOPRINT","ProcedureOptionHelp":{"#cdata":"Suppresses the generation of ODS output."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"PLIKEOPTIONS","ProcedureOptionHelp":{"#cdata":"Syntax: PLIKEOPTIONS(optimization-parameters)\n      \nSpecifies optimization parameters for either maximum or penalized likelihood estimation.\n\nYou can specify the following optimization-parameters:\n\nABSCONV= \n  Tunes the absolute function convergence criterion\nABSFCONV= \n  Tunes the absolute function difference convergence criterion\nABSGCONV= \n  Tunes the absolute gradient convergence criterion\nFCONV= \n  Tunes the relative function difference convergence criterion\nGCONV= \n  Tunes the relative gradient convergence criterion\nMAXFUNC= \n  Specifies the maximum number of function evaluations in any optimization\nMAXITER= \n  Chooses the maximum number of iterations in any optimization\nMAXTIME= \n  Specifies the upper limit of CPU time (in seconds) for any optimization\nMINITER= \n  Specifies the minimum number of iterations in any optimization\nTECHNIQUE= \n  Selects the optimization technique"},"ProcedureOptionType":"S","SubOptionsKeywords":"ABSCONV=|ABSFCONV=|ABSGCONV=|FCONV=|GCONV=|MAXFUNC=|MAXITER=|MAXTIME=|MINITER=|TECHNIQUE="},{"ProcedureOptionName":"PLOTS=","ProcedureOptionHelp":{"#cdata":"Syntax: PLOTS <(global-plot-option)> <= plot-requests <(option)>>\n      \nControls the plots that are produced through ODS Graphics.\n\nYou can specify the following global-plot-option, which applies to the smoothing component plots that \nthe GAMMOD procedure generates: \n\nUNPACK | UNPACKPANEL\nsuppresses paneling. By default, multiple smoothing component plots can appear in some output panels. \nSpecify UNPACK to get each plot individually. \n\nThe following listing describes the specific plots and their options.\n\n  ALL \n    requests that all default plots be produced.\n\n  COMPONENTS | COMPONENT <(components-option)> \n    plots a panel of smoothing components of the fitted model. You can specify the following component-option: \n    COMMONAXES \n     requests that the smoothing component plots use a common vertical axis except for bivariate contour plots. \n      This option enables you to visually judge the relative effect size.\n  NONE \n    suppresses all plots. "},"ProcedureOptionType":"S|V","ProcedureOptionValues":{"@Value1":"ALL","@Value2":"NONE","@Value3":"COMPONENTS"},"ProcedureOptionToolTips":{"@ToolTip1":"Requests that all default plots be produced.","@ToolTip2":"Suppresses all plots.","@ToolTip3":"Plots a panel of smoothing components of the fitted model.                                  Syntax: COMPONENTS<(component-option)>  You can specify the following component-option:         COMMONAXES          requests that the smoothing component plots use a common vertical axis except for bivariate contour plots.  This option enables you to visually judge the relative effect size."},"SubOptionsKeywords":"UNPACK|UNPACKPANEL"},{"ProcedureOptionName":"SEED=","ProcedureOptionHelp":{"#cdata":"Syntax: SEED=number\n      \nSpecifies an integer that is used to start the pseudorandom number generator for subset sampling from \nobservations to form knots if necessary and for truncated eigendecomposition. If you do not specify this \noption, or if number ≤ 0, the seed is generated from the time of day, which is read from the computer's \nclock."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SINGCHOL=","ProcedureOptionHelp":{"#cdata":"Syntax: SINGCHOL=number\n      \nTunes the singularity criterion in Cholesky decompositions. The default is 1E4 times the machine epsilon; \nthis product is approximately 1E–12 on most computers."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SINGULAR=","ProcedureOptionHelp":{"#cdata":"Syntax: SINGULAR=number \n      \nTunes the singularity criterion in truncated eigendecomposition to determine its convergence. \nThe default is 1E4 times the machine epsilon; this product is approximately 1E–12 on most computers."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SMOOTHOPTIONS","ProcedureOptionHelp":{"#cdata":"Syntax: SMOOTHOPTIONS(optimization-parameters)\n      \nSpecifies optimization parameters for smoothing parameter estimation.\n\nYou can specify the following optimization-parameters:\n\nABSCONV= \n  Tunes the absolute function convergence criterion\nABSFCONV= \n  Tunes the absolute function difference convergence criterion\nABSGCONV= \n  Tunes the absolute gradient convergence criterion\nFCONV= \n  Tunes the relative function difference convergence criterion\nGCONV= \n  Tunes the relative gradient convergence criterion\nMAXFUNC= \n  Specifies the maximum number of function evaluations in any optimization\nMAXITER= \n  Chooses the maximum number of iterations in any optimization\nMAXTIME= \n  Specifies the upper limit of CPU time (in seconds) for any optimization\nMINITER= \n  Specifies the minimum number of iterations in any optimization\nTECHNIQUE= \n  Selects the optimization technique"},"ProcedureOptionType":"V","SubOptionsKeywords":"ABSCONV=|ABSFCONV=|ABSGCONV=|FCONV=|GCONV=|MAXFUNC=|MAXITER=|MAXTIME=|MINITER=|TECHNIQUE="}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY variables;\n\nYou can specify a BY statement in PROC GAMMOD to obtain separate analyses of observations in groups \nthat are defined by the values of the BY variables. If you specify more than one BY statement, only \nthe last one specified is used."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"CLASS","StatementHelp":{"#cdata":"Syntax: CLASS variable <(options)>... <variable <(options)>> </ global-options>; \n      \nThe CLASS statement names the classification variables to be used as explanatory variables in the \nanalysis. The CLASS statement must precede the MODEL statement. You can list the response variable \nfor binary models in the CLASS statement, but this is not necessary."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING|DESC","StatementOptionHelp":{"#cdata":"Reverses the sorting order of the classification variable. If both the DESCENDING and ORDER= options \nare specified, high-performance statistical procedures order the categories according to the ORDER= \noption and then reverse that order."},"StatementOptionType":"S"},{"StatementOptionName":"MISSING","StatementOptionHelp":{"#cdata":"Treats missing values (\".\", \".A\", …, \".Z\" for numeric variables and blanks for character variables) \nas valid values for the CLASS variable.\n\nIf you do not specify the MISSING option, observations that have missing values for CLASS variables \nare removed from the analysis, even if the CLASS variables are not used in the model formulation."},"StatementOptionType":"S"},{"StatementOptionName":"ORDER=","StatementOptionHelp":{"#cdata":"Specifies the sort order for the levels of classification variables. This ordering determines which \nparameters in the model correspond to each level in the data.\n\nBy default, ORDER=FORMATTED."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FORMATTED","@Value2":"FREQ","@Value3":"INTERNAL"},"StatementOptionToolTips":{"@ToolTip1":"Levels sorted by their external formatted values, except for numeric variables that have no explicit  format, which are sorted by their unformatted (internal) value.","@ToolTip2":"Levels sorted by their descending frequency count (levels that have more observations come earlier in the order).","@ToolTip3":"Levels sorted by theeir unformatted value. The sort order is machine-dependent."}},{"StatementOptionName":"REFERENCE=|REF=","StatementOptionHelp":{"#cdata":"Syntax: REF='level' | keyword \nREFERENCE='level' | keyword \n\nSpecifies the reference level that is used when you specify PARAM= REFERENCE. For an individual (but not a global) \nvariable REF= option, you can specify the level of the variable to use as the reference level. Specify the formatted \nvalue of the variable if a format is assigned. For a REF= option or global-option, you can use one of the following \nkeywords. The default is REF=LAST."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"'<level>'","@Value2":"FIRST","@Value3":"LAST"},"StatementOptionToolTips":{"@ToolTip1":"The level of the variable to use as the reference level. Specify the formatted value of the variable  if a format is assigned. Replace <level> with an actual value.","@ToolTip2":"Designates the first ordered level as reference.","@ToolTip3":"Designates the last ordered level as reference."}},{"StatementOptionName":"PARAM=","StatementOptionHelp":{"#cdata":"Specifies the parameterization method for the classification variable or variables."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"EFFECT","@Value2":"GLM","@Value3":"ORDINAL|THERMOMETER","@Value4":"POLYNOMIAL|POLY","@Value5":"REFERENCE|REF","@Value6":"ORTHEFFECT","@Value7":"ORTHORDINAL|ORTHOTHERM","@Value8":"ORTHPOLY","@Value9":"ORTHREF"},"StatementOptionToolTips":{"@ToolTip1":"Specifies effect coding.","@ToolTip2":"Specifies less-than-full-rank, reference-cell coding; this option can be used  only as a global option.","@ToolTip3":"Specifies the cumulative parameterization for an ordinal CLASS variable.","@ToolTip4":"Specifies polynomial coding.","@ToolTip5":"Specifies reference-cell coding.","@ToolTip6":"Orthogonalizes PARAM=EFFECT coding.","@ToolTip7":"Orthogonalizes PARAM=ORDINAL coding.","@ToolTip8":"Orthogonalizes PARAM=POLYNOMIAL coding.","@ToolTip9":"Orthogonalizes PARAM=REFERENCE coding."}}]}},{"StatementName":"DISPLAY","StatementHelp":{"#cdata":"Syntax: DISPLAY <table-list> </ options>;\n      \nThe DISPLAY statement enables you to specify a list of display tables to display or exclude. This statement \nis similar to the ODS SELECT, ODS EXCLUDE, and ODS TRACE statements. However, the DISPLAY statement can improve \nperformance when a large number of tables could be generated (such as in BY-group processing). The procedure \nprocesses the DISPLAY statement on a CAS server and thus sends only a subset of ODS tables to the SAS client. \nBecause ODS statements are processed on a SAS client, all the display tables generated are first sent to the \nclient and then the client creates a subset. If both DISPLAY and ODS statements are used together, the DISPLAY \nstatement takes precedence over the ODS statements."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"CASESENSITIVE","StatementOptionHelp":{"#cdata":"Performs a case-sensitive comparison of table names in the table-list to display table names when \ntables are subsetted for display. To preserve case, you must enclose table names in the table-list \nin quotation marks."},"StatementOptionType":"S"},{"StatementOptionName":"EXCLUDE","StatementOptionHelp":{"#cdata":"Displays all display tables except those specified in the table-list."},"StatementOptionType":"S"},{"StatementOptionName":"EXCLUDEALL","StatementOptionHelp":{"#cdata":"Suppresses display of all tables. This option takes precedence over the other options."},"StatementOptionType":"S"},{"StatementOptionName":"TRACE","StatementOptionHelp":{"#cdata":"Displays the display table names, labels, and paths."},"StatementOptionType":"S"}]}},{"StatementName":"DISPLAYOUT","StatementHelp":{"#cdata":"Syntax: DISPLAYOUT table-spec-list < / options > ;\n      \nThe DISPLAYOUT statement enables you to create CAS output tables from your displayed output. This\nstatement is similar to the ODS OUTPUT statement.\n\nThe table-spec-list specifies a list of CAS output tables to create. Each entry in the list has either a key or a\nkey=value format:\n\n  key=value specifies key as the ODS table name, path, or partial pathname, and specifies value as the\n    CAS output table name.\n  key specifies key as the ODS table name and also as the CAS output table name.\n  \nTable names and partial pathnames are discussed under the DISPLAY statement. The DISPLAYOUT\nstatement does not support regular expressions."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"INCLUDEALL","StatementOptionHelp":{"#cdata":"Creates output CAS tables for all display tables. The name of the created output CAS table is the \nsame as the corresponding display table name. If you specify this option, the table-spec-list specification \nis ignored."},"StatementOptionType":"S"},{"StatementOptionName":"NOREPLACE","StatementOptionHelp":{"#cdata":"Does not replace an existing CAS output table of the same name."},"StatementOptionType":"S"},{"StatementOptionName":"REPEATED","StatementOptionHelp":{"#cdata":"Replicates the CAS output tables on all nodes."},"StatementOptionType":"S"}]}},{"StatementName":"FREQ","StatementHelp":{"#cdata":"Syntax: FREQ variable;\n      \nThe variable in the FREQ statement identifies a numeric variable in the data set that contains the \nfrequency of occurrence of each observation. PROC GAMMOD treats each observation as if it appeared \nf times, where the frequency value f is the value of the FREQ variable for the observation. If f \nis not an integer, then f is truncated to an integer. If f is less than 1 or missing, the observation \nis not used in the analysis. When you do not specify the FREQ statement, each observation is assigned \na frequency of 1."},"StatementOptions":null},{"StatementName":"MODEL","StatementHelp":{"#cdata":"Syntax: MODEL response <(response-options)> = <PARAM(effects)> <spline-effects> </ model-options>;\nMODEL events / trials = <PARAM(effects)> <spline-effects> </ model-options>;\n\nThe MODEL statement specifies the response (dependent or target) variable and the predictor (independent \nor explanatory) effects of the model. You can specify the response in the form of a single variable or in \nthe form of a ratio of two variables, which are denoted events/trials. The first form applies to all \ndistribution families; the second form applies only to summarized binomial response data. When you have \nbinomial data, the events variable contains the number of positive responses (or events) and the trials \nvariable contains the number of trials. The values of both events and (trials – events) must be nonnegative,\nand the value of trials must be positive. If you specify a single response variable that is in a CLASS \nstatement, then the response is assumed to be binary.\n\nYou can specify parametric effects that are constructed from variables in the input data set and include \nthe effects in the parentheses of a PARAM( ) option, which can appear multiple times. \n\nYou can specify spline-effects by including independent variables inside the parentheses of the SPLINE() \noption. Only continuous variables (not classification variables) can be specified in spline-effects. Each \nspline-effect can have at least one variable and optionally some spline-options . You can specify any number \nof spline-effects."},"StatementOptions":{"#comment":[{},{},{}],"StatementOption":[{"StatementOptionName":"DESCENDING|DESC","StatementOptionHelp":{"#cdata":"Reverses the order of the response categories. If you specify both the DESCENDING and ORDER= options, \nPROC GAMPL orders the response categories according to the ORDER= option and then reverses that order."},"StatementOptionType":"RS"},{"StatementOptionName":"EVENT=","StatementOptionHelp":{"#cdata":"Syntax: EVENT='category'|keyword\n          \nSpecifies the event category for the binary response model. PROC GAMPL models the probability of the\nevent category. The EVENT= option has no effect when there are more than two response categories."},"StatementOptionType":"RV","StatementOptionValues":{"@Value1":"'<category>'","@Value2":"FIRST","@Value3":"LAST"},"StatementOptionToolTips":{"@ToolTip1":"Event category for the binary response model","@ToolTip2":"Designates the first ordered category as the event.","@ToolTip3":"Designates the last ordered category as the event."}},{"StatementOptionName":"ORDER=","StatementOptionHelp":{"#cdata":"Specifies the sort order for the levels of the response variable."},"StatementOptionType":"RV","StatementOptionValues":{"@Value1":"FORMATTED","@Value2":"FREQ","@Value3":"INTERNAL"},"StatementOptionToolTips":{"@ToolTip1":"Sorts the levels by external formatted value.","@ToolTip2":"Sorts the levels by descending frequency count (levels that have the most observations come first  in the order).","@ToolTip3":"Sorts the levels by unformatted value. The sort order is machine-dependent."}},{"StatementOptionName":"REF=","StatementOptionHelp":{"#cdata":"Syntax: REF='category' | FIRST | LAST \n\nSpecifies the reference category for the binary response model. Specifying one response category \nas the reference is the same as specifying the other response category as the event category.\n\nBy default, REF=LAST."},"StatementOptionType":"RV","StatementOptionValues":{"@Value1":"'<category>'","@Value2":"FIRST","@Value3":"LAST"},"StatementOptionToolTips":{"@ToolTip1":"Specifies that observations whose value matches category (formatted, if a format is applied) are  designated as the reference. Replace <category> with an actual value.","@ToolTip2":"Designates the first ordered category as reference.","@ToolTip3":"Designates the last ordered category as reference."}},{"StatementOptionName":"DETAILS","StatementOptionHelp":{"#cdata":"Requests a detailed spline specification information table."},"StatementOptionType":"RS"},{"StatementOptionName":"DF=","StatementOptionHelp":{"#cdata":"Syntax: DF=number\n          \nSpecifies a fixed degrees of freedom. When you specify this option, no smoothing parameter selection \nis performed on the spline term. If number is not an integer, then number is truncated to an integer."},"StatementOptionType":"RV"},{"StatementOptionName":"INITSMOOTH=","StatementOptionHelp":{"#cdata":"Syntax: INITSMOOTH=number\n          \nspecifies the starting value for a smoothing parameter. The number must be nonnegative."},"StatementOptionType":"RV"},{"StatementOptionName":"KNOTS=","StatementOptionHelp":{"#cdata":"Syntax: KNOTS=method\n          \nSpecifies the method for supplying user-defined knot values instead of using data values for constructing \nbasis expansions."},"StatementOptionType":"RV","StatementOptionValues":{"@Value1":"LIST","@Value2":"EQUAL"},"StatementOptionToolTips":{"@ToolTip1":"Syntax: LIST(list-of-values)                                     Specifies a list of values as knots for the spline construction. For a multivariate spline term,  the listed values are taken as multiple row vectors, where each vector has values that are ordered  by specified variables. If the last row vector of knots contains fewer values than the number of  variables, then the last row vector is ignored.","@ToolTip2":"Syntax: EQUAL(n)  Specifies the number of equally spaced interior knots for every variable in a spline term. Two boundary  knots are automatically added to the knot list for each variable such that the total number of knots is  (n+2)^d, where d is the number of variables in the spline term. For a multivariate spline term, knot  values for each variable are determined independently from the corresponding boundary values."}},{"StatementOptionName":"M=","StatementOptionHelp":{"#cdata":"Syntax: M=number\n          \nSpecifies the order of the derivative in the penalty term. The number must be a positive integer. The default \nis max(2, int(d/2)+1), where d is the number of variables in the spline term."},"StatementOptionType":"RV"},{"StatementOptionName":"MAXDF=","StatementOptionHelp":{"#cdata":"Syntax: MAXDF=number\n          \nSpecifies the maximum number of degrees of freedom. When a thin-plate regression spline is formed, \nthe specified number is used for constructing a low-rank penalty matrix to approximate the penalty \nmatrix via the truncated eigendecomposition."},"StatementOptionType":"RV"},{"StatementOptionName":"MAXKNOTS=","StatementOptionHelp":{"#cdata":"Syntax: MAXKNOTS=number\n          \nSpecifies the maximum number of knots if data points are used to form knots. If KNOTS=LIST(list-of-values) \nis not specified, PROC GAMPL forms knots from unique data points. If the number of unique data points is \ngreater than number, a subset of size number is formed by random sampling from all unique data points. \nThe number cannot exceed the largest integer that can be stored on the given machine. \n\nBy default, MAXKNOTS=2000."},"StatementOptionType":"RV"},{"StatementOptionName":"MAXSMOOTH=","StatementOptionHelp":{"#cdata":"Syntax: MAXSMOOTH=number\n          \nSpecifies the upper bound for the smoothing parameter. The default is the largest double-precision value."},"StatementOptionType":"RV"},{"StatementOptionName":"MINSMOOTH=","StatementOptionHelp":{"#cdata":"Syntax: MINSMOOTH=number\n          \nSpecifies the lower bound for the smoothing parameter. By default, MINSMOOTH=0."},"StatementOptionType":"RV"},{"StatementOptionName":"SMOOTH=","StatementOptionHelp":{"#cdata":"Syntax: SMOOTH=number\n          \nSpecifies a fixed smoothing parameter. When you specify this option, no smoothing parameter selection \nis performed on the spline term."},"StatementOptionType":"RV"},{"StatementOptionName":"ALLOBS","StatementOptionHelp":{"#cdata":"Requests that all nonmissing values of the variables be specified in a spline term for constructing \nthe spline basis functions, regardless of whether other model variables are missing."},"StatementOptionType":"S"},{"StatementOptionName":"CRITERION=","StatementOptionHelp":{"#cdata":"Syntax: CRITERION=criterion\n          \nSpecifies the model evaluation criterion for selecting smoothing parameters for spline-effects."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"GACV","@Value2":"GCV","@Value3":"UBRE"},"StatementOptionToolTips":{"@ToolTip1":"Syntax: GACV<(FACTOR=number | GAMMA=number)>              Uses the generalized approximate cross validation (GACV) criterion to evaluate models.","@ToolTip2":"Syntax: GCV<(FACTOR=number | GAMMA=number)>                                     Uses the generalized cross validation (GCV) criterion to evaluate models.","@ToolTip3":"Syntax: UBRE<(FACTOR=number | GAMMA=number)>                                     Uses the unbiased risk estimator (UBRE) criterion to evaluate models."}},{"StatementOptionName":"DISPERSION=|PHI=","StatementOptionHelp":{"#cdata":"Syntax: DISPERSION=number | PHI=number\n          \nSpecifies a fixed dispersion parameter for distributions that have a dispersion parameter. The dispersion \nparameter that is used in all computations is fixed at number; it is not estimated."},"StatementOptionType":"V"},{"StatementOptionName":"DISTRIBUTION=","StatementOptionHelp":{"#cdata":"Specifies the response distribution for the model."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BINARY","@Value2":"BINOMIAL","@Value3":"GAMMA","@Value4":"INVERSEGAUSSIAN|IG","@Value5":"NEGATIVEBINOMIAL|NB","@Value6":"NORMAL|GAUSSIAN","@Value7":"POISSON","@Value8":"TWEEDIE"},"StatementOptionToolTips":{"@ToolTip1":"Binary distribution","@ToolTip2":"Binomial distribution","@ToolTip3":"Gamma distribution","@ToolTip4":"Inverse Gaussian distribution","@ToolTip5":"Negative binomial distribution","@ToolTip6":"Normal distribution","@ToolTip7":"Poisson distribution","@ToolTip8":"Tweedie distribution"},"SubOptionsKeywords":"INITIALP=|P="},{"StatementOptionName":"FDHESSIAN","StatementOptionHelp":{"#cdata":"Requests that the second-order derivatives (Hessian) be computed using finite-difference approximations \nbased on evaluation of the first-order derivatives (gradient). This option might be useful if the \nanalytical Hessian takes a long time to compute."},"StatementOptionType":"S"},{"StatementOptionName":"INITIALPHI=","StatementOptionHelp":{"#cdata":"Syntax: INITIALPHI=number \n          \nSpecifies a starting value for iterative maximum likelihood estimation of the dispersion parameter \nfor distributions that have a dispersion parameter."},"StatementOptionType":"V"},{"StatementOptionName":"LINK=","StatementOptionHelp":{"#cdata":"Specifies the link function for the model."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"CLOGLOG|CLL","@Value2":"IDENTITY|ID","@Value3":"INV|RECIP","@Value4":"INV2","@Value5":"LOG","@Value6":"LOGIT","@Value7":"LOGLOG","@Value8":"PROBIT"},"StatementOptionToolTips":{"@ToolTip1":"Complementary log-log function","@ToolTip2":"Identity function","@ToolTip3":"Reciprocal function","@ToolTip4":"Reciprocal square function","@ToolTip5":"Log function","@ToolTip6":"Logit function","@ToolTip7":"Log-log function","@ToolTip8":"Probit function"}},{"StatementOptionName":"MAXPHI=","StatementOptionHelp":{"#cdata":"Syntax: MAXPHI=number\n          \nSpecifies an upper bound for maximum likelihood estimation of the dispersion parameter for distributions \nthat have a dispersion parameter."},"StatementOptionType":"V"},{"StatementOptionName":"METHOD=","StatementOptionHelp":{"#cdata":"Syntax: METHOD=OUTER | PERFORMANCE\n          \nSpecifies the algorithm for selecting smoothing parameters for spline-effects.\n\nBy default, METHOD=PERFORMANCE."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"OUTER","@Value2":"PERFORMANCE"},"StatementOptionToolTips":{"@ToolTip1":"Specifies the outer iteration method for selecting smoothing parameters.                                     Note: The outer iteration method is experimental in this release.","@ToolTip2":"Specifies the performance iteration method for selecting smoothing parameters."}},{"StatementOptionName":"MINPHI=","StatementOptionHelp":{"#cdata":"Syntax: MINPHI=number\n          \nSpecifies a lower bound for maximum likelihood estimation of the dispersion parameter for distributions \nthat have a dispersion parameter."},"StatementOptionType":"V"},{"StatementOptionName":"NORMALIZE","StatementOptionHelp":{"#cdata":"Requests normalized spline basis functions for model fitting. After the regression spline basis functions \nare computed, each column is standardized to have a unit standard error. The corresponding penalty matrix \nis also scaled accordingly. This option might be helpful when you have badly scaled data."},"StatementOptionType":"S"},{"StatementOptionName":"OFFSET=","StatementOptionHelp":{"#cdata":"Syntax: OFFSET=variable\n          \nSpecifies a variable to be used as an offset to the linear predictor. An offset plays the role of \nan effect whose coefficient is known to be 1. The offset variable cannot appear in the CLASS statement \nor elsewhere in the MODEL statement. Observations that have missing values for the offset variable are \nexcluded from the analysis."},"StatementOptionType":"V"},{"StatementOptionName":"RIDGE=","StatementOptionHelp":{"#cdata":"Syntax: RIDGE=number\n          \nAllows a ridge parameter such that a diagonal matrix H : Hij number is added to the optimization problem \nwith respect to regression parameters.\n\nBy default, RIDGE=0."},"StatementOptionType":"V"},{"StatementOptionName":"SCALE=","StatementOptionHelp":{"#cdata":"Syntax: SCALE=DEVIANCE | MLE | PEARSON\n          \nSpecifies the method for estimating the scale and dispersion parameters."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"DEVIANCE","@Value2":"MLE","@Value3":"PEARSON"},"StatementOptionToolTips":{"@ToolTip1":"Estimates the dispersion parameter by using the deviance statistic.","@ToolTip2":"Computes the dispersion parameter by maximizing the likelihood or penalized likelihood.","@ToolTip3":"Estimates the dispersion parameter by using Pearson's statistic."}}]}},{"StatementName":"OUTPUT","StatementHelp":{"#cdata":"Syntax: OUTPUT OUT=CAS-libref.data-table<ALPHA=number> <COMPONENT> <COPYVARS=(variables)><keyword <=name>>…<keyword <=name>>;\n      \nThe OUTPUT statement creates a data table that contains observationwise statistics that PROC GAMMOD \ncomputes after fitting the model. In order to avoid data duplication for large data tables, the \nvariables in the input data table are not included in the output data table unless you specify them \nin the COPYVARS= option."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"OUT=","StatementOptionHelp":{"#cdata":"[Syntax: OUT=CAS-libref.data-table \nnames the output data table for PROC GAMMOD to use. You must specify this option before any other options. \nCAS-libref.data-table is a two-level name, where \n\nCAS-libref\n  refers to a collection of information that is defined in the LIBNAME statement and includes the caslib, \n  which includes a path to where the data table is to be stored, and a session identifier, which defaults \n  to the active session but which can be explicitly defined in the LIBNAME statement.\n  \ndata-table\nspecifies the name of the output data table."},"StatementOptionType":"RV|DV"},{"StatementOptionName":"LINP|XBETA","StatementOptionHelp":{"#cdata":"Linear prediction values on the link scale at design points."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"LOWER","StatementOptionHelp":{"#cdata":"Requests a lower Bayesian confidence band value for the predicted value. The default name is Lower."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"PEARSON|PEARS|RESCHI","StatementOptionHelp":{"#cdata":"Requests the Pearson residual. The default name is Pearson."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"PREDICTED|PRED|P","StatementOptionHelp":{"#cdata":"Requests predicted values for the response variable. For observations in which only the response \nvariable is missing, the predicted values are computed even though these observations do not \naffect the model fit. The default name is Pred."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"RESIDUAL|RESID|R","StatementOptionHelp":{"#cdata":"Requests the raw residual. The default name is Residual."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"STD","StatementOptionHelp":{"#cdata":"Requests a standard error for the linear predictor. The default name is Std."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"UPPER","StatementOptionHelp":{"#cdata":"Requests an upper Bayesian confidence band value for the predicted value. The default name is Upper."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=number \n          \nSpecifies the significance level for the construction of Bayesian confidence bands in the OUTPUT \ndata set. The confidence level is 1- number."},"StatementOptionType":"V"},{"StatementOptionName":"COMPONENT","StatementOptionHelp":{"#cdata":"Requests componentwise statistics for all spline terms if LINP, LOWER, STD, or UPPER is specified \nas a keyword."},"StatementOptionType":"S"},{"StatementOptionName":"COPYVAR=|COPYVARS=","StatementOptionHelp":{"#cdata":"[Syntax:COPYVAR=variable | COPYVARS=(variables) \n          \nTransfers one or more variables from the input data table to the output data table."},"StatementOptionType":"V"}]}},{"StatementName":"WEIGHT","StatementHelp":{"#cdata":"Syntax: WEIGHT variable; \n      \nThe variable in the WEIGHT statement is used as a weight to perform a weighted analysis of the data. Observations \nthat have nonpositive or missing weights are not included in the analysis. If a WEIGHT statement is not included, \nthen all observations that are used in the analysis are assigned a weight of 1."},"StatementOptions":null}]}}}