{"Procedure":{"Name":"GANNO","ProductGroup":"SAS/GRAPH","ProcedureHelp":{"#cdata":"Syntax: PROC GANNO ANNOTATE=Annotate-data-set \n      <DATASYS> \n      <DESCRIPTION='description'> \n      <GOUT=<libref.>output-catalog> \n      <IMAGEMAP=output-data-set> \n      <LONGNAME='entry-name'> \n      <NAME= 'entry-name' | variable-name>; \n\nThe GANNO procedure displays graphs created by Annotate data sets. The procedure can also be \nused to scale data-dependent graphics to fit the graphics output area. Note that the GANNO \nprocedure ignores all currently defined title and footnote statements and some graphics option \nspecifications, including BORDER=. To include titles, footnotes, and graphics options along with \nyour Annotate data set, use the GSLIDE procedure instead of the GANNO procedure."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"ANNOTATE=|ANNO=","ProcedureOptionHelp":{"#cdata":"[Syntax: ANNOTATE=Annotate-data-set] \n      \nSpecifies a data set that includes Annotate variables that identify graphics commands \nand parameters."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"DATASYS","ProcedureOptionHelp":{"#cdata":"Indicates that absolute or relative data-dependent coordinates occur in the Annotate data set \nand scales the coordinates to fit the graphics output area. Use the DATASYS option only with \nAnnotate data sets in which the coordinate system variables XSYS, YSYS, and HSYS specify the \nvalues 1, 2, 7, or 8.\n\nUse the DATASYS option when graphics elements that were created with data-dependent variables \ndo not fit in the graphics output area. This happens when the coordinate values generated by the \ndata exceed a range of 0 to 100.\n\nIf you omit the DATASYS option, the GANNO procedure attempts to draw each graphics element \naccording to the data values assigned to it, without scaling the values. If the range of data \nvalues is too large, some graphics elements will not display."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"DESCRIPTION=|DES=","ProcedureOptionHelp":{"#cdata":"[Syntax: DESCRIPTION='description'] \n      \nSpecifies the description of the catalog entry for the chart. The maximum length is 256 \ncharacters. The description does not appear on the chart. By default, the GANNO procedure \nassigns the description OUTPUT FROM PROC GANNO. \n\nThe descriptive text is shown in each of the following: \n\n  o the \"description\" portion of the Results window\n\n  o the catalog-entry properties that you can view from the Explorer window\n\n  o the Table of Contents that is generated when you use CONTENTS= on an ODS HTML statement, \n    assuming that the procedure output is generated while the contents page is open\n\n  o the Description field of the PROC GREPLAY window\n\n  o the chart description for Web output (depending on the device driver)."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"GOUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: GOUT=<libref.>output-catalog] \n      \nSpecifies the SAS catalog in which to save the graphics output produced by the GANNO procedure. \nIf you omit the libref, the SAS/GRAPH software looks for the catalog in the temporary library \ncalled WORK and creates the catalog if it does not exist."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"IMAGEMAP=","ProcedureOptionHelp":{"#cdata":"[Syntax: IMAGEMAP=output-data-set] \n      \nCreates a temporary SAS data set that is used to generate an image map in an HTML output file. \nThe information in the image map data set includes the shape and coordinates of the elements in \nthe graph and drill-down URLs that have been associated with those elements. The drill-down URLs \nare provided by one or two variables in the input data set. These variables are identified to the \nGANNO procedure with the HTML= and/or HTML_LEGEND= options.\n\nThe %IMAGEMAP macro generates the image map in the HTML output file. The macro takes two arguments, \nthe name of the image map data set and the name or fileref of the HTML output file, as shown in the \nfollowing example: \n\n  %imagemap(imgmapds, myimgmap.html);"},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"NAME=","ProcedureOptionHelp":{"#cdata":"[Syntax: NAME='entry-name' | variable-name] \n      \nSpecifies the name of the GRSEG catalog entry and the name of the graphics output file, if one \nis created. The name can be up to 256 characters long, but the GRSEG name is truncated to eight \ncharacters. Uppercase characters are converted to lowercase, and periods are converted to underscores. \nThe default GRSEG name is GANNO. If the name duplicates an existing name, then SAS/GRAPH adds a\nnumber to the name to create a unique name--for example, GANNO1."},"ProcedureOptionType":"V"}]},"ProcedureStatements":null}}