{"Procedure":{"Name":"GCHART","ProductGroup":"SAS/GRAPH","ProcedureHelp":{"#cdata":"Syntax: PROC GCHART <DATA=input-data-set> \n      <ANNOTATE=Annotate-data-set> \n      <GOUT=<libref.>output-catalog> \n      <IMAGEMAP=output-data-set>;  \n      BLOCK chart-variable(s) </ option(s)>;  \n      HBAR | HBAR3D | VBAR | VBAR3D chart-variable(s) </ option(s)>;  \n      PIE | PIE3D | DONUT chart-variable(s) </ option(s)>;  \n      STAR chart-variable(s) </ option(s)>;  \n\nThe GCHART procedure produces six types of charts: block charts, horizontal and vertical bar \ncharts, pie and donut charts, and star charts. These charts graphically represent the value of \na statistic calculated for one or more variables in an input SAS data set. The charted variables \ncan be either numeric or character.\n\nThe procedure calculates these statistics: \n  o frequency or cumulative frequency counts \n  o percentages or cumulative percentages \n  o sums \n  o means\n\nUse the GCHART procedure to do the following tasks:\n  o display and compare exact and relative magnitudes \n  o examine the contribution of parts to the whole \n  o analyze where data are out of balance"},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"ANNOTATE=|ANNO=","ProcedureOptionHelp":{"#cdata":"[Syntax: ANNOTATE=Annotate-data-set] \n      \nSpecifies a data set to annotate all graphs that are produced by the GCHART procedure. \nTo annotate individual graphs, use ANNOTATE= in the action statement."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=input-data-set] \n      \nSpecifies the SAS data set that contains the variable or variables to chart. By default, \nthe procedure uses the most recently created SAS data set."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"GOUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: GOUT=<libref.>output-catalog] \n      \nSpecifies the SAS catalog in which to save the graphics output that is produced by the GCHART \nprocedure. If you omit the libref, SAS/GRAPH looks for the catalog in the temporary library called \nWORK and creates the catalog if it does not exist."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"IMAGEMAP=","ProcedureOptionHelp":{"#cdata":"[Syntax: IMAGEMAP=output-data-set] \n      \nCreates a temporary SAS data set that is used to generate an image map in an HTML output file. \nThe information in the image map data set includes the shape and coordinates of the elements in \nthe graph and drill-down URLs that have been associated with those elements. The drill-down URLs \nare provided by one or two variables in the input data set. These variables are identified to the \nGCHART procedure with the HTML= or HTML_LEGEND= or both options.\n\nThe %IMAGEMAP macro generates the image map in the HTML output file. The macro takes two arguments, \nthe name of the image map data set and the name or fileref of the HTML file, as shown in the following \nexample: \n\n  %imagemap(imgmapds, myimgmap.html);\n  \nRestriction: Not supported by Java or ActiveX"},"ProcedureOptionType":"DV"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BLOCK","StatementHelp":{"#cdata":"Syntax: BLOCK chart-variable(s) </ option(s)>;\n      \nThe BLOCK statement specifies the variable or variables that define the categories of data \nto chart. This statement automatically does the following actions:\n\n  o determines the midpoints \n  o calculates the chart statistic for each midpoint (the default is FREQ) \n  o scales the blocks according to the statistic value \n  o assigns patterns and colors to the block faces and the grid; the default block pattern is solid\n\nYou can use statement options to select or order the midpoints (blocks), to change the type \nof chart statistic, and to modify the appearance of the chart. You can also specify additional \nvariables by which to group, subgroup, or sum the data.\n\nBlock charts enable grouping, which organizes the blocks into rows based on the values of a \ngroup variable, and subgrouping, which subdivides the blocks into segments based on the values \nof a subgroup variable."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ANNOTATE=|ANNO=","StatementOptionHelp":{"#cdata":"[Syntax: ANNOTATE=Annotate-data-set] \n          \nSpecifies a data set to annotate charts produced by the BLOCK statement."},"StatementOptionType":"DV"},{"StatementOptionName":"BLOCKMAX=","StatementOptionHelp":{"#cdata":"[Syntax: BLOCKMAX=max-value] \n          \nSpecifies the chart statistic value of the tallest block on the chart. This option lets you \nproduce a series of block charts using the same scale."},"StatementOptionType":"V"},{"StatementOptionName":"CAXIS=|CA=|CAXES=","StatementOptionHelp":{"#cdata":"[Syntax: CAXIS=grid-color] \n          \nSpecifies the color for the midpoint grid."},"StatementOptionType":"C"},{"StatementOptionName":"COUTLINE=|CO=","StatementOptionHelp":{"#cdata":"[Syntax: COUTLINE=block-outline-color | SAME] \n          \nOutlines all blocks or all block segments and legend values in the subgroup legend \n(if it appears) using the specified color. SAME specifies that the outline color of \na block or a block segment or a legend value is the same as the interior pattern color."},"StatementOptionType":"C"},{"StatementOptionName":"COUTLINE=SAME","StatementOptionHelp":{"#cdata":"[Syntax: COUTLINE=block-outline-color | SAME] \n          \nOutlines all blocks or all block segments and legend values in the subgroup legend \n(if it appears) using the specified color. SAME specifies that the outline color of \na block or a block segment or a legend value is the same as the interior pattern color."},"StatementOptionType":"S|V"},{"StatementOptionName":"CTEXT=|CT=","StatementOptionHelp":{"#cdata":"[Syntax: CTEXT=text-color] \n          \nSpecifies a color for all text on the axes and legend, including axis labels, tick mark \nvalues, legend labels, and legend value descriptions."},"StatementOptionType":"C"},{"StatementOptionName":"DESCRIPTION=|DES=","StatementOptionHelp":{"#cdata":"[Syntax: DESCRIPTION='description'] \n          \nSpecifies the description of the catalog entry for the chart. The maximum length for \nentry-description is 256 characters. The description does not appear on the chart. By \ndefault, the GCHART procedure assigns a description of the form BLOCK CHART OF variable, \nwhere variable is the name of the chart variable.\n\nThe entry-description can include the #BYLINE, #BYVAL, and #BYVAR substitution options, \nwhich work as they do when used on TITLE, FOOTNOTE, and NOTE statements."},"StatementOptionType":"V"},{"StatementOptionName":"DISCRETE","StatementOptionHelp":{"#cdata":"Treats a numeric chart variable as a discrete variable rather than as a continuous variable. \nThe GCHART procedure creates a separate midpoint and, hence, a separate grid square and block \nfor each unique value of the chart variable."},"StatementOptionType":"S"},{"StatementOptionName":"FREQ=","StatementOptionHelp":{"#cdata":"[Syntax: FREQ=numeric-variable] \n          \nSpecifies a variable whose values weight the contribution of each observation in the computation \nof the chart statistic. Each observation is counted the number of times specified by the value of \nnumeric-variable for that observation. If the value of numeric-variable is missing, 0, or negative, \nthe observation is not used in the statistic calculation. Non-integer values of numeric-variable are \ntruncated to integers.\n\nFREQ= is valid with all chart statistics.\n\nBecause you cannot use the PERCENT, CPERCENT, FREQ, or CFREQ statistics with the SUMVAR= option, \nyou must use the FREQ= option to calculate percentages, cumulative percentages, frequencies, or \ncumulative frequencies based on a sum.\n\nThe statistics are not affected by applying a format to numeric-variable."},"StatementOptionType":"NVL"},{"StatementOptionName":"GAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: GAXIS=AXIS<1...99>] \n          \nAssigns the specified AXIS definition to the group axis. (A group axis is created when you use \nthe GROUP= option.) You can use the AXIS definition to modify the order of the groups, the text \nof the labels, and appearance of the axis. GAXIS= is ignored if the specified AXIS definition \ndoes not exist."},"StatementOptionType":"V"},{"StatementOptionName":"G100","StatementOptionHelp":{"#cdata":"Calculates the percentage and cumulative percentage statistics separately for each group. \nWhen you use G100, the individual percentages reflect the contribution of the midpoint to \nthe group and total 100 percent for each group. G100 is ignored unless you also use the \nGROUP= option.\n\nBy default, the individual percentages reflect the contribution of the midpoint to the entire \nchart and total 100 percent for the entire chart."},"StatementOptionType":"S"},{"StatementOptionName":"GROUP=","StatementOptionHelp":{"#cdata":"[Syntax: GROUP=group-variable] \n          \nOrganizes the data according to the values of group-variable. Group-variable can be either \ncharacter or numeric and is always treated as a discrete variable. The group variable can \nhave up to 12 different values."},"StatementOptionType":"VL"},{"StatementOptionName":"HTML=","StatementOptionHelp":{"#cdata":"[Syntax: HTML=variable] \n          \nIdentifies the variable in the input data set whose values create links in the HTML file that \nis created by the ODS statement. These links are associated with an area of the chart and point \nto the data or graph you want to display when the user drills down on the area. There is no limit \non the length of the variable."},"StatementOptionType":"V"},{"StatementOptionName":"HTML_LEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: HTML_LEGEND=variable] \n          \nIdentifies the variable in the input data set whose values create links in the HTML file that \nis created by the ODS statement. These links are associated with an area of the chart and point \nto the data or graph you want to display when the user drills down on the area. There is no limit \non the length of the variable."},"StatementOptionType":"V"},{"StatementOptionName":"LEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: LEGEND=LEGEND<1...99>] \n          \nAssigns the specified LEGEND definition to the legend generated by the SUBGROUP= option. \nThe LEGEND= option itself does not generate a legend."},"StatementOptionType":"V"},{"StatementOptionName":"LEVELS=","StatementOptionHelp":{"#cdata":"[Syntax: LEVELS=number-of-midpoints] \n          \nSpecifies the number of midpoints for the numeric chart variable."},"StatementOptionType":"V"},{"StatementOptionName":"MAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: MAXIS=AXIS<1...99>] \n          \nAssigns the specified AXIS definition to the midpoint axis. The MAXIS= option is ignored \nif the specified AXIS definition does not exist.\n\nThe Java and ActiveX devices do not support all AXIS statement options."},"StatementOptionType":"V"},{"StatementOptionName":"MIDPOINTS=","StatementOptionHelp":{"#cdata":"[Syntax: MIDPOINTS=value-list | OLD] \n          \nSpecifies the midpoint values for the blocks. The way you specify value-list depends on the \ntype of variable:\n          \nFor numeric chart variables, value-list is either an explicit list of values, or a starting \nand an ending value with an interval increment, or a combination of both forms: \n\n     n <...n>\n     \n     n TO n <BY increment>\n     \n     n<...n> TO n <BY increment> <n <...n>>\n \nFor character chart variables, value-list is a list of unique character values enclosed in \nquotation marks and separated by blanks: \n\n    'value-1' <...'value-n'> \n    \nMIDPOINTS=OLD generates default midpoints using the Nelder algorithm."},"StatementOptionType":"V"},{"StatementOptionName":"MIDPOINTS=OLD","StatementOptionHelp":{"#cdata":"Generates default midpoints using the Nelder algorithm."},"StatementOptionType":"V"},{"StatementOptionName":"MISSING","StatementOptionHelp":{"#cdata":"Accepts a missing value as a valid midpoint for the chart variable. By default, observations \nwith missing values are ignored."},"StatementOptionType":"S"},{"StatementOptionName":"NAME=","StatementOptionHelp":{"#cdata":"[Syntax: NAME='entry-name'] \n          \nSpecifies the name of the GRSEG catalog entry and the name of the graphics output file, \nif one is created."},"StatementOptionType":"V"},{"StatementOptionName":"NOLEGEND","StatementOptionHelp":{"#cdata":"Suppresses the legend generated by the LEGEND= option."},"StatementOptionType":"S"},{"StatementOptionName":"PATTERNID=|PATTID=","StatementOptionHelp":{"#cdata":"Specifies the way fill patterns are assigned."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BY","@Value2":"MIDPOINT","@Value3":"SUBGROUP"},"StatementOptionToolTips":{"@ToolTip1":"Changes patterns each time the value of the BY variable changes. All bars use the same pattern  if the GBARLINE procedure does not include a BY statement.","@ToolTip2":"Changes patterns every time the midpoint value changes.","@ToolTip3":"Changes patterns every time the value of the subgroup variable changes."}},{"StatementOptionName":"RAXIS=|AXIS=","StatementOptionHelp":{"#cdata":"[Syntax: RAXIS=value-list | AXIS<1...99>] \n          \nSpecifies values for the major tick mark divisions on the response axis or assigns \nthe specified AXIS definition to the axis."},"StatementOptionType":"V"},{"StatementOptionName":"SUBGROUP=","StatementOptionHelp":{"#cdata":"[Syntax: SUBGROUP=subgroup-variable] \n          \nDivides the blocks into segments according to the values of subgroup-variable. Subgroup-variable \ncan be either character or numeric and is always treated as a discrete variable."},"StatementOptionType":"VL"},{"StatementOptionName":"SUMVAR=","StatementOptionHelp":{"#cdata":"[Syntax: SUMVAR=summary-variable] \n          \nSpecifies a numeric variable for sum or mean calculations. The GCHART procedure calculates the \nsum or, if requested, the mean of numeric-variable for each midpoint. The resulting statistics \nare represented by the height of the blocks in each square. The values of a summary variable  \nused with the BLOCK statement have a maximum length of 8.\n\nWhen you use SUMVAR=, the TYPE= option value must be either SUM or MEAN. With SUMVAR=, the \ndefault is TYPE=SUM."},"StatementOptionType":"VL"},{"StatementOptionName":"TYPE=","StatementOptionHelp":{"#cdata":"Specifies the chart statistic."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FREQ","@Value2":"CFREQ","@Value3":"PERCENT","@Value4":"CPERCENT","@Value5":"SUM","@Value6":"MEAN"},"StatementOptionToolTips":{"@ToolTip1":"[Valid if the SUMVAR= opion is not used]--Frequency","@ToolTip2":"[Valid if the SUMVAR= opion is not used]--Cumulative frequency","@ToolTip3":"[Valid if the SUMVAR= opion is not used]--Percentage","@ToolTip4":"[Valid if the SUMVAR= opion is not used]--Cumulative percentage","@ToolTip5":"[Valid if the SUMVAR= opion is used]--Sum","@ToolTip6":"[Valid if the SUMVAR= opion is used]--Mean"}},{"StatementOptionName":"URL=","StatementOptionHelp":{"#cdata":"[URL=character-variable \n          \nSpecifies a character variable whose values are URLs. The variable values are URLs for \nWeb pages to display when the user clicks (drills down) on elements in the graph. \n\nRestrictions: This option affects graphics output that is created through the ODS HTML \ndestination only. Not supported by GIF, PNG, and ACTIVEX devices.\n\nInteraction: If you specify both the HTML= and the URL= options, then the URL= option \nis ignored."},"StatementOptionType":"V"},{"StatementOptionName":"WOUTLINE=","StatementOptionHelp":{"#cdata":"[Syntax: WOUTLINE=block-outline-width] \n          \nSpecifies the width of the block outline in pixels."},"StatementOptionType":"V"}]}},{"StatementName":"HBAR","StatementHelp":{"#cdata":"Syntax: HBAR chart-variable*width-variable SUMVAR=numeric-variable</ option(s)>; \n      \nThe HBAR, HBAR3D, VBAR, and VBAR3D statements specify the variable or variables that define \nthe categories of data to chart. These statements automatically do the following:\n\n  o determine the midpoints \n  o calculate the chart statistic for each midpoint (the default is FREQ) \n  o scale the response axis and the bars according to the statistic value \n  o determine bar width and spacing \n  o assign patterns to the bars; the default bar/block pattern is SOLID \n  o draw a frame around the axis area using a color determined by the current style, or, \n    if the NOGSTYLE option is specified, using the first color in the device's color list\n\nYou can use statement options to select or order the midpoints (bars), to control the tick marks \non the response axis, to change the type of chart statistic, to display specific statistics, and \nto modify the appearance of the chart. You can also specify additional variables by which to group, \nsubgroup, or sum the data."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ANNOTATE=|ANNO=","StatementOptionHelp":{"#cdata":"[Syntax: ANNOTATE=Annotate-data-set] \n          \nSpecifies a data set to annotate charts produced by the BAR statement."},"StatementOptionType":"DV"},{"StatementOptionName":"ASCENDING","StatementOptionHelp":{"#cdata":"Arranges the bars in ascending order of the value of the bar statistic."},"StatementOptionType":"S"},{"StatementOptionName":"AUTOREF","StatementOptionHelp":{"#cdata":"Draws a reference line at each major tick mark on the bar (left) response axis."},"StatementOptionType":"S"},{"StatementOptionName":"AXIS=","StatementOptionHelp":{"#cdata":"[Syntax: AXIS=AXIS<1...99>] \n          \nSpecifies values for the major tick mark divisions on the response axis or assigns the \nspecified AXIS definition to the axis."},"StatementOptionType":"V"},{"StatementOptionName":"CAUTOREF=","StatementOptionHelp":{"#cdata":"[Syntax: CAUTOREF=reference-line-color] \n          \nSpecifies the color of reference lines drawn at major tick marks, as determined by the \nAUTOREF option."},"StatementOptionType":"C"},{"StatementOptionName":"CAXIS=|CA=|CAXES=","StatementOptionHelp":{"#cdata":"[Syntax: CAXIS=axis-color] \n          \nSpecifies a color for the response and midpoint axis lines and for the default axis area frame."},"StatementOptionType":"C"},{"StatementOptionName":"CERROR=","StatementOptionHelp":{"#cdata":"[Syntax: CERROR=error-bar-color] \n          \nSpecifies the color of error bars. The default color is the color of the response axis, \nwhich is controlled by the CAXIS= option."},"StatementOptionType":"C"},{"StatementOptionName":"CFRAME=|CFR=","StatementOptionHelp":{"#cdata":"[Syntax: CFRAME=background-color] \n          \nSpecifies the color with which to fill the axis area in two-dimensional bar charts or in \nthe backplane in three-dimensional bar charts."},"StatementOptionType":"C"},{"StatementOptionName":"CFREQ","StatementOptionHelp":{"#cdata":"Displays the cumulative frequency statistic above vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"CFREQLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: CFREQLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the CFREQ statistic in the table of statistics. \nColumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters."},"StatementOptionType":"V"},{"StatementOptionName":"CLIPREF","StatementOptionHelp":{"#cdata":"Clips the reference lines at the bars. This makes the reference lines appear to be behind the bars."},"StatementOptionType":"S"},{"StatementOptionName":"CLM=","StatementOptionHelp":{"#cdata":"[Syntax: CLM=confidence-level] \n          \nSpecifies the confidence intervals to use when drawing error bars. Values for confidence-level \nmust be greater than or equal to 50 and strictly less than 100. The default is 95."},"StatementOptionType":"V"},{"StatementOptionName":"COUTLINE=|CO=","StatementOptionHelp":{"#cdata":"[Syntax: COUTLINE=bar-outline-color | SAME] \n          \nOutlines all bars or bar segments and legend values in the subgroup legend (if it appears) \nusing the specified color. SAME specifies that the outline color of a bar or a bar segment \nor a legend value is the same as the interior pattern color."},"StatementOptionType":"C"},{"StatementOptionName":"CPERCENT|CPCT","StatementOptionHelp":{"#cdata":"[Displays the cumulative percentage statistic above the vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"CREF=|CR=","StatementOptionHelp":{"#cdata":"[Syntax: CREF=reference-line-color|(reference-line-color)|reference-line-color-list] \n          \nSpecifies colors for reference lines."},"StatementOptionType":"C"},{"StatementOptionName":"CPERCENTLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: CPERCENTLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the CPERCENT statistic in the table of statistics. \nColumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters. To suppress the label, specify CPERCENTLABEL=NONE."},"StatementOptionType":"V"},{"StatementOptionName":"CTEXT=|CT=","StatementOptionHelp":{"#cdata":"[Syntax: CTEXT=text-color] \n          \nSpecifies a color for all text on the axes and legend, including axis labels, tick mark values, \nlegend labels, and legend value descriptions."},"StatementOptionType":"C"},{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Arranges the bars in descending order of the value of the chart statistic."},"StatementOptionType":"S"},{"StatementOptionName":"DESCRIPTION=|DES=","StatementOptionHelp":{"#cdata":"[Syntax: DESCRIPTION='entry-description'] \n          \nSpecifies the description of the catalog entry for the chart. The maximum length for the \nentry-description is 256 characters."},"StatementOptionType":"V"},{"StatementOptionName":"DISCRETE","StatementOptionHelp":{"#cdata":"Treats a numeric chart variable as a discrete variable rather than as a continuous variable."},"StatementOptionType":"S"},{"StatementOptionName":"ERRORBAR=","StatementOptionHelp":{"#cdata":"Draws confidence intervals for either of the following:\n\no the mean of the SUMVAR= variable for each midpoint if you specify TYPE=MEAN\n\no the percentage of observations assigned to each midpoint if you specify TYPE=PCT with no SUMVAR= option."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BARS","@Value2":"BOTH","@Value3":"TOP"},"StatementOptionToolTips":{"@ToolTip1":"Draws error bars as bars half the width of the main bars.","@ToolTip2":"Draws error bars as two ticks joined by a line (default).","@ToolTip3":"Draws the error bar as a tick for the upper confidence limit that is joined to the top of  the bar by a line."}},{"StatementOptionName":"FRAME|FR","StatementOptionHelp":{"#cdata":"Specifies that the two-dimensional axis area frame or the three-dimensional backplane is drawn."},"StatementOptionType":"S"},{"StatementOptionName":"NOFRAME|NOFR","StatementOptionHelp":{"#cdata":"Specifies that two-dimensional axis area frame or the three-dimensional backplane is not drawn."},"StatementOptionType":"S"},{"StatementOptionName":"FREQ","StatementOptionHelp":{"#cdata":"Displays the frequency statistic in the table of statistics and above vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"FREQLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: FREQLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the FREQ statistic in the table of statistics. \ncolumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<'column-label'>","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Replace <'column-label'> with the column label for FREQ statistic in the table of statistics.","@ToolTip2":"Specifies no column label for the FREQ statistic in the table of statistics."}},{"StatementOptionName":"FREQ=","StatementOptionHelp":{"#cdata":"[Syntax: FREQ=numeric-variable] \n          \nSpecifies a variable whose values weight the contribution of each observation in the \ncomputation of the chart statistic."},"StatementOptionType":"VL"},{"StatementOptionName":"G100","StatementOptionHelp":{"#cdata":"Calculates the percentage and cumulative percentage statistics separately for each group."},"StatementOptionType":"S"},{"StatementOptionName":"GAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: GAXIS=AXIS<1...99>] \n          \nAssigns the specified AXIS definition to the group axis. (A group axis is created when you \nuse the GROUP= option.)"},"StatementOptionType":"V"},{"StatementOptionName":"GROUP=","StatementOptionHelp":{"#cdata":"[Syntax: GROUP=group-variable] \n          \nOrganizes the data according to values of group-variable. Group-variable can be either \ncharacter or numeric and is always treated as a discrete variable."},"StatementOptionType":"V"},{"StatementOptionName":"GSPACE=","StatementOptionHelp":{"#cdata":"[Syntax: GSPACE=group-spacing] \n          \nSpecifies the amount of extra space between groups of bars. Group-space can be any \nnon-negative number. Units are character cells."},"StatementOptionType":"V"},{"StatementOptionName":"HTML=","StatementOptionHelp":{"#cdata":"[Syntax: HTML=variable] \n          \nIdentifies the variable in the input data set whose values create links in the HTML file \ncreated by the ODS statement."},"StatementOptionType":"V"},{"StatementOptionName":"HTML_LEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: HTML_LEGEND=variable] \n          \nIdentifies the variable in the input data set whose values create links in the HTML file \nthat is created by the ODS statement."},"StatementOptionType":"V"},{"StatementOptionName":"IFRAME=","StatementOptionHelp":{"#cdata":"[Syntax: IFRAME=fileref | 'external-file'] \n          \nSpecifies an image file to use on a 2-D chart's frame area or a 3-D chart's backplane."},"StatementOptionType":"V"},{"StatementOptionName":"IMAGESTYLE=","StatementOptionHelp":{"#cdata":"Specifies whether to use multiple instances of an image to fill the axis frame or backplane (TILE) \nor to stretch a single instance of an image to fill the axis frame or backplane frame (FIT). The \nTILE value is the default."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"TILE","@Value2":"FIT"},"StatementOptionToolTips":{"@ToolTip1":"Specifies to use multiple instances of an image to fill the axis frame or backplane.","@ToolTip2":"Specifies to stretch a single instance of an image to fill the axis frame or backplane frame."}},{"StatementOptionName":"INSIDE=","StatementOptionHelp":{"#cdata":"Displays the values of the specified statistic inside the bars."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FREQ","@Value2":"CFREQ","@Value3":"PERCENT","@Value4":"CPERCENT","@Value5":"SUM","@Value6":"MEAN","@Value7":"SUBPCT"},"StatementOptionToolTips":{"@ToolTip1":"Frequencies","@ToolTip2":"Cumulative frequencies. [Note: Not valid if the bars are subgrouped.]","@ToolTip3":"Percentages","@ToolTip4":"Cumulative percentages. [Note: Not valid if the bars are subgrouped.]","@ToolTip5":"Sums","@ToolTip6":"Means. [Note: Not valid if the bars are subgrouped.]","@ToolTip7":"Subgroup percent contribution"}},{"StatementOptionName":"LAUTOREF=","StatementOptionHelp":{"#cdata":"[Syntax: LAUTOREF=reference-line-type] \n          \nSpecifies the line type for reference lines at major tick marks, as determined by the AUTOREF option."},"StatementOptionType":"V"},{"StatementOptionName":"LEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: LEGEND=LEGEND<1...99>] \n          \nAssigns the specified LEGEND definition to the legend generated by the SUBGROUP= option."},"StatementOptionType":"V"},{"StatementOptionName":"LEVELS=","StatementOptionHelp":{"#cdata":"[Syntax: LEVELS=number-of-midpoints | ALL] \n          \nSpecifies the number of midpoints for the numeric chart variable. The range for each midpoint \nis calculated automatically, using the algorithm in Terrell and Scott (1985).\n\nIf you specify LEVELS=ALL, then all unique midpoint values are graphed. If your data contains \na large number of unique midpoint values (over 200), you can use the XPIXELS and YPIXELS GOPTIONS \nto enable the device driver to render a larger (and more readable) graph.\n\nThe LEVELS= option is ignored if any of the following are true:\n\n  o The chart variable is character type. \n  o The DISCRETE option is used. \n  o The MIDPOINTS= option is used."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<number-of-midpoints>","@Value2":"ALL"},"StatementOptionToolTips":{"@ToolTip1":"Replace <number-of-midpoints> with the desired number of midpoints for the numeric chart variable.","@ToolTip2":"Specifies that all unique midpoint values are graphed. If your data contains a large number  of unique midpoint values (over 200), you can use the XPIXELS and YPIXELS GOPTIONS to enable  the device driver to render a larger (and more readable) graph."}},{"StatementOptionName":"LREF=|LR=","StatementOptionHelp":{"#cdata":"[Syntax: LREF=reference-line-type|( reference-line-type|reference-line-type-list)] \n          \nSpecifies line types for reference lines. Line types are specified as whole numbers from 1 to 46, \nwith 1 representing a solid line and the other values representing dashed lines."},"StatementOptionType":"V"},{"StatementOptionName":"MAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: MAXIS=AXIS<1...99] \n          \nAssigns the specified AXIS definition to the midpoint axis."},"StatementOptionType":"V"},{"StatementOptionName":"MEAN","StatementOptionHelp":{"#cdata":"Displays the mean statistic in the table of statistics and above vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"MEANLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: MEANLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the MEAN statistic in the table of statistics. \ncolumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<'column-label'>","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Replace <'column-label'> with the column label for the MEAN statistic in the table of statistics.","@ToolTip2":"Specifies no column label for the MEAN statistic in the table of statistics."}},{"StatementOptionName":"MIDPOINTS=","StatementOptionHelp":{"#cdata":"[Syntax: MIDPOINTS=value-list | OLD] \n          \nSpecifies the midpoint values for the bars. The way you specify value-list depends on the \ntype of the chart variable.\n          \nFor numeric chart variables, value-list is either an explicit list of values, or a starting \nand an ending value with an interval increment, or a combination of both forms: \n\n     n <...n>\n     \n     n TO n <BY increment>\n     \n     n<...n> TO n <BY increment> <n <...n>>\n \nFor character chart variables, value-list is a list of unique character values enclosed in \nquotation marks and separated by blanks: \n\n    'value-1' <...'value-n'> \n    \nMIDPOINTS=OLD generates default midpoints using the Nelder algorithm."},"StatementOptionType":"V"},{"StatementOptionName":"MIDPOINTS=OLD","StatementOptionHelp":{"#cdata":"Generates default midpoints using the Nelder algorithm. The MIDPOINTS=OLD option is ignored \nunless the chart variable is numeric."},"StatementOptionType":"V"},{"StatementOptionName":"MINOR=","StatementOptionHelp":{"#cdata":"[Syntax: MINOR=number-of-minor-ticks] \n          \nSpecifies the number of minor tick marks between each major tick mark on the bar response axis."},"StatementOptionType":"V"},{"StatementOptionName":"MISSING","StatementOptionHelp":{"#cdata":"Accepts a missing value as a valid midpoint for the chart variable. By default, observations \nwith missing values are ignored."},"StatementOptionType":"S"},{"StatementOptionName":"NAME=","StatementOptionHelp":{"#cdata":"[Syntax: NAME='entry-name'] \n          \nSpecifies the name of the GRSEG catalog entry and the name of the graphics output file, \nif one is created."},"StatementOptionType":"V"},{"StatementOptionName":"NOAXIS","StatementOptionHelp":{"#cdata":"Suppresses all axes, including axis lines, axis labels, axis values, and all major and \nminor tick marks."},"StatementOptionType":"S"},{"StatementOptionName":"NOBASEREF","StatementOptionHelp":{"#cdata":"Suppresses the zero reference line when the SUM or MEAN bar statistic has negative values."},"StatementOptionType":"S"},{"StatementOptionName":"NOLEGEND","StatementOptionHelp":{"#cdata":"Suppresses the legend that is automatically generated by the SUBGROUP= option."},"StatementOptionType":"S"},{"StatementOptionName":"NOPLANE","StatementOptionHelp":{"#cdata":"Removes either the horizontal or vertical three-dimensional axis plane in bar charts produced \nby the HBAR3D and VBAR3D statements."},"StatementOptionType":"S"},{"StatementOptionName":"NOSTATS","StatementOptionHelp":{"#cdata":"Suppresses the table of statistics. The NOSTATS option suppresses both the default statistics and \nspecific statistics requested by the FREQ, CFREQ, PERCENT, CPERCENT, SUM, and MEAN options."},"StatementOptionType":"S"},{"StatementOptionName":"NOZERO","StatementOptionHelp":{"#cdata":"Suppresses any midpoints for which there are no corresponding values of the chart variable and, \nhence, no bar."},"StatementOptionType":"S"},{"StatementOptionName":"OUTSIDE=","StatementOptionHelp":{"#cdata":"Displays the values of the specified statistic above the bars."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FREQ","@Value2":"CFREQ","@Value3":"PERCENT","@Value4":"CPERCENT","@Value5":"SUM","@Value6":"MEAN"},"StatementOptionToolTips":{"@ToolTip1":"Frequencies","@ToolTip2":"Cumulative frequencies","@ToolTip3":"Percentages","@ToolTip4":"Cumulative percentages","@ToolTip5":"Sums","@ToolTip6":"Means"}},{"StatementOptionName":"PATTERNID=|PATTID=","StatementOptionHelp":{"#cdata":"Specifies the way fill patterns are assigned."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BY","@Value2":"MIDPOINT","@Value3":"SUBGROUP"},"StatementOptionToolTips":{"@ToolTip1":"Changes patterns each time the value of the BY variable changes. All bars use the same pattern if the GBARLINE procedure does not include a BY statement.","@ToolTip2":"Changes patterns every time the midpoint value changes.","@ToolTip3":"Changes patterns every time the value of the subgroup variable changes."}},{"StatementOptionName":"PERCENT|PCT","StatementOptionHelp":{"#cdata":"Prints the percentages of observations having a given value for the chart variable in the table \nof statistics and above vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"PERCENTSUM|PCTSUM","StatementOptionHelp":{"#cdata":"calculates a percent of the sum variable for horizontal bar charts."},"StatementOptionType":"S"},{"StatementOptionName":"PERCENTLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: PERCENTLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the PERCENT statistic in the table of statistics. \ncolumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<'column-label'>","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Replace <'column-label'> with the column label for the PERCENT statistic in the table of statistics.","@ToolTip2":"Specifies no column label for the PERCENT statistic in the table of statistics."}},{"StatementOptionName":"RANGE","StatementOptionHelp":{"#cdata":"Displays on the axis of the chart the range of numeric values represented by each bar."},"StatementOptionType":"S"},{"StatementOptionName":"RAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: RAXIS=value-list | AXIS<1...99>] \n          \nSpecifies values for the major tick mark divisions on the response axis or assigns the \nspecified AXIS definition to the axis."},"StatementOptionType":"V"},{"StatementOptionName":"REF=|HREF=|VREF=","StatementOptionHelp":{"#cdata":"[Syntax: REF=value-list] \n          \nDraws reference lines at the specified points on the chart response axis."},"StatementOptionType":"V"},{"StatementOptionName":"SPACE=","StatementOptionHelp":{"#cdata":"[Syntax: SPACE=bar-spacing] \n          \nSpecifies the amount of space between individual bars or between the bars within each group \nif you also use the GROUP= option."},"StatementOptionType":"V"},{"StatementOptionName":"SUBGROUP=","StatementOptionHelp":{"#cdata":"[Syntax: SUBGROUP=subgroup-variable] \n          \nDivides the bars into segments according to the values of subgroup-variable. Subgroup-variable \ncan be either character or numeric and is always treated as a discrete variable."},"StatementOptionType":"VL"},{"StatementOptionName":"SUM","StatementOptionHelp":{"#cdata":"Displays the sum statistic in the table of statistics and above vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"SUMLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: SUMLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the SUM statistic in the table of statistics. \ncolumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<'column-label'>","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Replace <'column-label'> with the column label for the SUM statistic in the table of statistics.","@ToolTip2":"Specifies no column label for the SUM statistic in the table of statistics."}},{"StatementOptionName":"SUMVAR=","StatementOptionHelp":{"#cdata":"[Syntax: SUMVAR=summary-variable] \n          \nSpecifies a numeric variable for sum or mean calculations."},"StatementOptionType":"VL"},{"StatementOptionName":"TYPE=","StatementOptionHelp":{"#cdata":"Specifies the chart statistic."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FREQ","@Value2":"CFREQ","@Value3":"PERCENT","@Value4":"CPERCENT","@Value5":"SUM","@Value6":"MEAN"},"StatementOptionToolTips":{"@ToolTip1":"[Valid if the SUMVAR= option is not used]--Frequency","@ToolTip2":"[Valid if the SUMVAR= option is not used]--Cumulative frequency","@ToolTip3":"[Valid if the SUMVAR= option is not used]--Percentage","@ToolTip4":"[Valid if the SUMVAR= option is not used]--Cumulative percentage","@ToolTip5":"[Valid if the SUMVAR= option is used]--Sum","@ToolTip6":"[Valid if the SUMVAR= option is used]--Mean"}},{"StatementOptionName":"URL=","StatementOptionHelp":{"#cdata":"[URL=character-variable \n          \nSpecifies a character variable whose values are URLs. The variable values are URLs for \nWeb pages to display when the user clicks (drills down) on elements in the graph. \n\nRestrictions: This option affects graphics output that is created through the ODS HTML \ndestination only. Not supported by GIF, PNG, and ACTIVEX devices.\n\nInteraction: If you specify both the HTML= and the URL= options, then the URL= option \nis ignored."},"StatementOptionType":"V"},{"StatementOptionName":"WAUTOREF=","StatementOptionHelp":{"#cdata":"[Syntax: WAUTOREF=reference-line-width] \n          \nSpecifies the line width for reference lines at major tick marks, as determined by the AUTOREF option."},"StatementOptionType":"V"},{"StatementOptionName":"WIDTH=","StatementOptionHelp":{"#cdata":"[Syntax: WIDTH=bar-width] \n          \nSpecifies the width of the bars. By default, the GCHART procedure selects a bar width that \naccommodates the midpoint values displayed on the midpoint axis using a hardware font and a \nheight of one cell. Units for bar-width are character cells. The value for bar-width must be \ngreater than 0, but it does not have to be an integer, for example: \n\n  vbar site / width=1.5;\n  \nIf the requested bar width results in a chart that is too large to fit in the space available \nfor the midpoint axis, then the procedure issues a warning in the log and ignores the WIDTH= \noption. If the specified width is too narrow, the procedure displays the midpoint values vertically."},"StatementOptionType":"V"},{"StatementOptionName":"WOUTLINE=","StatementOptionHelp":{"#cdata":"[Syntax: WOUTLINE=bar-outline-width] \n          \nSpecifies the width of the outline in pixels. The WOUTLINE= option affects both the bar \nand the subgroup outlines."},"StatementOptionType":"V"},{"StatementOptionName":"WREF=|WR=","StatementOptionHelp":{"#cdata":"[Syntax: WREF=reference-line-width|( reference-line-width|reference-line-width-list)] \n          \nSpecifies line widths for reference lines. Line widths are specified as whole numbers. \nTo specify colors for these reference lines, use the CREF= option."},"StatementOptionType":"V"}]}},{"StatementName":"HBAR3D","StatementHelp":{"#cdata":"Syntax: HBAR3D chart-variable*width-variable SUMVAR=numeric-variable</ option(s)>; \n      \nThe HBAR, HBAR3D, VBAR, and VBAR3D statements specify the variable or variables that define \nthe categories of data to chart. These statements automatically do the following:\n\n  o determine the midpoints \n  o calculate the chart statistic for each midpoint (the default is FREQ) \n  o scale the response axis and the bars according to the statistic value \n  o determine bar width and spacing \n  o assign patterns to the bars; the default bar/block pattern is SOLID \n  o draw a frame around the axis area using a color determined by the current style, or, \n    if the NOGSTYLE option is specified, using the first color in the device's color list\n\nYou can use statement options to select or order the midpoints (bars), to control the tick marks \non the response axis, to change the type of chart statistic, to display specific statistics, and \nto modify the appearance of the chart. You can also specify additional variables by which to group, \nsubgroup, or sum the data."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ANNOTATE=|ANNO=","StatementOptionHelp":{"#cdata":"[Syntax: ANNOTATE=Annotate-data-set] \n          \nSpecifies a data set to annotate charts produced by the BAR statement."},"StatementOptionType":"DV"},{"StatementOptionName":"ASCENDING","StatementOptionHelp":{"#cdata":"Arranges the bars in ascending order of the value of the bar statistic."},"StatementOptionType":"S"},{"StatementOptionName":"AUTOREF","StatementOptionHelp":{"#cdata":"Draws a reference line at each major tick mark on the bar (left) response axis."},"StatementOptionType":"S"},{"StatementOptionName":"AXIS=","StatementOptionHelp":{"#cdata":"[Syntax: AXIS=AXIS<1...99>] \n          \nSpecifies values for the major tick mark divisions on the response axis or assigns the \nspecified AXIS definition to the axis."},"StatementOptionType":"V"},{"StatementOptionName":"CAUTOREF=","StatementOptionHelp":{"#cdata":"[Syntax: CAUTOREF=reference-line-color] \n          \nSpecifies the color of reference lines drawn at major tick marks, as determined by the \nAUTOREF option."},"StatementOptionType":"C"},{"StatementOptionName":"CAXIS=|CA=|CAXES=","StatementOptionHelp":{"#cdata":"[Syntax: CAXIS=axis-color] \n          \nSpecifies a color for the response and midpoint axis lines and for the default axis area frame."},"StatementOptionType":"C"},{"StatementOptionName":"CERROR=","StatementOptionHelp":{"#cdata":"[Syntax: CERROR=error-bar-color] \n          \nSpecifies the color of error bars. The default color is the color of the response axis, \nwhich is controlled by the CAXIS= option."},"StatementOptionType":"C"},{"StatementOptionName":"CFRAME=|CFR=","StatementOptionHelp":{"#cdata":"[Syntax: CFRAME=background-color] \n          \nSpecifies the color with which to fill the axis area in two-dimensional bar charts or in \nthe backplane in three-dimensional bar charts."},"StatementOptionType":"C"},{"StatementOptionName":"CFREQ","StatementOptionHelp":{"#cdata":"Displays the cumulative frequency statistic above vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"CFREQLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: CFREQLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the CFREQ statistic in the table of statistics. \nColumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters."},"StatementOptionType":"V"},{"StatementOptionName":"CLIPREF","StatementOptionHelp":{"#cdata":"Clips the reference lines at the bars. This makes the reference lines appear to be behind the bars."},"StatementOptionType":"S"},{"StatementOptionName":"CLM=","StatementOptionHelp":{"#cdata":"[Syntax: CLM=confidence-level] \n          \nSpecifies the confidence intervals to use when drawing error bars. Values for confidence-level \nmust be greater than or equal to 50 and strictly less than 100. The default is 95."},"StatementOptionType":"V"},{"StatementOptionName":"COUTLINE=|CO=","StatementOptionHelp":{"#cdata":"[Syntax: COUTLINE=bar-outline-color | SAME] \n          \nOutlines all bars or bar segments and legend values in the subgroup legend (if it appears) \nusing the specified color. SAME specifies that the outline color of a bar or a bar segment \nor a legend value is the same as the interior pattern color."},"StatementOptionType":"C"},{"StatementOptionName":"CPERCENT|CPCT","StatementOptionHelp":{"#cdata":"[Displays the cumulative percentage statistic above the vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"CREF=|CR=","StatementOptionHelp":{"#cdata":"[Syntax: CREF=reference-line-color|(reference-line-color)|reference-line-color-list] \n          \nSpecifies colors for reference lines."},"StatementOptionType":"C"},{"StatementOptionName":"CPERCENTLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: CPERCENTLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the CPERCENT statistic in the table of statistics. \nColumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters. To suppress the label, specify CPERCENTLABEL=NONE."},"StatementOptionType":"V"},{"StatementOptionName":"CTEXT=|CT=","StatementOptionHelp":{"#cdata":"[Syntax: CTEXT=text-color] \n          \nSpecifies a color for all text on the axes and legend, including axis labels, tick mark values, \nlegend labels, and legend value descriptions."},"StatementOptionType":"C"},{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Arranges the bars in descending order of the value of the chart statistic."},"StatementOptionType":"S"},{"StatementOptionName":"DESCRIPTION=|DES=","StatementOptionHelp":{"#cdata":"[Syntax: DESCRIPTION='entry-description'] \n          \nSpecifies the description of the catalog entry for the chart. The maximum length for the \nentry-description is 256 characters."},"StatementOptionType":"V"},{"StatementOptionName":"DISCRETE","StatementOptionHelp":{"#cdata":"Treats a numeric chart variable as a discrete variable rather than as a continuous variable."},"StatementOptionType":"S"},{"StatementOptionName":"ERRORBAR=","StatementOptionHelp":{"#cdata":"Draws confidence intervals for either of the following:\n\no the mean of the SUMVAR= variable for each midpoint if you specify TYPE=MEAN\n\no the percentage of observations assigned to each midpoint if you specify TYPE=PCT with no SUMVAR= option."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BARS","@Value2":"BOTH","@Value3":"TOP"},"StatementOptionToolTips":{"@ToolTip1":"Draws error bars as bars half the width of the main bars.","@ToolTip2":"Draws error bars as two ticks joined by a line (default).","@ToolTip3":"Draws the error bar as a tick for the upper confidence limit that is joined to the top of  the bar by a line."}},{"StatementOptionName":"FRAME|FR","StatementOptionHelp":{"#cdata":"Specifies that the two-dimensional axis area frame or the three-dimensional backplane is drawn."},"StatementOptionType":"S"},{"StatementOptionName":"NOFRAME|NOFR","StatementOptionHelp":{"#cdata":"Specifies that two-dimensional axis area frame or the three-dimensional backplane is not drawn."},"StatementOptionType":"S"},{"StatementOptionName":"FREQ","StatementOptionHelp":{"#cdata":"Displays the frequency statistic in the table of statistics and above vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"FREQLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: FREQLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the FREQ statistic in the table of statistics. \ncolumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<'column-label'>","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Replace <'column-label'> with the column label for FREQ statistic in the table of statistics.","@ToolTip2":"Specifies no column label for the FREQ statistic in the table of statistics."}},{"StatementOptionName":"FREQ=","StatementOptionHelp":{"#cdata":"[Syntax: FREQ=numeric-variable] \n          \nSpecifies a variable whose values weight the contribution of each observation in the \ncomputation of the chart statistic."},"StatementOptionType":"NVL"},{"StatementOptionName":"G100","StatementOptionHelp":{"#cdata":"Calculates the percentage and cumulative percentage statistics separately for each group."},"StatementOptionType":"S"},{"StatementOptionName":"GAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: GAXIS=AXIS<1...99>] \n          \nAssigns the specified AXIS definition to the group axis. (A group axis is created when you \nuse the GROUP= option.)"},"StatementOptionType":"V"},{"StatementOptionName":"GROUP=","StatementOptionHelp":{"#cdata":"[Syntax: GROUP=group-variable] \n          \nOrganizes the data according to values of group-variable. Group-variable can be either \ncharacter or numeric and is always treated as a discrete variable."},"StatementOptionType":"VL"},{"StatementOptionName":"GSPACE=","StatementOptionHelp":{"#cdata":"[Syntax: GSPACE=group-spacing] \n          \nSpecifies the amount of extra space between groups of bars. Group-space can be any \nnon-negative number. Units are character cells."},"StatementOptionType":"V"},{"StatementOptionName":"HTML=","StatementOptionHelp":{"#cdata":"[Syntax: HTML=variable] \n          \nIdentifies the variable in the input data set whose values create links in the HTML file \ncreated by the ODS statement."},"StatementOptionType":"V"},{"StatementOptionName":"HTML_LEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: HTML_LEGEND=variable] \n          \nIdentifies the variable in the input data set whose values create links in the HTML file \nthat is created by the ODS statement."},"StatementOptionType":"V"},{"StatementOptionName":"IFRAME=","StatementOptionHelp":{"#cdata":"[Syntax: IFRAME=fileref | 'external-file'] \n          \nSpecifies an image file to use on a 2-D chart's frame area or a 3-D chart's backplane."},"StatementOptionType":"V"},{"StatementOptionName":"IMAGESTYLE=","StatementOptionHelp":{"#cdata":"Specifies whether to use multiple instances of an image to fill the axis frame or backplane (TILE) \nor to stretch a single instance of an image to fill the axis frame or backplane frame (FIT). The \nTILE value is the default."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"TILE","@Value2":"FIT"},"StatementOptionToolTips":{"@ToolTip1":"Specifies to use multiple instances of an image to fill the axis frame or backplane.","@ToolTip2":"Specifies to stretch a single instance of an image to fill the axis frame or backplane frame."}},{"StatementOptionName":"INSIDE=","StatementOptionHelp":{"#cdata":"Displays the values of the specified statistic inside the bars."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FREQ","@Value2":"CFREQ","@Value3":"PERCENT","@Value4":"CPERCENT","@Value5":"SUM","@Value6":"MEAN","@Value7":"SUBPCT"},"StatementOptionToolTips":{"@ToolTip1":"Frequencies","@ToolTip2":"Cumulative frequencies. [Note: Not valid if the bars are subgrouped.]","@ToolTip3":"Percentages","@ToolTip4":"Cumulative percentages. [Note: Not valid if the bars are subgrouped.]","@ToolTip5":"Sums","@ToolTip6":"Means. [Note: Not valid if the bars are subgrouped.]","@ToolTip7":"Subgroup percent contribution"}},{"StatementOptionName":"LAUTOREF=","StatementOptionHelp":{"#cdata":"[Syntax: LAUTOREF=reference-line-type] \n          \nSpecifies the line type for reference lines at major tick marks, as determined by the AUTOREF option."},"StatementOptionType":"V"},{"StatementOptionName":"LEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: LEGEND=LEGEND<1...99>] \n          \nAssigns the specified LEGEND definition to the legend generated by the SUBGROUP= option."},"StatementOptionType":"V"},{"StatementOptionName":"LEVELS=","StatementOptionHelp":{"#cdata":"[Syntax: LEVELS=number-of-midpoints | ALL] \n          \nSpecifies the number of midpoints for the numeric chart variable. The range for each midpoint \nis calculated automatically, using the algorithm in Terrell and Scott (1985).\n\nIf you specify LEVELS=ALL, then all unique midpoint values are graphed. If your data contains \na large number of unique midpoint values (over 200), you can use the XPIXELS and YPIXELS GOPTIONS \nto enable the device driver to render a larger (and more readable) graph.\n\nThe LEVELS= option is ignored if any of the following are true:\n\n  o The chart variable is character type. \n  o The DISCRETE option is used. \n  o The MIDPOINTS= option is used."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<number-of-midpoints>","@Value2":"ALL"},"StatementOptionToolTips":{"@ToolTip1":"Replace <number-of-midpoints> with the desired number of midpoints for the numeric chart variable.","@ToolTip2":"Specifies that all unique midpoint values are graphed. If your data contains a large number  of unique midpoint values (over 200), you can use the XPIXELS and YPIXELS GOPTIONS to enable  the device driver to render a larger (and more readable) graph."}},{"StatementOptionName":"LREF=|LR=","StatementOptionHelp":{"#cdata":"[Syntax: LREF=reference-line-type|( reference-line-type|reference-line-type-list)] \n          \nSpecifies line types for reference lines. Line types are specified as whole numbers from 1 to 46, \nwith 1 representing a solid line and the other values representing dashed lines."},"StatementOptionType":"V"},{"StatementOptionName":"MAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: MAXIS=AXIS<1...99] \n          \nAssigns the specified AXIS definition to the midpoint axis."},"StatementOptionType":"V"},{"StatementOptionName":"MEAN","StatementOptionHelp":{"#cdata":"Displays the mean statistic in the table of statistics and above vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"MEANLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: MEANLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the MEAN statistic in the table of statistics. \ncolumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<'column-label'>","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Replace <'column-label'> with the column label for the MEAN statistic in the table of statistics.","@ToolTip2":"Specifies no column label for the MEAN statistic in the table of statistics."}},{"StatementOptionName":"MIDPOINTS=","StatementOptionHelp":{"#cdata":"[Syntax: MIDPOINTS=value-list | OLD] \n          \nSpecifies the midpoint values for the bars. The way you specify value-list depends on the \ntype of the chart variable.\n          \nFor numeric chart variables, value-list is either an explicit list of values, or a starting \nand an ending value with an interval increment, or a combination of both forms: \n\n     n <...n>\n     \n     n TO n <BY increment>\n     \n     n<...n> TO n <BY increment> <n <...n>>\n \nFor character chart variables, value-list is a list of unique character values enclosed in \nquotation marks and separated by blanks: \n\n    'value-1' <...'value-n'> \n    \nMIDPOINTS=OLD generates default midpoints using the Nelder algorithm."},"StatementOptionType":"V"},{"StatementOptionName":"MIDPOINTS=OLD","StatementOptionHelp":{"#cdata":"Generates default midpoints using the Nelder algorithm. The MIDPOINTS=OLD option is ignored \nunless the chart variable is numeric."},"StatementOptionType":"V"},{"StatementOptionName":"MINOR=","StatementOptionHelp":{"#cdata":"[Syntax: MINOR=number-of-minor-ticks] \n          \nSpecifies the number of minor tick marks between each major tick mark on the bar response axis."},"StatementOptionType":"V"},{"StatementOptionName":"MISSING","StatementOptionHelp":{"#cdata":"Accepts a missing value as a valid midpoint for the chart variable. By default, observations \nwith missing values are ignored."},"StatementOptionType":"S"},{"StatementOptionName":"NAME=","StatementOptionHelp":{"#cdata":"[Syntax: NAME='entry-name'] \n          \nSpecifies the name of the GRSEG catalog entry and the name of the graphics output file, \nif one is created."},"StatementOptionType":"V"},{"StatementOptionName":"NOAXIS","StatementOptionHelp":{"#cdata":"Suppresses all axes, including axis lines, axis labels, axis values, and all major and \nminor tick marks."},"StatementOptionType":"S"},{"StatementOptionName":"NOBASEREF","StatementOptionHelp":{"#cdata":"Suppresses the zero reference line when the SUM or MEAN bar statistic has negative values."},"StatementOptionType":"S"},{"StatementOptionName":"NOLEGEND","StatementOptionHelp":{"#cdata":"Suppresses the legend that is automatically generated by the SUBGROUP= option."},"StatementOptionType":"S"},{"StatementOptionName":"NOPLANE","StatementOptionHelp":{"#cdata":"Removes either the horizontal or vertical three-dimensional axis plane in bar charts produced \nby the HBAR3D and VBAR3D statements."},"StatementOptionType":"S"},{"StatementOptionName":"NOSTATS","StatementOptionHelp":{"#cdata":"Suppresses the table of statistics. The NOSTATS option suppresses both the default statistics and \nspecific statistics requested by the FREQ, CFREQ, PERCENT, CPERCENT, SUM, and MEAN options."},"StatementOptionType":"S"},{"StatementOptionName":"NOZERO","StatementOptionHelp":{"#cdata":"Suppresses any midpoints for which there are no corresponding values of the chart variable and, \nhence, no bar."},"StatementOptionType":"S"},{"StatementOptionName":"OUTSIDE=","StatementOptionHelp":{"#cdata":"Displays the values of the specified statistic above the bars."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FREQ","@Value2":"CFREQ","@Value3":"PERCENT","@Value4":"CPERCENT","@Value5":"SUM","@Value6":"MEAN"},"StatementOptionToolTips":{"@ToolTip1":"Frequencies","@ToolTip2":"Cumulative frequencies","@ToolTip3":"Percentages","@ToolTip4":"Cumulative percentages","@ToolTip5":"Sums","@ToolTip6":"Means"}},{"StatementOptionName":"PATTERNID=|PATTID=","StatementOptionHelp":{"#cdata":"Specifies the way fill patterns are assigned."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BY","@Value2":"MIDPOINT","@Value3":"SUBGROUP"},"StatementOptionToolTips":{"@ToolTip1":"Changes patterns each time the value of the BY variable changes. All bars use the same pattern if the GBARLINE procedure does not include a BY statement.","@ToolTip2":"Changes patterns every time the midpoint value changes.","@ToolTip3":"Changes patterns every time the value of the subgroup variable changes."}},{"StatementOptionName":"PERCENT|PCT","StatementOptionHelp":{"#cdata":"Prints the percentages of observations having a given value for the chart variable in the table \nof statistics and above vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"PERCENTSUM|PCTSUM","StatementOptionHelp":{"#cdata":"calculates a percent of the sum variable for horizontal bar charts."},"StatementOptionType":"S"},{"StatementOptionName":"PERCENTLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: PERCENTLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the PERCENT statistic in the table of statistics. \ncolumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<'column-label'>","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Replace <'column-label'> with the column label for the PERCENT statistic in the table of statistics.","@ToolTip2":"Specifies no column label for the PERCENT statistic in the table of statistics."}},{"StatementOptionName":"RANGE","StatementOptionHelp":{"#cdata":"Displays on the axis of the chart the range of numeric values represented by each bar."},"StatementOptionType":"S"},{"StatementOptionName":"RAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: RAXIS=value-list | AXIS<1...99>] \n          \nSpecifies values for the major tick mark divisions on the response axis or assigns the \nspecified AXIS definition to the axis."},"StatementOptionType":"V"},{"StatementOptionName":"REF=|HREF=|VREF=","StatementOptionHelp":{"#cdata":"[Syntax: REF=value-list] \n          \nDraws reference lines at the specified points on the chart response axis."},"StatementOptionType":"V"},{"StatementOptionName":"SPACE=","StatementOptionHelp":{"#cdata":"[Syntax: SPACE=bar-spacing] \n          \nSpecifies the amount of space between individual bars or between the bars within each group \nif you also use the GROUP= option."},"StatementOptionType":"V"},{"StatementOptionName":"SUBGROUP=","StatementOptionHelp":{"#cdata":"[Syntax: SUBGROUP=subgroup-variable] \n          \nDivides the bars into segments according to the values of subgroup-variable. Subgroup-variable \ncan be either character or numeric and is always treated as a discrete variable."},"StatementOptionType":"VL"},{"StatementOptionName":"SUM","StatementOptionHelp":{"#cdata":"Displays the sum statistic in the table of statistics and above vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"SUMLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: SUMLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the SUM statistic in the table of statistics. \ncolumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<'column-label'>","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Replace <'column-label'> with the column label for the SUM statistic in the table of statistics.","@ToolTip2":"Specifies no column label for the SUM statistic in the table of statistics."}},{"StatementOptionName":"SUMVAR=","StatementOptionHelp":{"#cdata":"[Syntax: SUMVAR=summary-variable] \n          \nSpecifies a numeric variable for sum or mean calculations."},"StatementOptionType":"VL"},{"StatementOptionName":"TYPE=","StatementOptionHelp":{"#cdata":"Specifies the chart statistic."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FREQ","@Value2":"CFREQ","@Value3":"PERCENT","@Value4":"CPERCENT","@Value5":"SUM","@Value6":"MEAN"},"StatementOptionToolTips":{"@ToolTip1":"[Valid if the SUMVAR= option is not used]--Frequency","@ToolTip2":"[Valid if the SUMVAR= option is not used]--Cumulative frequency","@ToolTip3":"[Valid if the SUMVAR= option is not used]--Percentage","@ToolTip4":"[Valid if the SUMVAR= option is not used]--Cumulative percentage","@ToolTip5":"[Valid if the SUMVAR= option is used]--Sum","@ToolTip6":"[Valid if the SUMVAR= option is used]--Mean"}},{"StatementOptionName":"URL=","StatementOptionHelp":{"#cdata":"[URL=character-variable \n          \nSpecifies a character variable whose values are URLs. The variable values are URLs for \nWeb pages to display when the user clicks (drills down) on elements in the graph. \n\nRestrictions: This option affects graphics output that is created through the ODS HTML \ndestination only. Not supported by GIF, PNG, and ACTIVEX devices.\n\nInteraction: If you specify both the HTML= and the URL= options, then the URL= option \nis ignored."},"StatementOptionType":"V"},{"StatementOptionName":"WAUTOREF=","StatementOptionHelp":{"#cdata":"[Syntax: WAUTOREF=reference-line-width] \n          \nSpecifies the line width for reference lines at major tick marks, as determined by \nthe AUTOREF option."},"StatementOptionType":"V"},{"StatementOptionName":"WIDTH=","StatementOptionHelp":{"#cdata":"[Syntax: WIDTH=bar-width] \n          \nSpecifies the width of the bars. By default, the GCHART procedure selects a bar width that \naccommodates the midpoint values displayed on the midpoint axis using a hardware font and a \nheight of one cell. Units for bar-width are character cells. The value for bar-width must be \ngreater than 0, but it does not have to be an integer, for example: \n\n  vbar site / width=1.5;\n  \nIf the requested bar width results in a chart that is too large to fit in the space available \nfor the midpoint axis, then the procedure issues a warning in the log and ignores the WIDTH= \noption. If the specified width is too narrow, the procedure displays the midpoint values \nvertically."},"StatementOptionType":"V"},{"StatementOptionName":"WOUTLINE=","StatementOptionHelp":{"#cdata":"[Syntax: WOUTLINE=bar-outline-width] \n          \nSpecifies the width of the outline in pixels. The WOUTLINE= option affects both the bar \nand the subgroup outlines."},"StatementOptionType":"V"},{"StatementOptionName":"WREF=|WR=","StatementOptionHelp":{"#cdata":"[Syntax: WREF=reference-line-width|( reference-line-width|reference-line-width-list)] \n          \nSpecifies line widths for reference lines. Line widths are specified as whole numbers. \nTo specify colors for these reference lines, use the CREF= option."},"StatementOptionType":"V"}]}},{"StatementName":"VBAR","StatementHelp":{"#cdata":"Syntax: VBAR chart-variable*width-variable SUMVAR=numeric-variable</ option(s)>; \n      \nThe HBAR, HBAR3D, VBAR, and VBAR3D statements specify the variable or variables that define \nthe categories of data to chart. These statements automatically do the following:\n\n  o determine the midpoints \n  o calculate the chart statistic for each midpoint (the default is FREQ) \n  o scale the response axis and the bars according to the statistic value \n  o determine bar width and spacing \n  o assign patterns to the bars; the default bar/block pattern is SOLID \n  o draw a frame around the axis area using a color determined by the current style, or, \n    if the NOGSTYLE option is specified, using the first color in the device's color list\n\nYou can use statement options to select or order the midpoints (bars), to control the tick marks \non the response axis, to change the type of chart statistic, to display specific statistics, and \nto modify the appearance of the chart. You can also specify additional variables by which to group, \nsubgroup, or sum the data."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ANNOTATE=|ANNO=","StatementOptionHelp":{"#cdata":"[Syntax: ANNOTATE=Annotate-data-set] \n          \nSpecifies a data set to annotate charts produced by the BAR statement."},"StatementOptionType":"DV"},{"StatementOptionName":"ASCENDING","StatementOptionHelp":{"#cdata":"Arranges the bars in ascending order of the value of the bar statistic."},"StatementOptionType":"S"},{"StatementOptionName":"AUTOREF","StatementOptionHelp":{"#cdata":"Draws a reference line at each major tick mark on the bar (left) response axis."},"StatementOptionType":"S"},{"StatementOptionName":"AXIS=","StatementOptionHelp":{"#cdata":"[Syntax: AXIS=AXIS<1...99>] \n          \nSpecifies values for the major tick mark divisions on the response axis or assigns the \nspecified AXIS definition to the axis."},"StatementOptionType":"V"},{"StatementOptionName":"CAUTOREF=","StatementOptionHelp":{"#cdata":"[Syntax: CAUTOREF=reference-line-color] \n          \nSpecifies the color of reference lines drawn at major tick marks, as determined by the \nAUTOREF option."},"StatementOptionType":"C"},{"StatementOptionName":"CAXIS=|CA=|CAXES=","StatementOptionHelp":{"#cdata":"[Syntax: CAXIS=axis-color] \n          \nSpecifies a color for the response and midpoint axis lines and for the default \naxis area frame."},"StatementOptionType":"C"},{"StatementOptionName":"CERROR=","StatementOptionHelp":{"#cdata":"[Syntax: CERROR=error-bar-color] \n          \nSpecifies the color of error bars. The default color is the color of the response axis, \nwhich is controlled by the CAXIS= option."},"StatementOptionType":"C"},{"StatementOptionName":"CFRAME=|CFR=","StatementOptionHelp":{"#cdata":"[Syntax: CFRAME=background-color] \n          \nSpecifies the color with which to fill the axis area in two-dimensional bar charts or in \nthe backplane in three-dimensional bar charts."},"StatementOptionType":"C"},{"StatementOptionName":"CFREQ","StatementOptionHelp":{"#cdata":"Displays the cumulative frequency statistic above vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"CFREQLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: CFREQLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the CFREQ statistic in the table of statistics. \nColumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters."},"StatementOptionType":"V"},{"StatementOptionName":"CLIPREF","StatementOptionHelp":{"#cdata":"Clips the reference lines at the bars. This makes the reference lines appear to \nbe behind the bars."},"StatementOptionType":"S"},{"StatementOptionName":"CLM=","StatementOptionHelp":{"#cdata":"[Syntax: CLM=confidence-level] \n          \nSpecifies the confidence intervals to use when drawing error bars. Values for confidence-level \nmust be greater than or equal to 50 and strictly less than 100. The default is 95."},"StatementOptionType":"V"},{"StatementOptionName":"COUTLINE=|CO=","StatementOptionHelp":{"#cdata":"[Syntax: COUTLINE=bar-outline-color | SAME] \n          \nOutlines all bars or bar segments and legend values in the subgroup legend (if it appears) \nusing the specified color. SAME specifies that the outline color of a bar or a bar segment \nor a legend value is the same as the interior pattern color."},"StatementOptionType":"C"},{"StatementOptionName":"CPERCENT|CPCT","StatementOptionHelp":{"#cdata":"Displays the cumulative percentage statistic above the vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"CREF=|CR=","StatementOptionHelp":{"#cdata":"[Syntax: CREF=reference-line-color|(reference-line-color)|reference-line-color-list] \n          \nSpecifies colors for reference lines."},"StatementOptionType":"C"},{"StatementOptionName":"CPERCENTLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: CPERCENTLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the CPERCENT statistic in the table of statistics. \nColumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters. To suppress the label, specify CPERCENTLABEL=NONE."},"StatementOptionType":"V"},{"StatementOptionName":"CTEXT=|CT=","StatementOptionHelp":{"#cdata":"[Syntax: CTEXT=text-color] \n          \nSpecifies a color for all text on the axes and legend, including axis labels, tick mark values, \nlegend labels, and legend value descriptions."},"StatementOptionType":"C"},{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Arranges the bars in descending order of the value of the chart statistic."},"StatementOptionType":"S"},{"StatementOptionName":"DESCRIPTION=|DES=","StatementOptionHelp":{"#cdata":"[Syntax: DESCRIPTION='entry-description'] \n          \nSpecifies the description of the catalog entry for the chart. The maximum length for the \nentry-description is 256 characters."},"StatementOptionType":"V"},{"StatementOptionName":"DISCRETE","StatementOptionHelp":{"#cdata":"Treats a numeric chart variable as a discrete variable rather than as a continuous variable."},"StatementOptionType":"S"},{"StatementOptionName":"ERRORBAR=","StatementOptionHelp":{"#cdata":"Draws confidence intervals for either of the following:\n\no the mean of the SUMVAR= variable for each midpoint if you specify TYPE=MEAN\n\no the percentage of observations assigned to each midpoint if you specify TYPE=PCT with no SUMVAR= option."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BARS","@Value2":"BOTH","@Value3":"TOP"},"StatementOptionToolTips":{"@ToolTip1":"Draws error bars as bars half the width of the main bars.","@ToolTip2":"Draws error bars as two ticks joined by a line (default).","@ToolTip3":"Draws the error bar as a tick for the upper confidence limit that is joined to  the top of the bar by a line."}},{"StatementOptionName":"FRAME|FR","StatementOptionHelp":{"#cdata":"Specifies that the two-dimensional axis area frame or the three-dimensional backplane is drawn."},"StatementOptionType":"S"},{"StatementOptionName":"NOFRAME|NOFR","StatementOptionHelp":{"#cdata":"Specifies that two-dimensional axis area frame or the three-dimensional backplane is not drawn."},"StatementOptionType":"S"},{"StatementOptionName":"FREQ","StatementOptionHelp":{"#cdata":"Displays the frequency statistic in the table of statistics and above vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"FREQLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: FREQLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the FREQ statistic in the table of statistics. \ncolumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<'column-label'>","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Replace <'column-label'> with the column label for FREQ statistic in the table of statistics.","@ToolTip2":"Specifies no column label for the FREQ statistic in the table of statistics."}},{"StatementOptionName":"FREQ=","StatementOptionHelp":{"#cdata":"[Syntax: FREQ=numeric-variable] \n          \nSpecifies a variable whose values weight the contribution of each observation in the \ncomputation of the chart statistic."},"StatementOptionType":"NVL"},{"StatementOptionName":"G100","StatementOptionHelp":{"#cdata":"Calculates the percentage and cumulative percentage statistics separately for each group."},"StatementOptionType":"S"},{"StatementOptionName":"GAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: GAXIS=AXIS<1...99>] \n          \nAssigns the specified AXIS definition to the group axis. (A group axis is created when you \nuse the GROUP= option.)"},"StatementOptionType":"V"},{"StatementOptionName":"GROUP=","StatementOptionHelp":{"#cdata":"[Syntax: GROUP=group-variable] \n          \nOrganizes the data according to values of group-variable. Group-variable can be either \ncharacter or numeric and is always treated as a discrete variable."},"StatementOptionType":"VL"},{"StatementOptionName":"GSPACE=","StatementOptionHelp":{"#cdata":"[Syntax: GSPACE=group-spacing] \n          \nSpecifies the amount of extra space between groups of bars. Group-space can be any \nnon-negative number. Units are character cells."},"StatementOptionType":"V"},{"StatementOptionName":"HTML=","StatementOptionHelp":{"#cdata":"[Syntax: HTML=variable] \n          \nIdentifies the variable in the input data set whose values create links in the HTML file \ncreated by the ODS statement."},"StatementOptionType":"V"},{"StatementOptionName":"HTML_LEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: HTML_LEGEND=variable] \n          \nIdentifies the variable in the input data set whose values create links in the HTML file \nthat is created by the ODS statement."},"StatementOptionType":"V"},{"StatementOptionName":"IFRAME=","StatementOptionHelp":{"#cdata":"[Syntax: IFRAME=fileref | 'external-file'] \n          \nSpecifies an image file to use on a 2-D chart's frame area or a 3-D chart's backplane."},"StatementOptionType":"V"},{"StatementOptionName":"IMAGESTYLE=","StatementOptionHelp":{"#cdata":"Specifies whether to use multiple instances of an image to fill the axis frame or backplane (TILE) \nor to stretch a single instance of an image to fill the axis frame or backplane frame (FIT). The \nTILE value is the default."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"TILE","@Value2":"FIT"},"StatementOptionToolTips":{"@ToolTip1":"Specifies to use multiple instances of an image to fill the axis frame or backplane.","@ToolTip2":"Specifies to stretch a single instance of an image to fill the axis frame or backplane frame."}},{"StatementOptionName":"INSIDE=","StatementOptionHelp":{"#cdata":"Displays the values of the specified statistic inside the bars."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FREQ","@Value2":"CFREQ","@Value3":"PERCENT","@Value4":"CPERCENT","@Value5":"SUM","@Value6":"MEAN","@Value7":"SUBPCT"},"StatementOptionToolTips":{"@ToolTip1":"Frequencies","@ToolTip2":"Cumulative frequencies. [Note: Not valid if the bars are subgrouped.]","@ToolTip3":"Percentages","@ToolTip4":"Cumulative percentages. [Note: Not valid if the bars are subgrouped.]","@ToolTip5":"Sums","@ToolTip6":"Means. [Note: Not valid if the bars are subgrouped.]","@ToolTip7":"Subgroup percent contribution"}},{"StatementOptionName":"LAUTOREF=","StatementOptionHelp":{"#cdata":"[Syntax: LAUTOREF=reference-line-type] \n          \nSpecifies the line type for reference lines at major tick marks, as determined by the AUTOREF option."},"StatementOptionType":"V"},{"StatementOptionName":"LEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: LEGEND=LEGEND<1...99>] \n          \nAssigns the specified LEGEND definition to the legend generated by the SUBGROUP= option."},"StatementOptionType":"V"},{"StatementOptionName":"LEVELS=","StatementOptionHelp":{"#cdata":"[Syntax: LEVELS=number-of-midpoints | ALL] \n          \nSpecifies the number of midpoints for the numeric chart variable. The range for each midpoint \nis calculated automatically, using the algorithm in Terrell and Scott (1985).\n\nIf you specify LEVELS=ALL, then all unique midpoint values are graphed. If your data contains \na large number of unique midpoint values (over 200), you can use the XPIXELS and YPIXELS GOPTIONS \nto enable the device driver to render a larger (and more readable) graph.\n\nThe LEVELS= option is ignored if any of the following are true:\n\n  o The chart variable is character type. \n  o The DISCRETE option is used. \n  o The MIDPOINTS= option is used."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<number-of-midpoints>","@Value2":"ALL"},"StatementOptionToolTips":{"@ToolTip1":"Replace <number-of-midpoints> with the desired number of midpoints for the numeric chart variable.","@ToolTip2":"Specifies that all unique midpoint values are graphed. If your data contains a large number  of unique midpoint values (over 200), you can use the XPIXELS and YPIXELS GOPTIONS to enable  the device driver to render a larger (and more readable) graph."}},{"StatementOptionName":"LREF=|LR=","StatementOptionHelp":{"#cdata":"[Syntax: LREF=reference-line-type|( reference-line-type|reference-line-type-list)] \n          \nSpecifies line types for reference lines. Line types are specified as whole numbers from 1 to 46, \nwith 1 representing a solid line and the other values representing dashed lines."},"StatementOptionType":"V"},{"StatementOptionName":"MAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: MAXIS=AXIS<1...99] \n          \nAssigns the specified AXIS definition to the midpoint axis."},"StatementOptionType":"V"},{"StatementOptionName":"MEAN","StatementOptionHelp":{"#cdata":"Displays the mean statistic in the table of statistics and above vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"MEANLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: MEANLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the MEAN statistic in the table of statistics. \ncolumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<'column-label'>","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Replace <'column-label'> with the column label for the MEAN statistic in the table of statistics.","@ToolTip2":"Specifies no column label for the MEAN statistic in the table of statistics."}},{"StatementOptionName":"MIDPOINTS=","StatementOptionHelp":{"#cdata":"[Syntax: MIDPOINTS=value-list | OLD] \n          \nSpecifies the midpoint values for the bars. The way you specify value-list depends on the \ntype of the chart variable.\n          \nFor numeric chart variables, value-list is either an explicit list of values, or a starting \nand an ending value with an interval increment, or a combination of both forms: \n\n     n <...n>\n     \n     n TO n <BY increment>\n     \n     n<...n> TO n <BY increment> <n <...n>>\n \nFor character chart variables, value-list is a list of unique character values enclosed in \nquotation marks and separated by blanks: \n\n    'value-1' <...'value-n'> \n    \nMIDPOINTS=OLD generates default midpoints using the Nelder algorithm."},"StatementOptionType":"V"},{"StatementOptionName":"MIDPOINTS=OLD","StatementOptionHelp":{"#cdata":"Generates default midpoints using the Nelder algorithm. The MIDPOINTS=OLD option \nis ignored unless the chart variable is numeric."},"StatementOptionType":"V"},{"StatementOptionName":"MINOR=","StatementOptionHelp":{"#cdata":"[Syntax: MINOR=number-of-minor-ticks] \n          \nSpecifies the number of minor tick marks between each major tick mark on the bar \nresponse axis."},"StatementOptionType":"V"},{"StatementOptionName":"MISSING","StatementOptionHelp":{"#cdata":"Accepts a missing value as a valid midpoint for the chart variable. By default, \nobservations with missing values are ignored."},"StatementOptionType":"S"},{"StatementOptionName":"NAME=","StatementOptionHelp":{"#cdata":"[Syntax: NAME='entry-name'] \n          \nSpecifies the name of the GRSEG catalog entry and the name of the graphics output file, \nif one is created."},"StatementOptionType":"V"},{"StatementOptionName":"NOAXIS","StatementOptionHelp":{"#cdata":"Suppresses all axes, including axis lines, axis labels, axis values, and all major and \nminor tick marks."},"StatementOptionType":"S"},{"StatementOptionName":"NOBASEREF","StatementOptionHelp":{"#cdata":"Suppresses the zero reference line when the SUM or MEAN bar statistic has negative values."},"StatementOptionType":"S"},{"StatementOptionName":"NOLEGEND","StatementOptionHelp":{"#cdata":"Suppresses the legend that is automatically generated by the SUBGROUP= option."},"StatementOptionType":"S"},{"StatementOptionName":"NOPLANE","StatementOptionHelp":{"#cdata":"Removes either the horizontal or vertical three-dimensional axis plane in bar charts produced \nby the HBAR3D and VBAR3D statements."},"StatementOptionType":"S"},{"StatementOptionName":"NOSTATS","StatementOptionHelp":{"#cdata":"Suppresses the table of statistics. The NOSTATS option suppresses both the default statistics and \nspecific statistics requested by the FREQ, CFREQ, PERCENT, CPERCENT, SUM, and MEAN options."},"StatementOptionType":"S"},{"StatementOptionName":"NOZERO","StatementOptionHelp":{"#cdata":"Suppresses any midpoints for which there are no corresponding values of the chart variable and, \nhence, no bar."},"StatementOptionType":"S"},{"StatementOptionName":"OUTSIDE=","StatementOptionHelp":{"#cdata":"Displays the values of the specified statistic above the bars."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FREQ","@Value2":"CFREQ","@Value3":"PERCENT","@Value4":"CPERCENT","@Value5":"SUM","@Value6":"MEAN"},"StatementOptionToolTips":{"@ToolTip1":"Frequencies","@ToolTip2":"Cumulative frequencies","@ToolTip3":"Percentages","@ToolTip4":"Cumulative percentages","@ToolTip5":"Sums","@ToolTip6":"Means"}},{"StatementOptionName":"PATTERNID=|PATTID=","StatementOptionHelp":{"#cdata":"Specifies the way fill patterns are assigned."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BY","@Value2":"MIDPOINT","@Value3":"SUBGROUP"},"StatementOptionToolTips":{"@ToolTip1":"Changes patterns each time the value of the BY variable changes. All bars use the same pattern if the GBARLINE procedure does not include a BY statement.","@ToolTip2":"Changes patterns every time the midpoint value changes.","@ToolTip3":"Changes patterns every time the value of the subgroup variable changes."}},{"StatementOptionName":"PERCENT|PCT","StatementOptionHelp":{"#cdata":"Prints the percentages of observations having a given value for the chart variable in the table \nof statistics and above vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"PERCENTSUM|PCTSUM","StatementOptionHelp":{"#cdata":"calculates a percent of the sum variable for horizontal bar charts."},"StatementOptionType":"S"},{"StatementOptionName":"PERCENTLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: PERCENTLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the PERCENT statistic in the table of statistics. \ncolumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<'column-label'>","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Replace <'column-label'> with the column label for the PERCENT statistic in the table of statistics.","@ToolTip2":"Specifies no column label for the PERCENT statistic in the table of statistics."}},{"StatementOptionName":"RANGE","StatementOptionHelp":{"#cdata":"Displays on the axis of the chart the range of numeric values represented by each bar."},"StatementOptionType":"S"},{"StatementOptionName":"RAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: RAXIS=value-list | AXIS<1...99>] \n          \nSpecifies values for the major tick mark divisions on the response axis or assigns the \nspecified AXIS definition to the axis."},"StatementOptionType":"V"},{"StatementOptionName":"REF=|HREF=|VREF=","StatementOptionHelp":{"#cdata":"[Syntax: REF=value-list] \n          \nDraws reference lines at the specified points on the chart response axis."},"StatementOptionType":"V"},{"StatementOptionName":"SPACE=","StatementOptionHelp":{"#cdata":"[Syntax: SPACE=bar-spacing] \n          \nSpecifies the amount of space between individual bars or between the bars within each group \nif you also use the GROUP= option."},"StatementOptionType":"V"},{"StatementOptionName":"SUBGROUP=","StatementOptionHelp":{"#cdata":"[Syntax: SUBGROUP=subgroup-variable] \n          \nDivides the bars into segments according to the values of subgroup-variable. Subgroup-variable \ncan be either character or numeric and is always treated as a discrete variable."},"StatementOptionType":"VL"},{"StatementOptionName":"SUM","StatementOptionHelp":{"#cdata":"Displays the sum statistic in the table of statistics and above vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"SUMLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: SUMLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the SUM statistic in the table of statistics. \ncolumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<'column-label'>","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Replace <'column-label'> with the column label for the SUM statistic in the table of statistics.","@ToolTip2":"Specifies no column label for the SUM statistic in the table of statistics."}},{"StatementOptionName":"SUMVAR=","StatementOptionHelp":{"#cdata":"[Syntax: SUMVAR=summary-variable] \n          \nSpecifies a numeric variable for sum or mean calculations."},"StatementOptionType":"VL"},{"StatementOptionName":"TYPE=","StatementOptionHelp":{"#cdata":"Specifies the chart statistic."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FREQ","@Value2":"CFREQ","@Value3":"PERCENT","@Value4":"CPERCENT","@Value5":"SUM","@Value6":"MEAN"},"StatementOptionToolTips":{"@ToolTip1":"[Valid if the SUMVAR= option is not used]--Frequency","@ToolTip2":"[Valid if the SUMVAR= option is not used]--Cumulative frequency","@ToolTip3":"[Valid if the SUMVAR= option is not used]--Percentage","@ToolTip4":"[Valid if the SUMVAR= option is not used]--Cumulative percentage","@ToolTip5":"[Valid if the SUMVAR= option is used]--Sum","@ToolTip6":"[Valid if the SUMVAR= option is used]--Mean"}},{"StatementOptionName":"URL=","StatementOptionHelp":{"#cdata":"[URL=character-variable \n          \nSpecifies a character variable whose values are URLs. The variable values are URLs for \nWeb pages to display when the user clicks (drills down) on elements in the graph. \n\nRestrictions: This option affects graphics output that is created through the ODS HTML \ndestination only. Not supported by GIF, PNG, and ACTIVEX devices.\n\nInteraction: If you specify both the HTML= and the URL= options, then the URL= option \nis ignored."},"StatementOptionType":"V"},{"StatementOptionName":"WAUTOREF=","StatementOptionHelp":{"#cdata":"[Syntax: WAUTOREF=reference-line-width] \n          \nSpecifies the line width for reference lines at major tick marks, as determined by the AUTOREF option."},"StatementOptionType":"V"},{"StatementOptionName":"WIDTH=","StatementOptionHelp":{"#cdata":"[Syntax: WIDTH=bar-width] \n          \nSpecifies the width of the bars. By default, the GCHART procedure selects a bar width that \naccommodates the midpoint values displayed on the midpoint axis using a hardware font and a \nheight of one cell. Units for bar-width are character cells. The value for bar-width must be \ngreater than 0, but it does not have to be an integer, for example: \n\n  vbar site / width=1.5;\n  \nIf the requested bar width results in a chart that is too large to fit in the space available \nfor the midpoint axis, then the procedure issues a warning in the log and ignores the WIDTH= \noption. If the specified width is too narrow, the procedure displays the midpoint values vertically."},"StatementOptionType":"V"},{"StatementOptionName":"WOUTLINE=","StatementOptionHelp":{"#cdata":"[Syntax: WOUTLINE=bar-outline-width] \n          \nSpecifies the width of the outline in pixels. The WOUTLINE= option affects both the bar \nand the subgroup outlines."},"StatementOptionType":"V"},{"StatementOptionName":"WREF=|WR=","StatementOptionHelp":{"#cdata":"[Syntax: WREF=reference-line-width|( reference-line-width|reference-line-width-list)] \n          \nSpecifies line widths for reference lines. Line widths are specified as whole numbers. \nTo specify colors for these reference lines, use the CREF= option."},"StatementOptionType":"V"}]}},{"StatementName":"VBAR3D","StatementHelp":{"#cdata":"Syntax: VBAR3D chart-variable*width-variable SUMVAR=numeric-variable</ option(s)>; \n      \nThe HBAR, HBAR3D, VBAR, and VBAR3D statements specify the variable or variables that define \nthe categories of data to chart. These statements automatically do the following:\n\n  o determine the midpoints \n  o calculate the chart statistic for each midpoint (the default is FREQ) \n  o scale the response axis and the bars according to the statistic value \n  o determine bar width and spacing \n  o assign patterns to the bars; the default bar/block pattern is SOLID \n  o draw a frame around the axis area using a color determined by the current style, or, \n    if the NOGSTYLE option is specified, using the first color in the device's color list\n\nYou can use statement options to select or order the midpoints (bars), to control the tick marks \non the response axis, to change the type of chart statistic, to display specific statistics, and \nto modify the appearance of the chart. You can also specify additional variables by which to group, \nsubgroup, or sum the data."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ANNOTATE=|ANNO=","StatementOptionHelp":{"#cdata":"[Syntax: ANNOTATE=Annotate-data-set] \n          \nSpecifies a data set to annotate charts produced by the BAR statement."},"StatementOptionType":"DV"},{"StatementOptionName":"ASCENDING","StatementOptionHelp":{"#cdata":"Arranges the bars in ascending order of the value of the bar statistic."},"StatementOptionType":"S"},{"StatementOptionName":"AUTOREF","StatementOptionHelp":{"#cdata":"Draws a reference line at each major tick mark on the bar (left) response axis."},"StatementOptionType":"S"},{"StatementOptionName":"AXIS=","StatementOptionHelp":{"#cdata":"[Syntax: AXIS=AXIS<1...99>] \n          \nSpecifies values for the major tick mark divisions on the response axis or assigns the \nspecified AXIS definition to the axis."},"StatementOptionType":"V"},{"StatementOptionName":"CAUTOREF=","StatementOptionHelp":{"#cdata":"[Syntax: CAUTOREF=reference-line-color] \n          \nSpecifies the color of reference lines drawn at major tick marks, as determined by the \nAUTOREF option."},"StatementOptionType":"C"},{"StatementOptionName":"CAXIS=|CA=|CAXES=","StatementOptionHelp":{"#cdata":"[Syntax: CAXIS=axis-color] \n          \nSpecifies a color for the response and midpoint axis lines and for the default axis area frame."},"StatementOptionType":"C"},{"StatementOptionName":"CERROR=","StatementOptionHelp":{"#cdata":"[Syntax: CERROR=error-bar-color] \n          \nSpecifies the color of error bars. The default color is the color of the response axis, \nwhich is controlled by the CAXIS= option."},"StatementOptionType":"C"},{"StatementOptionName":"CFRAME=|CFR=","StatementOptionHelp":{"#cdata":"[Syntax: CFRAME=background-color] \n          \nSpecifies the color with which to fill the axis area in two-dimensional bar charts or in \nthe backplane in three-dimensional bar charts."},"StatementOptionType":"C"},{"StatementOptionName":"CFREQ","StatementOptionHelp":{"#cdata":"Displays the cumulative frequency statistic above vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"CFREQLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: CFREQLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the CFREQ statistic in the table of statistics. \nColumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters."},"StatementOptionType":"V"},{"StatementOptionName":"CLIPREF","StatementOptionHelp":{"#cdata":"Clips the reference lines at the bars. This makes the reference lines appear to be \nbehind the bars."},"StatementOptionType":"S"},{"StatementOptionName":"CLM=","StatementOptionHelp":{"#cdata":"[Syntax: CLM=confidence-level] \n          \nSpecifies the confidence intervals to use when drawing error bars. Values for confidence-level \nmust be greater than or equal to 50 and strictly less than 100. The default is 95."},"StatementOptionType":"V"},{"StatementOptionName":"COUTLINE=|CO=","StatementOptionHelp":{"#cdata":"[Syntax: COUTLINE=bar-outline-color | SAME] \n          \nOutlines all bars or bar segments and legend values in the subgroup legend (if it appears) \nusing the specified color. SAME specifies that the outline color of a bar or a bar segment \nor a legend value is the same as the interior pattern color."},"StatementOptionType":"C"},{"StatementOptionName":"CPERCENT|CPCT","StatementOptionHelp":{"#cdata":"[Displays the cumulative percentage statistic above the vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"CREF=|CR=","StatementOptionHelp":{"#cdata":"[Syntax: CREF=reference-line-color|(reference-line-color)|reference-line-color-list] \n          \nSpecifies colors for reference lines."},"StatementOptionType":"C"},{"StatementOptionName":"CPERCENTLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: CPERCENTLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the CPERCENT statistic in the table of statistics. \nColumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters. To suppress the label, specify CPERCENTLABEL=NONE."},"StatementOptionType":"V"},{"StatementOptionName":"CTEXT=|CT=","StatementOptionHelp":{"#cdata":"[Syntax: CTEXT=text-color] \n          \nSpecifies a color for all text on the axes and legend, including axis labels, tick mark values, \nlegend labels, and legend value descriptions."},"StatementOptionType":"C"},{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Arranges the bars in descending order of the value of the chart statistic."},"StatementOptionType":"S"},{"StatementOptionName":"DESCRIPTION=|DES=","StatementOptionHelp":{"#cdata":"[Syntax: DESCRIPTION='entry-description'] \n          \nSpecifies the description of the catalog entry for the chart. The maximum length for the \nentry-description is 256 characters."},"StatementOptionType":"V"},{"StatementOptionName":"DISCRETE","StatementOptionHelp":{"#cdata":"Treats a numeric chart variable as a discrete variable rather than as a continuous variable."},"StatementOptionType":"S"},{"StatementOptionName":"ERRORBAR=","StatementOptionHelp":{"#cdata":"Draws confidence intervals for either of the following:\n\no the mean of the SUMVAR= variable for each midpoint if you specify TYPE=MEAN\n\no the percentage of observations assigned to each midpoint if you specify TYPE=PCT with no SUMVAR= option."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BARS","@Value2":"BOTH","@Value3":"TOP"},"StatementOptionToolTips":{"@ToolTip1":"Draws error bars as bars half the width of the main bars.","@ToolTip2":"Draws error bars as two ticks joined by a line (default).","@ToolTip3":"Draws the error bar as a tick for the upper confidence limit that is joined to the top of  the bar by a line."}},{"StatementOptionName":"FRAME|FR","StatementOptionHelp":{"#cdata":"Specifies that the two-dimensional axis area frame or the three-dimensional backplane is drawn."},"StatementOptionType":"S"},{"StatementOptionName":"NOFRAME|NOFR","StatementOptionHelp":{"#cdata":"Specifies that two-dimensional axis area frame or the three-dimensional backplane is not drawn."},"StatementOptionType":"S"},{"StatementOptionName":"FREQ","StatementOptionHelp":{"#cdata":"Displays the frequency statistic in the table of statistics and above vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"FREQLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: FREQLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the FREQ statistic in the table of statistics. \ncolumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<'column-label'>","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Replace <'column-label'> with the column label for FREQ statistic in the  table of statistics.","@ToolTip2":"Specifies no column label for the FREQ statistic in the table of statistics."}},{"StatementOptionName":"FREQ=","StatementOptionHelp":{"#cdata":"[Syntax: FREQ=numeric-variable] \n          \nSpecifies a variable whose values weight the contribution of each observation in the \ncomputation of the chart statistic."},"StatementOptionType":"NVL"},{"StatementOptionName":"G100","StatementOptionHelp":{"#cdata":"Calculates the percentage and cumulative percentage statistics separately for each group."},"StatementOptionType":"S"},{"StatementOptionName":"GAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: GAXIS=AXIS<1...99>] \n          \nAssigns the specified AXIS definition to the group axis. (A group axis is created when you \nuse the GROUP= option.)"},"StatementOptionType":"V"},{"StatementOptionName":"GROUP=","StatementOptionHelp":{"#cdata":"[Syntax: GROUP=group-variable] \n          \nOrganizes the data according to values of group-variable. Group-variable can be either \ncharacter or numeric and is always treated as a discrete variable."},"StatementOptionType":"VL"},{"StatementOptionName":"GSPACE=","StatementOptionHelp":{"#cdata":"[Syntax: GSPACE=group-spacing] \n          \nSpecifies the amount of extra space between groups of bars. Group-space can be any \nnon-negative number. Units are character cells."},"StatementOptionType":"V"},{"StatementOptionName":"HTML=","StatementOptionHelp":{"#cdata":"[Syntax: HTML=variable] \n          \nIdentifies the variable in the input data set whose values create links in the HTML file \ncreated by the ODS statement."},"StatementOptionType":"V"},{"StatementOptionName":"HTML_LEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: HTML_LEGEND=variable] \n          \nIdentifies the variable in the input data set whose values create links in the HTML file \nthat is created by the ODS statement."},"StatementOptionType":"V"},{"StatementOptionName":"IFRAME=","StatementOptionHelp":{"#cdata":"[Syntax: IFRAME=fileref | 'external-file'] \n          \nSpecifies an image file to use on a 2-D chart's frame area or a 3-D chart's backplane."},"StatementOptionType":"V"},{"StatementOptionName":"IMAGESTYLE=","StatementOptionHelp":{"#cdata":"Specifies whether to use multiple instances of an image to fill the axis frame or backplane (TILE) \nor to stretch a single instance of an image to fill the axis frame or backplane frame (FIT). The \nTILE value is the default."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"TILE","@Value2":"FIT"},"StatementOptionToolTips":{"@ToolTip1":"Specifies to use multiple instances of an image to fill the axis frame or backplane.","@ToolTip2":"Specifies to stretch a single instance of an image to fill the axis frame or backplane frame."}},{"StatementOptionName":"INSIDE=","StatementOptionHelp":{"#cdata":"Displays the values of the specified statistic inside the bars."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FREQ","@Value2":"CFREQ","@Value3":"PERCENT","@Value4":"CPERCENT","@Value5":"SUM","@Value6":"MEAN","@Value7":"SUBPCT"},"StatementOptionToolTips":{"@ToolTip1":"Frequencies","@ToolTip2":"Cumulative frequencies. [Note: Not valid if the bars are subgrouped.]","@ToolTip3":"Percentages","@ToolTip4":"Cumulative percentages. [Note: Not valid if the bars are subgrouped.]","@ToolTip5":"Sums","@ToolTip6":"Means. [Note: Not valid if the bars are subgrouped.]","@ToolTip7":"Subgroup percent contribution"}},{"StatementOptionName":"LAUTOREF=","StatementOptionHelp":{"#cdata":"[Syntax: LAUTOREF=reference-line-type] \n          \nSpecifies the line type for reference lines at major tick marks, as determined by \nthe AUTOREF option."},"StatementOptionType":"V"},{"StatementOptionName":"LEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: LEGEND=LEGEND<1...99>] \n          \nAssigns the specified LEGEND definition to the legend generated by the SUBGROUP= option."},"StatementOptionType":"V"},{"StatementOptionName":"LEVELS=","StatementOptionHelp":{"#cdata":"[Syntax: LEVELS=number-of-midpoints | ALL] \n          \nSpecifies the number of midpoints for the numeric chart variable. The range for each midpoint \nis calculated automatically, using the algorithm in Terrell and Scott (1985).\n\nIf you specify LEVELS=ALL, then all unique midpoint values are graphed. If your data contains \na large number of unique midpoint values (over 200), you can use the XPIXELS and YPIXELS GOPTIONS \nto enable the device driver to render a larger (and more readable) graph.\n\nThe LEVELS= option is ignored if any of the following are true:\n\n  o The chart variable is character type. \n  o The DISCRETE option is used. \n  o The MIDPOINTS= option is used."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<number-of-midpoints>","@Value2":"ALL"},"StatementOptionToolTips":{"@ToolTip1":"Replace <number-of-midpoints> with the desired number of midpoints for the numeric chart variable.","@ToolTip2":"Specifies that all unique midpoint values are graphed. If your data contains a large number  of unique midpoint values (over 200), you can use the XPIXELS and YPIXELS GOPTIONS to enable  the device driver to render a larger (and more readable) graph."}},{"StatementOptionName":"LREF=|LR=","StatementOptionHelp":{"#cdata":"[Syntax: LREF=reference-line-type|( reference-line-type|reference-line-type-list)] \n          \nSpecifies line types for reference lines. Line types are specified as whole numbers from 1 to 46, \nwith 1 representing a solid line and the other values representing dashed lines."},"StatementOptionType":"V"},{"StatementOptionName":"MAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: MAXIS=AXIS<1...99] \n          \nAssigns the specified AXIS definition to the midpoint axis."},"StatementOptionType":"V"},{"StatementOptionName":"MEAN","StatementOptionHelp":{"#cdata":"Displays the mean statistic in the table of statistics and above vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"MEANLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: MEANLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the MEAN statistic in the table of statistics. \ncolumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<'column-label'>","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Replace <'column-label'> with the column label for the MEAN statistic in the  table of statistics.","@ToolTip2":"Specifies no column label for the MEAN statistic in the table of statistics."}},{"StatementOptionName":"MIDPOINTS=","StatementOptionHelp":{"#cdata":"[Syntax: MIDPOINTS=value-list | OLD] \n          \nSpecifies the midpoint values for the bars. The way you specify value-list depends on the \ntype of the chart variable.\n          \nFor numeric chart variables, value-list is either an explicit list of values, or a starting \nand an ending value with an interval increment, or a combination of both forms: \n\n     n <...n>\n     \n     n TO n <BY increment>\n     \n     n<...n> TO n <BY increment> <n <...n>>\n \nFor character chart variables, value-list is a list of unique character values enclosed in \nquotation marks and separated by blanks: \n\n    'value-1' <...'value-n'> \n    \nMIDPOINTS=OLD generates default midpoints using the Nelder algorithm."},"StatementOptionType":"V"},{"StatementOptionName":"MIDPOINTS=OLD","StatementOptionHelp":{"#cdata":"Generates default midpoints using the Nelder algorithm. The MIDPOINTS=OLD option is ignored \nunless the chart variable is numeric."},"StatementOptionType":"V"},{"StatementOptionName":"MINOR=","StatementOptionHelp":{"#cdata":"[Syntax: MINOR=number-of-minor-ticks] \n          \nSpecifies the number of minor tick marks between each major tick mark on the bar response axis."},"StatementOptionType":"V"},{"StatementOptionName":"MISSING","StatementOptionHelp":{"#cdata":"Accepts a missing value as a valid midpoint for the chart variable. By default, \nobservations with missing values are ignored."},"StatementOptionType":"S"},{"StatementOptionName":"NAME=","StatementOptionHelp":{"#cdata":"[Syntax: NAME='entry-name'] \n          \nSpecifies the name of the GRSEG catalog entry and the name of the graphics output file, \nif one is created."},"StatementOptionType":"V"},{"StatementOptionName":"NOAXIS","StatementOptionHelp":{"#cdata":"Suppresses all axes, including axis lines, axis labels, axis values, and all major \nand minor tick marks."},"StatementOptionType":"S"},{"StatementOptionName":"NOBASEREF","StatementOptionHelp":{"#cdata":"Suppresses the zero reference line when the SUM or MEAN bar statistic has negative values."},"StatementOptionType":"S"},{"StatementOptionName":"NOLEGEND","StatementOptionHelp":{"#cdata":"Suppresses the legend that is automatically generated by the SUBGROUP= option."},"StatementOptionType":"S"},{"StatementOptionName":"NOPLANE","StatementOptionHelp":{"#cdata":"Removes either the horizontal or vertical three-dimensional axis plane in bar charts produced \nby the HBAR3D and VBAR3D statements."},"StatementOptionType":"S"},{"StatementOptionName":"NOSTATS","StatementOptionHelp":{"#cdata":"Suppresses the table of statistics. The NOSTATS option suppresses both the default statistics and \nspecific statistics requested by the FREQ, CFREQ, PERCENT, CPERCENT, SUM, and MEAN options."},"StatementOptionType":"S"},{"StatementOptionName":"NOZERO","StatementOptionHelp":{"#cdata":"Suppresses any midpoints for which there are no corresponding values of the chart variable and, \nhence, no bar."},"StatementOptionType":"S"},{"StatementOptionName":"OUTSIDE=","StatementOptionHelp":{"#cdata":"Displays the values of the specified statistic above the bars."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FREQ","@Value2":"CFREQ","@Value3":"PERCENT","@Value4":"CPERCENT","@Value5":"SUM","@Value6":"MEAN"},"StatementOptionToolTips":{"@ToolTip1":"Frequencies","@ToolTip2":"Cumulative frequencies","@ToolTip3":"Percentages","@ToolTip4":"Cumulative percentages","@ToolTip5":"Sums","@ToolTip6":"Means"}},{"StatementOptionName":"PATTERNID=|PATTID=","StatementOptionHelp":{"#cdata":"Specifies the way fill patterns are assigned."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BY","@Value2":"MIDPOINT","@Value3":"SUBGROUP"},"StatementOptionToolTips":{"@ToolTip1":"Changes patterns each time the value of the BY variable changes. All bars use the  same pattern if the GBARLINE procedure does not include a BY statement.","@ToolTip2":"Changes patterns every time the midpoint value changes.","@ToolTip3":"Changes patterns every time the value of the subgroup variable changes."}},{"StatementOptionName":"PERCENT|PCT","StatementOptionHelp":{"#cdata":"Prints the percentages of observations having a given value for the chart variable in the table \nof statistics and above vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"PERCENTSUM|PCTSUM","StatementOptionHelp":{"#cdata":"calculates a percent of the sum variable for horizontal bar charts."},"StatementOptionType":"S"},{"StatementOptionName":"PERCENTLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: PERCENTLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the PERCENT statistic in the table of statistics. \ncolumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<'column-label'>","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Replace <'column-label'> with the column label for the PERCENT statistic in the table of statistics.","@ToolTip2":"Specifies no column label for the PERCENT statistic in the table of statistics."}},{"StatementOptionName":"RANGE","StatementOptionHelp":{"#cdata":"Displays on the axis of the chart the range of numeric values represented by each bar."},"StatementOptionType":"S"},{"StatementOptionName":"RAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: RAXIS=value-list | AXIS<1...99>] \n          \nSpecifies values for the major tick mark divisions on the response axis or assigns the \nspecified AXIS definition to the axis."},"StatementOptionType":"V"},{"StatementOptionName":"REF=|HREF=|VREF=","StatementOptionHelp":{"#cdata":"[Syntax: REF=value-list] \n          \nDraws reference lines at the specified points on the chart response axis."},"StatementOptionType":"V"},{"StatementOptionName":"SPACE=","StatementOptionHelp":{"#cdata":"[Syntax: SPACE=bar-spacing] \n          \nSpecifies the amount of space between individual bars or between the bars within each group \nif you also use the GROUP= option."},"StatementOptionType":"V"},{"StatementOptionName":"SUBGROUP=","StatementOptionHelp":{"#cdata":"[Syntax: SUBGROUP=subgroup-variable] \n          \nDivides the bars into segments according to the values of subgroup-variable. Subgroup-variable \ncan be either character or numeric and is always treated as a discrete variable."},"StatementOptionType":"VL"},{"StatementOptionName":"SUM","StatementOptionHelp":{"#cdata":"Displays the sum statistic in the table of statistics and above vertical bars."},"StatementOptionType":"S"},{"StatementOptionName":"SUMLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: SUMLABEL='column-label' | NONE] \n          \nSpecifies the text of the column label for the SUM statistic in the table of statistics. \ncolumn-label can be up to 32 characters long, but a single line of the label can be no more \nthan 24 characters."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<'column-label'>","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Replace <'column-label'> with the column label for the SUM statistic in the table of statistics.","@ToolTip2":"Specifies no column label for the SUM statistic in the table of statistics."}},{"StatementOptionName":"SUMVAR=","StatementOptionHelp":{"#cdata":"[Syntax: SUMVAR=summary-variable] \n          \nSpecifies a numeric variable for sum or mean calculations."},"StatementOptionType":"VL"},{"StatementOptionName":"TYPE=","StatementOptionHelp":{"#cdata":"Specifies the chart statistic."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FREQ","@Value2":"CFREQ","@Value3":"PERCENT","@Value4":"CPERCENT","@Value5":"SUM","@Value6":"MEAN"},"StatementOptionToolTips":{"@ToolTip1":"[Valid if the SUMVAR= option is not used]--Frequency","@ToolTip2":"[Valid if the SUMVAR= option is not used]--Cumulative frequency","@ToolTip3":"[Valid if the SUMVAR= option is not used]--Percentage","@ToolTip4":"[Valid if the SUMVAR= option is not used]--Cumulative percentage","@ToolTip5":"[Valid if the SUMVAR= option is used]--Sum","@ToolTip6":"[Valid if the SUMVAR= option is used]--Mean"}},{"StatementOptionName":"URL=","StatementOptionHelp":{"#cdata":"[URL=character-variable \n          \nSpecifies a character variable whose values are URLs. The variable values are URLs for \nWeb pages to display when the user clicks (drills down) on elements in the graph. \n\nRestrictions: This option affects graphics output that is created through the ODS HTML \ndestination only. Not supported by GIF, PNG, and ACTIVEX devices.\n\nInteraction: If you specify both the HTML= and the URL= options, then the URL= option \nis ignored."},"StatementOptionType":"V"},{"StatementOptionName":"WAUTOREF=","StatementOptionHelp":{"#cdata":"[Syntax: WAUTOREF=reference-line-width] \n          \nSpecifies the line width for reference lines at major tick marks, as determined by the AUTOREF option."},"StatementOptionType":"V"},{"StatementOptionName":"WIDTH=","StatementOptionHelp":{"#cdata":"[Syntax: WIDTH=bar-width] \n          \nSpecifies the width of the bars. By default, the GCHART procedure selects a bar width that \naccommodates the midpoint values displayed on the midpoint axis using a hardware font and a \nheight of one cell. Units for bar-width are character cells. The value for bar-width must be \ngreater than 0, but it does not have to be an integer, for example: \n\n  vbar site / width=1.5;\n  \nIf the requested bar width results in a chart that is too large to fit in the space available \nfor the midpoint axis, then the procedure issues a warning in the log and ignores the WIDTH= \noption. If the specified width is too narrow, the procedure displays the midpoint values \nvertically."},"StatementOptionType":"V"},{"StatementOptionName":"WOUTLINE=","StatementOptionHelp":{"#cdata":"[Syntax: WOUTLINE=bar-outline-width] \n          \nSpecifies the width of the outline in pixels. The WOUTLINE= option affects both the bar \nand the subgroup outlines."},"StatementOptionType":"V"},{"StatementOptionName":"WREF=|WR=","StatementOptionHelp":{"#cdata":"[Syntax: WREF=reference-line-width|( reference-line-width|reference-line-width-list)] \n          \nSpecifies line widths for reference lines. Line widths are specified as whole numbers. \nTo specify colors for these reference lines, use the CREF= option."},"StatementOptionType":"V"}]}},{"StatementName":"PIE","StatementHelp":{"#cdata":"Syntax: PIE chart-variable(s) </ option(s)>; \n      \nCreates a pie chart in which the size of a pie slice represents the value of the chart statistic \nfor that category of data in relation to the total chart statistic for all categories."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ACROSS=","StatementOptionHelp":{"#cdata":"[Syntax: ACROSS=number-of-columns] \n          \nDraws number-of-columns pies across the procedure output area. ACROSS is ignored unless \nyou also use the GROUP= option."},"StatementOptionType":"V"},{"StatementOptionName":"ANGLE=","StatementOptionHelp":{"#cdata":"[Syntax: ANGLE=degrees] \n          \nStarts the first slice at the specified angle. A value of 0 for degrees corresponds to the \nthree o'clock position."},"StatementOptionType":"V"},{"StatementOptionName":"ANNOTATE=|ANNO=","StatementOptionHelp":{"#cdata":"[Syntax: ANNOTATE=Annotate-data-set] \n          \nSpecifies a data set to annotate charts produced by the PIE, PIE3D, or DONUT statement. \n\nNote: Annotate coordinate systems 1, 2, 7, and 8 (data system coordinates) are not valid \nwith pie or donut charts."},"StatementOptionType":"DV"},{"StatementOptionName":"ASCENDING","StatementOptionHelp":{"#cdata":"Arranges the slices in ascending order of the value of the chart statistic."},"StatementOptionType":"S"},{"StatementOptionName":"CFILL=|CF=","StatementOptionHelp":{"#cdata":"[Syntax: CFILL=fill-color] \n          \nSpecifies one color for all patterns in the chart, regardless of whether the fill \nis solid or hatch."},"StatementOptionType":"C"},{"StatementOptionName":"CLOCKWISE","StatementOptionHelp":{"#cdata":"Draws the slices clockwise starting at the twelve o'clock position."},"StatementOptionType":"S"},{"StatementOptionName":"COUTLINE=|CO=","StatementOptionHelp":{"#cdata":"[Syntax: COUTLINE=slice-outline-color | SAME] \n          \nOutlines all slices, rings (subgroups), and legend values (if a legend appears) in the \nspecified color. SAME specifies that the outline color of a slice or a slice segment or \na legend value is the same as the interior pattern color."},"StatementOptionType":"C"},{"StatementOptionName":"COUTLINE=SAME","StatementOptionHelp":{"#cdata":"[Syntax: COUTLINE=slice-outline-color | SAME] \n          \nOutlines all slices, rings (subgroups), and legend values (if a legend appears) in the \nspecified color. SAME specifies that the outline color of a slice or a slice segment or \na legend value is the same as the interior pattern color."},"StatementOptionType":"S|V"},{"StatementOptionName":"CTEXT=|CT=","StatementOptionHelp":{"#cdata":"[Syntax: CTEXT=text-color] \n          \nSpecifies a color for all text on the axes and legend, including axis labels, tick mark \nvalues, legend labels, and legend value descriptions."},"StatementOptionType":"C"},{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Arranges the slices in descending order of the value of the chart statistic."},"StatementOptionType":"S"},{"StatementOptionName":"DESCRIPTION=|DES=","StatementOptionHelp":{"#cdata":"[Syntax: DESCRIPTION='description'] \n          \nSpecifies the description of the catalog entry for the chart. The maximum length \nfor entry-description is 256 characters."},"StatementOptionType":"V"},{"StatementOptionName":"DETAIL=","StatementOptionHelp":{"#cdata":"[Syntax: DETAIL=variable] \n          \nProduces an inner pie overlay whose slices show the major components that comprise the \nouter pie's slice."},"StatementOptionType":"V"},{"StatementOptionName":"DETAIL_PERCENT=","StatementOptionHelp":{"#cdata":"[Syntax: DETAIL_PERCENT=BEST|NONE] \n          \nSpecifies the algorithm to use for displaying the percentage values for the detail pie slices. \nNONE turns off the display of the percentage values."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BEST","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Specifies the BEST algorithm for displaying the percentage values for the detail pie slices.","@ToolTip2":"Turns off the display of the percentage values."}},{"StatementOptionName":"DETAIL_RADIUS=","StatementOptionHelp":{"#cdata":"[Syntax: DETAIL_RADIUS=percent] \n          \nDetermines the size of the detail pie. Percent specifies the percent of the outer pie \nradius to use as the detail pie radius. The valid range is 25 to 90. The default is 75."},"StatementOptionType":"V"},{"StatementOptionName":"DETAIL_SLICE=","StatementOptionHelp":{"#cdata":"[Syntax: DETAIL_SLICE=BEST|NONE] \n          \nSpecifies the algorithm to use for displaying the detail variable labels for the inner \npie slices. NONE turns off the display of the detail variable labels."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BEST","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Specifies the BEST algorithm for displaying the detail variable labels for the inner pie slices.","@ToolTip2":"Turns off the display of the detail variable labels."}},{"StatementOptionName":"DETAIL_THRESHOLD=","StatementOptionHelp":{"#cdata":"[Syntax: DETAIL_THRESHOLD=percent] \n          \nDetermines whether a detail slice is included in the inner pie. Any detail slice comprising percent \nor more percent of the whole pie is included. The valid range for percent is 0 to 75. The default is 4."},"StatementOptionType":"V"},{"StatementOptionName":"DETAIL_VALUE=","StatementOptionHelp":{"#cdata":"[Syntax: DETAIL_VALUE=BEST|NONE] \n          \nSpecifies the algorithm to use for displaying the data values for the detail pie slices. \nNONE turns off the display of the data values."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BEST","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Specifies the BEST algorithm for displaying the data values for the detail pie slices.","@ToolTip2":"Turns off the display of the data values."}},{"StatementOptionName":"DISCRETE","StatementOptionHelp":{"#cdata":"Treats a numeric chart variable as a discrete variable rather than as a continuous variable. \nThe GCHART procedure creates a separate midpoint and, hence, a separate grid square and block \nfor each unique value of the chart variable."},"StatementOptionType":"S"},{"StatementOptionName":"DOWN=","StatementOptionHelp":{"#cdata":"[Syntax: DOWN=number-of-rows] \n          \nDraws number-of-rows pies vertically in the procedure output area. The DOWN= option \nis ignored unless you also use the GROUP= option.\n\nIf number-of-rows calls for more pies than fit vertically in the graphics area of the \noutput device, no pies are drawn and an error message is written to the SAS log.\n\nIf you also use the ACROSS= option, the pies are drawn in left-to-right and top-to-bottom order."},"StatementOptionType":"V"},{"StatementOptionName":"EXPLODE=","StatementOptionHelp":{"#cdata":"[Syntax: EXPLODE=value-list] \n          \nPulls the specified slices slightly out from the rest of the pie for added emphasis. \nvalue-list is the list of midpoint values for the slices to be exploded."},"StatementOptionType":"V"},{"StatementOptionName":"FILL=","StatementOptionHelp":{"#cdata":"Specifies the fill pattern for all slices in the chart."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"SOLID","@Value2":"X"},"StatementOptionToolTips":{"@ToolTip1":"Rotates a solid fill through the color list of the current style as many times as necessary.  SOLID is the default.","@ToolTip2":"Rotates a single hatch pattern through the list of colors defined in the current style."}},{"StatementOptionName":"FREQ=","StatementOptionHelp":{"#cdata":"[Syntax: FREQ=numeric-variable] \n          \nSpecifies a variable whose values weight the contribution of each observation in the \ncomputation of the chart statistic."},"StatementOptionType":"NVL"},{"StatementOptionName":"GROUP=","StatementOptionHelp":{"#cdata":"[Syntax: GROUP=group-variable] \n          \nOrganizes the data according to the values of group-variable and produces a separate \npie(or donut) chart for each unique value of group-variable. Group-variable can be either \ncharacter or numeric and is always treated as a discrete variable. The group variable can \nhave up to 12 different values."},"StatementOptionType":"VL"},{"StatementOptionName":"HTML=","StatementOptionHelp":{"#cdata":"[Syntax: HTML=variable] \n          \nIdentifies the variable in the input data set whose values create links in the HTML file \nthat is created by the ODS statement. These links are associated with an area of the chart \nand point to the data or graph that you want to display when the user drills down on the area."},"StatementOptionType":"V"},{"StatementOptionName":"HTML_LEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: HTML_LEGEND=variable] \n          \nIdentifies the variable in the input data set whose values create links in the HTML file \nthat is created by the ODS statement. These links are associated with a legend value and \npoint to the data or graph that you want to display when the user drills down on the value. \nThe values of variable can be up to 1024 characters long. Characters after the 1024-character \nlimit (including any closing quotes) are truncated. If either subgroups or the DETAIL= option \nare specified, then the HTML_LEGEND= option is ignored."},"StatementOptionType":"V"},{"StatementOptionName":"INVISIBLE=","StatementOptionHelp":{"#cdata":"[Syntax: INVISIBLE=value-list] \n          \nMakes the specified slices invisible, as if they had been removed from the pie. Labels \nare not printed for invisible slices. Value-list is the list of midpoint values for the \ninvisible slices."},"StatementOptionType":"V"},{"StatementOptionName":"JSTYLE","StatementOptionHelp":{"#cdata":"Arranges the midpoints in descending order of the statistic value and draws the slices clockwise \nstarting at the twelve o'clock position."},"StatementOptionType":"S"},{"StatementOptionName":"LEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: LEGEND=LEGEND<1...99>] \n          \nGenerates a legend for the slice names (midpoint values) instead of printing them beside the slices."},"StatementOptionType":"V"},{"StatementOptionName":"LEVELS=","StatementOptionHelp":{"#cdata":"[Syntax: LEVELS=number-of-midpoints|ALL] \n          \nSpecifies the number of midpoints for a numeric chart variable. The range for each midpoint \nis calculated automatically.\n\nIf you specify LEVELS=ALL, then all unique midpoint values are graphed.\n\nThe LEVELS= option is ignored if any of the following is true:\n\n  o The chart variable is character type.\n  o The MIDPOINTS= option is used."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<number-of-midpoints>","@Value2":"ALL"},"StatementOptionToolTips":{"@ToolTip1":"Replace <number-of-midpoints> with the desired number of midpoints for a numeric chart variable.","@ToolTip2":"Specifies that all unique midpoint values are graphed. If your data contains a large number  of unique midpoint values (over 200), you can use the XPIXELS and YPIXELS GOPTIONS to enable  the device driver to render a larger (and more readable) graph."}},{"StatementOptionName":"MATCHCOLOR","StatementOptionHelp":{"#cdata":"Uses the slice pattern color for all slice labels. MATCHCOLOR overrides the color that \nis specified in the CTEXT= option."},"StatementOptionType":"V"},{"StatementOptionName":"MIDPOINTS=","StatementOptionHelp":{"#cdata":"[Syntax: MIDPOINTS=value-list | OLD] \n          \nSpecifies the midpoint values for the slices. The way you specify value-list depends on the \ntype of variable:\n          \nFor numeric chart variables, value-list is either an explicit list of values, or a starting \nand an ending value with an interval increment, or a combination of both forms: \n\n     n <...n>\n     \n     n TO n <BY increment>\n     \n     n<...n> TO n <BY increment> <n <...n>>\n \nFor character chart variables, value-list is a list of unique character values enclosed in \nquotation marks and separated by blanks: \n\n    'value-1' <...'value-n'> \n    \nMIDPOINTS=OLD generates default midpoints using the Nelder algorithm."},"StatementOptionType":"V"},{"StatementOptionName":"MIDPOINTS=OLD","StatementOptionHelp":{"#cdata":"Generates default midpoints using the Nelder algorithm."},"StatementOptionType":"V"},{"StatementOptionName":"MISSING","StatementOptionHelp":{"#cdata":"Accepts a missing value as a valid midpoint for the chart variable. By default, observations \nwith missing values are ignored."},"StatementOptionType":"S"},{"StatementOptionName":"NAME=","StatementOptionHelp":{"#cdata":"[Syntax: NAME='entry-name'] \n          \nSpecifies the name of the GRSEG catalog entry and the name of the graphics output file, \nif one is created."},"StatementOptionType":"V"},{"StatementOptionName":"NOGROUPHEADING","StatementOptionHelp":{"#cdata":"Suppresses the headings that are normally printed above each pie when you use the GROUP= option."},"StatementOptionType":"S"},{"StatementOptionName":"NOHEADING","StatementOptionHelp":{"#cdata":"Suppresses the heading that is normally printed at the top of each page or display of output \nfor all devices except Java and ActiveX."},"StatementOptionType":"S"},{"StatementOptionName":"NOLEGEND","StatementOptionHelp":{"#cdata":"Suppresses the legend that is automatically generated by the SUBGROUP= option"},"StatementOptionType":"S"},{"StatementOptionName":"OTHER=","StatementOptionHelp":{"#cdata":"[Syntax: OTHER=percent-of-total] \n          \nCollects all midpoints with chart statistic values less than or equal to percent-of-total \ninto a generic midpoint named OTHER."},"StatementOptionType":"V"},{"StatementOptionName":"OTHERCOLOR=","StatementOptionHelp":{"#cdata":"[Syntax: OTHERCOLOR=color] \n          \nSpecifies the color to use for the OTHER slice."},"StatementOptionType":"C"},{"StatementOptionName":"OTHERLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: OTHERLABEL='text-string'] \n          \nSpecifies a text string up to 16 characters for the label for the OTHER slice. The default \nlabel is OTHER."},"StatementOptionType":"V"},{"StatementOptionName":"PERCENT=","StatementOptionHelp":{"#cdata":"Prints the percentage represented by each slice using the specified labeling method."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ARROW","@Value2":"INSIDE","@Value3":"NONE","@Value4":"OUTSIDE"},"StatementOptionToolTips":{"@ToolTip1":"Places the text outside the slice and connects the text to the slice with a line.","@ToolTip2":"Places the text inside the slice. The label overlays the slice fill patterns.","@ToolTip3":"Suppresses the text.","@ToolTip4":"Places the text outside of the slice."}},{"StatementOptionName":"PLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: PLABEL=(text argument(s))] \n          \nDefines the text that is displayed on the pie slice label. Text-argument(s) defines the text \nor the appearance of the label, or both."},"StatementOptionType":"V"},{"StatementOptionName":"RADIUS=","StatementOptionHelp":{"#cdata":"[Syntax: RADIUS=value] \n          \nSpecifies the radius of the pie and donut in GCHART. RADIUS=n, where n is the pie radius in \ncharacter cells."},"StatementOptionType":"V"},{"StatementOptionName":"SLICE=","StatementOptionHelp":{"#cdata":"Controls the position and style of the slice name (midpoint value) for each slice."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ARROW","@Value2":"INSIDE","@Value3":"NONE","@Value4":"OUTSIDE"},"StatementOptionToolTips":{"@ToolTip1":"Places the text outside the slice and connects the text to the slice with a line.","@ToolTip2":"Places the text inside the slice. The label overlays the slice fill patterns.","@ToolTip3":"Suppresses the text.","@ToolTip4":"Places the text outside of the slice."}},{"StatementOptionName":"SUBGROUP=","StatementOptionHelp":{"#cdata":"[Syntax: SUBGROUP=subgroup-variable] \n          \nDivides the chart into concentric rings according to the values of subgroup-variable. \nSubgroup-variable can be either character or numeric and is always treated as a discrete \nvariable."},"StatementOptionType":"VL"},{"StatementOptionName":"SUMVAR=","StatementOptionHelp":{"#cdata":"[Syntax: SUMVAR=summary-variable] \n          \nSpecifies a numeric variable for sum or mean calculations. The GCHART procedure calculates the \nsum or, if requested, the mean of numeric-variable for each midpoint. The resulting statistics \nare represented by the size of the slice and displayed beside of each slice.\n\nWhen you use SUMVAR=, the TYPE= option must be either SUM or MEAN. With SUMVAR=, the default \nis TYPE=SUM."},"StatementOptionType":"VL"},{"StatementOptionName":"TYPE=","StatementOptionHelp":{"#cdata":"Specifies the chart statistic."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FREQ","@Value2":"PERCENT","@Value3":"SUM","@Value4":"MEAN"},"StatementOptionToolTips":{"@ToolTip1":"[Valid if the SUMVAR= option is not used]Frequency","@ToolTip2":"[Valid if the SUMVAR= option is not used]Percentage","@ToolTip3":"[Valid if the SUMVAR= option is used]--Sum","@ToolTip4":"[Valid if the SUMVAR= option is used]--Mean"}},{"StatementOptionName":"URL=","StatementOptionHelp":{"#cdata":"[URL=character-variable \n          \nSpecifies a character variable whose values are URLs. The variable values are URLs for \nWeb pages to display when the user clicks (drills down) on elements in the graph. \n\nRestrictions: This option affects graphics output that is created through the ODS HTML \ndestination only. Not supported by GIF, PNG, and ACTIVEX devices.\n\nInteraction: If you specify both the HTML= and the URL= options, then the URL= option \nis ignored."},"StatementOptionType":"V"},{"StatementOptionName":"VALUE=","StatementOptionHelp":{"#cdata":"Controls the position and style of the slice value (chart statistic) for each slice."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ARROW","@Value2":"INSIDE","@Value3":"NONE","@Value4":"OUTSIDE"},"StatementOptionToolTips":{"@ToolTip1":"Places the text outside the slice and connects the text to the slice with a line.","@ToolTip2":"Places the text inside the slice. The label overlays the slice fill patterns.","@ToolTip3":"Suppresses the text.","@ToolTip4":"Places the text outside of the slice."}},{"StatementOptionName":"WOUTLINE=","StatementOptionHelp":{"#cdata":"[Syntax: WOUTLINE=block-outline-width] \n          \nSpecifies the width of the block outline in pixels. WOUTLINE= affects both the slice \nand the subgroup outlines."},"StatementOptionType":"V"}]}},{"StatementName":"PIE3D","StatementHelp":{"#cdata":"Syntax: PIE3D chart-variable(s) </ option(s)>; \n      \nCreates a 3D pie chart in which the size of a pie slice represents the value of the chart statistic\nfor that category of data in relation to the total chart statistic for all categories."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ACROSS=","StatementOptionHelp":{"#cdata":"[Syntax: ACROSS=number-of-columns] \n          \nDraws number-of-columns pies across the procedure output area. ACROSS is ignored unless \nyou also use the GROUP= option."},"StatementOptionType":"V"},{"StatementOptionName":"ANGLE=","StatementOptionHelp":{"#cdata":"[Syntax: ANGLE=degrees] \n          \nStarts the first slice at the specified angle. A value of 0 for degrees corresponds to the \nthree o'clock position."},"StatementOptionType":"V"},{"StatementOptionName":"ANNOTATE=|ANNO=","StatementOptionHelp":{"#cdata":"[Syntax: ANNOTATE=Annotate-data-set] \n          \nSpecifies a data set to annotate charts produced by the PIE, PIE3D, or DONUT statement. \n\nNote: Annotate coordinate systems 1, 2, 7, and 8 (data system coordinates) are not valid \nwith pie or donut charts."},"StatementOptionType":"DV"},{"StatementOptionName":"ASCENDING","StatementOptionHelp":{"#cdata":"Arranges the slices in ascending order of the value of the chart statistic."},"StatementOptionType":"S"},{"StatementOptionName":"CFILL=|CF=","StatementOptionHelp":{"#cdata":"[Syntax: CFILL=fill-color] \n          \nSpecifies one color for all patterns in the chart, regardless of whether the fill \nis solid or hatch."},"StatementOptionType":"C"},{"StatementOptionName":"CLOCKWISE","StatementOptionHelp":{"#cdata":"Draws the slices clockwise starting at the twelve o'clock position."},"StatementOptionType":"S"},{"StatementOptionName":"COUTLINE=|CO=","StatementOptionHelp":{"#cdata":"[Syntax: COUTLINE=slice-outline-color | SAME] \n          \nOutlines all slices, rings (subgroups), and legend values (if a legend appears) in the \nspecified color. SAME specifies that the outline color of a slice or a slice segment or \na legend value is the same as the interior pattern color."},"StatementOptionType":"C"},{"StatementOptionName":"COUTLINE=SAME","StatementOptionHelp":{"#cdata":"[Syntax: COUTLINE=slice-outline-color | SAME] \n          \nOutlines all slices, rings (subgroups), and legend values (if a legend appears) in the \nspecified color. SAME specifies that the outline color of a slice or a slice segment or \na legend value is the same as the interior pattern color."},"StatementOptionType":"S|V"},{"StatementOptionName":"CTEXT=|CT=","StatementOptionHelp":{"#cdata":"[Syntax: CTEXT=text-color] \n          \nSpecifies a color for all text on the axes and legend, including axis labels, tick mark \nvalues, legend labels, and legend value descriptions."},"StatementOptionType":"C"},{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Arranges the slices in descending order of the value of the chart statistic."},"StatementOptionType":"S"},{"StatementOptionName":"DESCRIPTION=|DES=","StatementOptionHelp":{"#cdata":"[Syntax: DESCRIPTION='description'] \n          \nSpecifies the description of the catalog entry for the chart. The maximum length \nfor entry-description is 256 characters."},"StatementOptionType":"V"},{"StatementOptionName":"DETAIL_PERCENT=","StatementOptionHelp":{"#cdata":"[Syntax: DETAIL_PERCENT=BEST|NONE] \n          \nSpecifies the algorithm to use for displaying the percentage values for the detail pie slices. \nNONE turns off the display of the percentage values."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BEST","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Specifies the BEST algorithm for displaying the percentage values for the detail pie slices.","@ToolTip2":"Turns off the display of the percentage values."}},{"StatementOptionName":"DETAIL_RADIUS=","StatementOptionHelp":{"#cdata":"[Syntax: DETAIL_RADIUS=percent] \n          \nDetermines the size of the detail pie. Percent specifies the percent of the outer \npie radius to use as the detail pie radius. The valid range is 25 to 90. The default \nis 75."},"StatementOptionType":"V"},{"StatementOptionName":"DETAIL_SLICE=","StatementOptionHelp":{"#cdata":"[Syntax: DETAIL_SLICE=BEST|NONE] \n          \nSpecifies the algorithm to use for displaying the detail variable labels for the inner pie slices. \nNONE turns off the display of the detail variable labels."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BEST","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Specifies the BEST algorithm for displaying the detail variable labels for the inner pie slices.","@ToolTip2":"Turns off the display of the detail variable labels."}},{"StatementOptionName":"DETAIL_VALUE=","StatementOptionHelp":{"#cdata":"[Syntax: DETAIL_VALUE=BEST|NONE] \n          \nSpecifies the algorithm to use for displaying the data values for the detail pie slices. \nNONE turns off the display of the data values."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BEST","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Specifies the BEST algorithm for displaying the data values for the detail pie slices.","@ToolTip2":"Turns off the display of the data values."}},{"StatementOptionName":"DISCRETE","StatementOptionHelp":{"#cdata":"Treats a numeric chart variable as a discrete variable rather than as a continuous variable. \nThe GCHART procedure creates a separate midpoint and, hence, a separate grid square and block \nfor each unique value of the chart variable."},"StatementOptionType":"S"},{"StatementOptionName":"DOWN=","StatementOptionHelp":{"#cdata":"[Syntax: DOWN=number-of-rows] \n          \nDraws number-of-rows pies vertically in the procedure output area. The DOWN= option \nis ignored unless you also use the GROUP= option.\n\nIf number-of-rows calls for more pies than fit vertically in the graphics area of the \noutput device, no pies are drawn and an error message is written to the SAS log.\n\nIf you also use the ACROSS= option, the pies are drawn in left-to-right and top-to-bottom order."},"StatementOptionType":"V"},{"StatementOptionName":"EXPLODE=","StatementOptionHelp":{"#cdata":"[Syntax: EXPLODE=value-list] \n          \nPulls the specified slices slightly out from the rest of the pie for added emphasis. \nvalue-list is the list of midpoint values for the slices to be exploded."},"StatementOptionType":"V"},{"StatementOptionName":"FILL=","StatementOptionHelp":{"#cdata":"Specifies the fill pattern for all slices in the chart."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"SOLID","@Value2":"X"},"StatementOptionToolTips":{"@ToolTip1":"Rotates a solid fill through the color list of the current style as many times as necessary.  SOLID is the default.","@ToolTip2":"Rotates a single hatch pattern through the list of colors defined in the current style."}},{"StatementOptionName":"FREQ=","StatementOptionHelp":{"#cdata":"[Syntax: FREQ=numeric-variable] \n          \nSpecifies a variable whose values weight the contribution of each observation in the \ncomputation of the chart statistic."},"StatementOptionType":"NVL"},{"StatementOptionName":"GROUP=","StatementOptionHelp":{"#cdata":"[Syntax: GROUP=group-variable] \n          \nOrganizes the data according to the values of group-variable and produces a separate \npie(or donut) chart for each unique value of group-variable. Group-variable can be either \ncharacter or numeric and is always treated as a discrete variable. The group variable can \nhave up to 12 different values."},"StatementOptionType":"VL"},{"StatementOptionName":"HTML=","StatementOptionHelp":{"#cdata":"[Syntax: HTML=variable] \n          \nIdentifies the variable in the input data set whose values create links in the HTML file \nthat is created by the ODS statement. These links are associated with an area of the chart \nand point to the data or graph that you want to display when the user drills down on the area."},"StatementOptionType":"V"},{"StatementOptionName":"HTML_LEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: HTML_LEGEND=variable] \n          \nIdentifies the variable in the input data set whose values create links in the HTML file \nthat is created by the ODS statement. These links are associated with a legend value and \npoint to the data or graph that you want to display when the user drills down on the value. \nThe values of variable can be up to 1024 characters long. Characters after the 1024-character \nlimit (including any closing quotes) are truncated. If either subgroups or the DETAIL= option \nare specified, then the HTML_LEGEND= option is ignored."},"StatementOptionType":"V"},{"StatementOptionName":"INVISIBLE=","StatementOptionHelp":{"#cdata":"[Syntax: INVISIBLE=value-list] \n          \nMakes the specified slices invisible, as if they had been removed from the pie. Labels \nare not printed for invisible slices. Value-list is the list of midpoint values for the \ninvisible slices."},"StatementOptionType":"V"},{"StatementOptionName":"JSTYLE","StatementOptionHelp":{"#cdata":"Arranges the midpoints in descending order of the statistic value and draws the slices \nclockwise starting at the twelve o'clock position."},"StatementOptionType":"S"},{"StatementOptionName":"LEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: LEGEND=LEGEND<1...99>] \n          \nGenerates a legend for the slice names (midpoint values) instead of printing them \nbeside the slices."},"StatementOptionType":"V"},{"StatementOptionName":"LEVELS=","StatementOptionHelp":{"#cdata":"[Syntax: LEVELS=number-of-midpoints|ALL] \n          \nSpecifies the number of midpoints for a numeric chart variable. The range for each midpoint \nis calculated automatically.\n\nIf you specify LEVELS=ALL, then all unique midpoint values are graphed.\n\nThe LEVELS= option is ignored if any of the following is true:\n\n  o The chart variable is character type.\n  o The MIDPOINTS= option is used."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<number-of-midpoints>","@Value2":"ALL"},"StatementOptionToolTips":{"@ToolTip1":"Replace <number-of-midpoints> with the desired number of midpoints for a numeric chart variable.","@ToolTip2":"Specifies that all unique midpoint values are graphed. If your data contains a large number  of unique midpoint values (over 200), you can use the XPIXELS and YPIXELS GOPTIONS to enable  the device driver to render a larger (and more readable) graph."}},{"StatementOptionName":"MATCHCOLOR","StatementOptionHelp":{"#cdata":"Uses the slice pattern color for all slice labels. MATCHCOLOR overrides the color that \nis specified in the CTEXT= option."},"StatementOptionType":"V"},{"StatementOptionName":"MIDPOINTS=","StatementOptionHelp":{"#cdata":"[Syntax: MIDPOINTS=value-list | OLD] \n          \nSpecifies the midpoint values for the slices. The way you specify value-list depends on the \ntype of variable:\n          \nFor numeric chart variables, value-list is either an explicit list of values, or a starting \nand an ending value with an interval increment, or a combination of both forms: \n\n     n <...n>\n     \n     n TO n <BY increment>\n     \n     n<...n> TO n <BY increment> <n <...n>>\n \nFor character chart variables, value-list is a list of unique character values enclosed in \nquotation marks and separated by blanks: \n\n    'value-1' <...'value-n'> \n    \nMIDPOINTS=OLD generates default midpoints using the Nelder algorithm."},"StatementOptionType":"V"},{"StatementOptionName":"MIDPOINTS=OLD","StatementOptionHelp":{"#cdata":"Generates default midpoints using the Nelder algorithm."},"StatementOptionType":"V"},{"StatementOptionName":"MISSING","StatementOptionHelp":{"#cdata":"Accepts a missing value as a valid midpoint for the chart variable. By default, observations \nwith missing values are ignored."},"StatementOptionType":"S"},{"StatementOptionName":"NAME=","StatementOptionHelp":{"#cdata":"[Syntax: NAME='entry-name'] \n          \nSpecifies the name of the GRSEG catalog entry and the name of the graphics output file, \nif one is created."},"StatementOptionType":"V"},{"StatementOptionName":"NOGROUPHEADING","StatementOptionHelp":{"#cdata":"Suppresses the headings that are normally printed above each pie when you use the GROUP= option."},"StatementOptionType":"S"},{"StatementOptionName":"NOHEADING","StatementOptionHelp":{"#cdata":"Suppresses the heading that is normally printed at the top of each page or display of output \nfor all devices except Java and ActiveX."},"StatementOptionType":"S"},{"StatementOptionName":"NOLEGEND","StatementOptionHelp":{"#cdata":"Suppresses the legend that is automatically generated by the SUBGROUP= option"},"StatementOptionType":"S"},{"StatementOptionName":"OTHER=","StatementOptionHelp":{"#cdata":"[Syntax: OTHER=percent-of-total] \n          \nCollects all midpoints with chart statistic values less than or equal to percent-of-total \ninto a generic midpoint named OTHER."},"StatementOptionType":"V"},{"StatementOptionName":"OTHERCOLOR=","StatementOptionHelp":{"#cdata":"[Syntax: OTHERCOLOR=color] \n          \nSpecifies the color to use for the OTHER slice."},"StatementOptionType":"C"},{"StatementOptionName":"OTHERLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: OTHERLABEL='text-string'] \n          \nSpecifies a text string up to 16 characters for the label for the OTHER slice. The default \nlabel is OTHER."},"StatementOptionType":"V"},{"StatementOptionName":"PERCENT=","StatementOptionHelp":{"#cdata":"Prints the percentage represented by each slice using the specified labeling method."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ARROW","@Value2":"INSIDE","@Value3":"NONE","@Value4":"OUTSIDE"},"StatementOptionToolTips":{"@ToolTip1":"Places the text outside the slice and connects the text to the slice with a line.","@ToolTip2":"Places the text inside the slice. The label overlays the slice fill patterns.","@ToolTip3":"Suppresses the text.","@ToolTip4":"Places the text outside of the slice."}},{"StatementOptionName":"PLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: PLABEL=(text argument(s))] \n          \nDefines the text that is displayed on the pie slice label. Text-argument(s) defines the \ntext or the appearance of the label, or both."},"StatementOptionType":"V"},{"StatementOptionName":"RADIUS=","StatementOptionHelp":{"#cdata":"[Syntax: RADIUS=value] \n          \nSpecifies the radius of the pie and donut in GCHART. RADIUS=n, where n is the pie radius in \ncharacter cells."},"StatementOptionType":"V"},{"StatementOptionName":"SLICE=","StatementOptionHelp":{"#cdata":"Controls the position and style of the slice name (midpoint value) for each slice."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ARROW","@Value2":"INSIDE","@Value3":"NONE","@Value4":"OUTSIDE"},"StatementOptionToolTips":{"@ToolTip1":"Places the text outside the slice and connects the text to the slice with a line.","@ToolTip2":"Places the text inside the slice. The label overlays the slice fill patterns.","@ToolTip3":"Suppresses the text.","@ToolTip4":"Places the text outside of the slice."}},{"StatementOptionName":"SUBGROUP=","StatementOptionHelp":{"#cdata":"[Syntax: SUBGROUP=subgroup-variable] \n          \nDivides the chart into concentric rings according to the values of subgroup-variable. \nSubgroup-variable can be either character or numeric and is always treated as a discrete \nvariable."},"StatementOptionType":"VL"},{"StatementOptionName":"SUMVAR=","StatementOptionHelp":{"#cdata":"[Syntax: SUMVAR=summary-variable] \n          \nSpecifies a numeric variable for sum or mean calculations. The GCHART procedure calculates the \nsum or, if requested, the mean of numeric-variable for each midpoint. The resulting statistics \nare represented by the size of the slice and displayed beside of each slice.\n\nWhen you use SUMVAR=, the TYPE= option must be either SUM or MEAN. With SUMVAR=, the default \nis TYPE=SUM."},"StatementOptionType":"VL"},{"StatementOptionName":"TYPE=","StatementOptionHelp":{"#cdata":"Specifies the chart statistic."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FREQ","@Value2":"PERCENT","@Value3":"SUM","@Value4":"MEAN"},"StatementOptionToolTips":{"@ToolTip1":"[Valid if the SUMVAR= option is not used]Frequency","@ToolTip2":"[Valid if the SUMVAR= option is not used]Percentage","@ToolTip3":"[Valid if the SUMVAR= option is used]--Sum","@ToolTip4":"[Valid if the SUMVAR= option is used]--Mean"}},{"StatementOptionName":"URL=","StatementOptionHelp":{"#cdata":"[URL=character-variable \n          \nSpecifies a character variable whose values are URLs. The variable values are URLs for \nWeb pages to display when the user clicks (drills down) on elements in the graph. \n\nRestrictions: This option affects graphics output that is created through the ODS HTML \ndestination only. Not supported by GIF, PNG, and ACTIVEX devices.\n\nInteraction: If you specify both the HTML= and the URL= options, then the URL= option \nis ignored."},"StatementOptionType":"V"},{"StatementOptionName":"VALUE=","StatementOptionHelp":{"#cdata":"Controls the position and style of the slice value (chart statistic) for each slice."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ARROW","@Value2":"INSIDE","@Value3":"NONE","@Value4":"OUTSIDE"},"StatementOptionToolTips":{"@ToolTip1":"Places the text outside the slice and connects the text to the slice with a line.","@ToolTip2":"Places the text inside the slice. The label overlays the slice fill patterns.","@ToolTip3":"Suppresses the text.","@ToolTip4":"Places the text outside of the slice."}},{"StatementOptionName":"WOUTLINE=","StatementOptionHelp":{"#cdata":"[Syntax: WOUTLINE=block-outline-width] \n          \nSpecifies the width of the block outline in pixels. WOUTLINE= affects both the slice \nand the subgroup outlines."},"StatementOptionType":"V"}]}},{"StatementName":"DONUT","StatementHelp":{"#cdata":"Syntax: DONUT chart-variable(s) </ option(s)>; \n      \nCreates a donut chart in which the size of a pie slice represents the value of the \nchart statistic for that category of data in relation to the total chart statistic \nfor all categories."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ACROSS=","StatementOptionHelp":{"#cdata":"[Syntax: ACROSS=number-of-columns] \n          \nDraws number-of-columns pies across the procedure output area. ACROSS is ignored \nunless you also use the GROUP= option."},"StatementOptionType":"V"},{"StatementOptionName":"ANGLE=","StatementOptionHelp":{"#cdata":"[Syntax: ANGLE=degrees] \n          \nStarts the first slice at the specified angle. A value of 0 for degrees corresponds \nto the three o'clock position."},"StatementOptionType":"V"},{"StatementOptionName":"ANNOTATE=|ANNO=","StatementOptionHelp":{"#cdata":"[Syntax: ANNOTATE=Annotate-data-set] \n          \nSpecifies a data set to annotate charts produced by the PIE, PIE3D, or DONUT statement. \n\nNote: Annotate coordinate systems 1, 2, 7, and 8 (data system coordinates) are not valid \nwith pie or donut charts."},"StatementOptionType":"DV"},{"StatementOptionName":"ASCENDING","StatementOptionHelp":{"#cdata":"Arranges the slices in ascending order of the value of the chart statistic."},"StatementOptionType":"S"},{"StatementOptionName":"CFILL=|CF=","StatementOptionHelp":{"#cdata":"[Syntax: CFILL=fill-color] \n          \nSpecifies one color for all patterns in the chart, regardless of whether the fill \nis solid or hatch."},"StatementOptionType":"C"},{"StatementOptionName":"CLOCKWISE","StatementOptionHelp":{"#cdata":"Draws the slices clockwise starting at the twelve o'clock position."},"StatementOptionType":"S"},{"StatementOptionName":"COUTLINE=|CO=","StatementOptionHelp":{"#cdata":"[Syntax: COUTLINE=slice-outline-color | SAME] \n          \nOutlines all slices, rings (subgroups), and legend values (if a legend appears) in the \nspecified color. SAME specifies that the outline color of a slice or a slice segment or \na legend value is the same as the interior pattern color."},"StatementOptionType":"C"},{"StatementOptionName":"COUTLINE=SAME","StatementOptionHelp":{"#cdata":"[Syntax: COUTLINE=slice-outline-color | SAME] \n          \nOutlines all slices, rings (subgroups), and legend values (if a legend appears) in the \nspecified color. SAME specifies that the outline color of a slice or a slice segment or \na legend value is the same as the interior pattern color."},"StatementOptionType":"S|V"},{"StatementOptionName":"CTEXT=|CT=","StatementOptionHelp":{"#cdata":"[Syntax: CTEXT=text-color] \n          \nSpecifies a color for all text on the axes and legend, including axis labels, tick mark \nvalues, legend labels, and legend value descriptions."},"StatementOptionType":"C"},{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Arranges the slices in descending order of the value of the chart statistic."},"StatementOptionType":"S"},{"StatementOptionName":"DESCRIPTION=|DES=","StatementOptionHelp":{"#cdata":"[Syntax: DESCRIPTION='description'] \n          \nSpecifies the description of the catalog entry for the chart. The maximum length \nfor entry-description is 256 characters."},"StatementOptionType":"V"},{"StatementOptionName":"DETAIL=","StatementOptionHelp":{"#cdata":"[Syntax: DETAIL=variable] \n          \nProduces an inner pie overlay whose slices show the major components that comprise the \nouter pie's slice."},"StatementOptionType":"V"},{"StatementOptionName":"DETAIL_PERCENT=","StatementOptionHelp":{"#cdata":"[Syntax: DETAIL_PERCENT=BEST|NONE] \n          \nSpecifies the algorithm to use for displaying the percentage values for the detail pie slices. \nNONE turns off the display of the percentage values."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BEST","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Specifies the BEST algorithm for displaying the percentage values for the detail pie slices.","@ToolTip2":"Turns off the display of the percentage values."}},{"StatementOptionName":"DETAIL_RADIUS=","StatementOptionHelp":{"#cdata":"[Syntax: DETAIL_RADIUS=percent] \n          \nDetermines the size of the detail pie. Percent specifies the percent of the outer pie \nradius to use as the detail pie radius. The valid range is 25 to 90. The default is 75."},"StatementOptionType":"V"},{"StatementOptionName":"DETAIL_SLICE=","StatementOptionHelp":{"#cdata":"[Syntax: DETAIL_SLICE=BEST|NONE] \n          \nSpecifies the algorithm to use for displaying the detail variable labels for the inner \npie slices. NONE turns off the display of the detail variable labels."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BEST","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Specifies the BEST algorithm for displaying the detail variable labels for the inner pie slices.","@ToolTip2":"Turns off the display of the detail variable labels."}},{"StatementOptionName":"DETAIL_THRESHOLD=","StatementOptionHelp":{"#cdata":"[Syntax: DETAIL_THRESHOLD=percent] \n          \nDetermines whether a detail slice is included in the inner pie. Any detail slice \ncomprising percent or more percent of the whole pie is included. The valid range \nfor percent is 0 to 75. The default is 4."},"StatementOptionType":"V"},{"StatementOptionName":"DETAIL_VALUE=","StatementOptionHelp":{"#cdata":"[Syntax: DETAIL_VALUE=BEST|NONE] \n          \nSpecifies the algorithm to use for displaying the data values for the detail pie slices. \nNONE turns off the display of the data values."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BEST","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Specifies the BEST algorithm for displaying the data values for the detail pie slices.","@ToolTip2":"Turns off the display of the data values."}},{"StatementOptionName":"DISCRETE","StatementOptionHelp":{"#cdata":"Treats a numeric chart variable as a discrete variable rather than as a continuous variable. \nThe GCHART procedure creates a separate midpoint and, hence, a separate grid square and block \nfor each unique value of the chart variable."},"StatementOptionType":"S"},{"StatementOptionName":"DOWN=","StatementOptionHelp":{"#cdata":"[Syntax: DOWN=number-of-rows] \n          \nDraws number-of-rows pies vertically in the procedure output area. The DOWN= option \nis ignored unless you also use the GROUP= option.\n\nIf number-of-rows calls for more pies than fit vertically in the graphics area of the \noutput device, no pies are drawn and an error message is written to the SAS log.\n\nIf you also use the ACROSS= option, the pies are drawn in left-to-right and top-to-bottom order."},"StatementOptionType":"V"},{"StatementOptionName":"EXPLODE=","StatementOptionHelp":{"#cdata":"[Syntax: EXPLODE=value-list] \n          \nPulls the specified slices slightly out from the rest of the pie for added emphasis. \nvalue-list is the list of midpoint values for the slices to be exploded."},"StatementOptionType":"V"},{"StatementOptionName":"FILL=","StatementOptionHelp":{"#cdata":"Specifies the fill pattern for all slices in the chart."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"SOLID","@Value2":"X"},"StatementOptionToolTips":{"@ToolTip1":"Rotates a solid fill through the color list of the current style as many times as necessary.  SOLID is the default.","@ToolTip2":"Rotates a single hatch pattern through the list of colors defined in the current style."}},{"StatementOptionName":"FREQ=","StatementOptionHelp":{"#cdata":"[Syntax: FREQ=numeric-variable] \n          \nSpecifies a variable whose values weight the contribution of each observation in the \ncomputation of the chart statistic."},"StatementOptionType":"NVL"},{"StatementOptionName":"GROUP=","StatementOptionHelp":{"#cdata":"[Syntax: GROUP=group-variable] \n          \nOrganizes the data according to the values of group-variable and produces a separate \npie(or donut) chart for each unique value of group-variable. Group-variable can be either \ncharacter or numeric and is always treated as a discrete variable. The group variable can \nhave up to 12 different values."},"StatementOptionType":"VL"},{"StatementOptionName":"HTML=","StatementOptionHelp":{"#cdata":"[Syntax: HTML=variable] \n          \nIdentifies the variable in the input data set whose values create links in the HTML file \nthat is created by the ODS statement. These links are associated with an area of the chart \nand point to the data or graph that you want to display when the user drills down on the area."},"StatementOptionType":"V"},{"StatementOptionName":"HTML_LEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: HTML_LEGEND=variable] \n          \nIdentifies the variable in the input data set whose values create links in the HTML file \nthat is created by the ODS statement. These links are associated with a legend value and \npoint to the data or graph that you want to display when the user drills down on the value. \nThe values of variable can be up to 1024 characters long. Characters after the 1024-character \nlimit (including any closing quotes) are truncated. If either subgroups or the DETAIL= option \nare specified, then the HTML_LEGEND= option is ignored."},"StatementOptionType":"V"},{"StatementOptionName":"INVISIBLE=","StatementOptionHelp":{"#cdata":"[Syntax: INVISIBLE=value-list] \n          \nMakes the specified slices invisible, as if they had been removed from the pie. Labels \nare not printed for invisible slices. Value-list is the list of midpoint values for the \ninvisible slices."},"StatementOptionType":"V"},{"StatementOptionName":"JSTYLE","StatementOptionHelp":{"#cdata":"Arranges the midpoints in descending order of the statistic value and draws the slices \nclockwise starting at the twelve o'clock position."},"StatementOptionType":"S"},{"StatementOptionName":"LEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: LEGEND=LEGEND<1...99>] \n          \nGenerates a legend for the slice names (midpoint values) instead of printing them beside the slices."},"StatementOptionType":"V"},{"StatementOptionName":"LEVELS=","StatementOptionHelp":{"#cdata":"[Syntax: LEVELS=number-of-midpoints|ALL] \n          \nSpecifies the number of midpoints for a numeric chart variable. The range for each midpoint \nis calculated automatically.\n\nIf you specify LEVELS=ALL, then all unique midpoint values are graphed.\n\nThe LEVELS= option is ignored if any of the following is true:\n\n  o The chart variable is character type.\n  o The MIDPOINTS= option is used."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<number-of-midpoints>","@Value2":"ALL"},"StatementOptionToolTips":{"@ToolTip1":"Replace <number-of-midpoints> with the desired number of midpoints for a numeric chart variable.","@ToolTip2":"Specifies that all unique midpoint values are graphed. If your data contains a large number  of unique midpoint values (over 200), you can use the XPIXELS and YPIXELS GOPTIONS to enable  the device driver to render a larger (and more readable) graph."}},{"StatementOptionName":"MATCHCOLOR","StatementOptionHelp":{"#cdata":"Uses the slice pattern color for all slice labels. MATCHCOLOR overrides the color that \nis specified in the CTEXT= option."},"StatementOptionType":"V"},{"StatementOptionName":"MIDPOINTS=","StatementOptionHelp":{"#cdata":"[Syntax: MIDPOINTS=value-list | OLD] \n          \nSpecifies the midpoint values for the slices. The way you specify value-list depends on the \ntype of variable:\n          \nFor numeric chart variables, value-list is either an explicit list of values, or a starting \nand an ending value with an interval increment, or a combination of both forms: \n\n     n <...n>\n     \n     n TO n <BY increment>\n     \n     n<...n> TO n <BY increment> <n <...n>>\n \nFor character chart variables, value-list is a list of unique character values enclosed in \nquotation marks and separated by blanks: \n\n    'value-1' <...'value-n'> \n    \nMIDPOINTS=OLD generates default midpoints using the Nelder algorithm."},"StatementOptionType":"V"},{"StatementOptionName":"MIDPOINTS=OLD","StatementOptionHelp":{"#cdata":"Generates default midpoints using the Nelder algorithm."},"StatementOptionType":"V"},{"StatementOptionName":"MISSING","StatementOptionHelp":{"#cdata":"Accepts a missing value as a valid midpoint for the chart variable. By default, \nobservations with missing values are ignored."},"StatementOptionType":"S"},{"StatementOptionName":"NAME=","StatementOptionHelp":{"#cdata":"[Syntax: NAME='entry-name'] \n          \nSpecifies the name of the GRSEG catalog entry and the name of the graphics output file, \nif one is created."},"StatementOptionType":"V"},{"StatementOptionName":"NOGROUPHEADING","StatementOptionHelp":{"#cdata":"Suppresses the headings that are normally printed above each pie when you use the GROUP= option."},"StatementOptionType":"S"},{"StatementOptionName":"NOHEADING","StatementOptionHelp":{"#cdata":"Suppresses the heading that is normally printed at the top of each page or display of output \nfor all devices except Java and ActiveX."},"StatementOptionType":"S"},{"StatementOptionName":"NOLEGEND","StatementOptionHelp":{"#cdata":"Suppresses the legend that is automatically generated by the SUBGROUP= option"},"StatementOptionType":"S"},{"StatementOptionName":"OTHER=","StatementOptionHelp":{"#cdata":"[Syntax: OTHER=percent-of-total] \n          \nCollects all midpoints with chart statistic values less than or equal to percent-of-total \ninto a generic midpoint named OTHER."},"StatementOptionType":"V"},{"StatementOptionName":"OTHERCOLOR=","StatementOptionHelp":{"#cdata":"[Syntax: OTHERCOLOR=color] \n          \nSpecifies the color to use for the OTHER slice."},"StatementOptionType":"C"},{"StatementOptionName":"OTHERLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: OTHERLABEL='text-string'] \n          \nSpecifies a text string up to 16 characters for the label for the OTHER slice. The default \nlabel is OTHER."},"StatementOptionType":"V"},{"StatementOptionName":"PERCENT=","StatementOptionHelp":{"#cdata":"Prints the percentage represented by each slice using the specified labeling method."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ARROW","@Value2":"INSIDE","@Value3":"NONE","@Value4":"OUTSIDE"},"StatementOptionToolTips":{"@ToolTip1":"Places the text outside the slice and connects the text to the slice with a line.","@ToolTip2":"Places the text inside the slice. The label overlays the slice fill patterns.","@ToolTip3":"Suppresses the text.","@ToolTip4":"Places the text outside of the slice."}},{"StatementOptionName":"PLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: PLABEL=(text argument(s))] \n          \nDefines the text that is displayed on the pie slice label. Text-argument(s) defines the text \nor the appearance of the label, or both."},"StatementOptionType":"V"},{"StatementOptionName":"RADIUS=","StatementOptionHelp":{"#cdata":"[Syntax: RADIUS=value] \n          \nSpecifies the radius of the pie and donut in GCHART. RADIUS=n, where n is the pie radius in \ncharacter cells."},"StatementOptionType":"V"},{"StatementOptionName":"SLICE=","StatementOptionHelp":{"#cdata":"Controls the position and style of the slice name (midpoint value) for each slice."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ARROW","@Value2":"INSIDE","@Value3":"NONE","@Value4":"OUTSIDE"},"StatementOptionToolTips":{"@ToolTip1":"Places the text outside the slice and connects the text to the slice with a line.","@ToolTip2":"Places the text inside the slice. The label overlays the slice fill patterns.","@ToolTip3":"Suppresses the text.","@ToolTip4":"Places the text outside of the slice."}},{"StatementOptionName":"SUBGROUP=","StatementOptionHelp":{"#cdata":"[Syntax: SUBGROUP=subgroup-variable] \n          \nDivides the chart into concentric rings according to the values of subgroup-variable. \nSubgroup-variable can be either character or numeric and is always treated as a discrete \nvariable."},"StatementOptionType":"VL"},{"StatementOptionName":"SUMVAR=","StatementOptionHelp":{"#cdata":"[Syntax: SUMVAR=summary-variable] \n          \nSpecifies a numeric variable for sum or mean calculations. The GCHART procedure calculates the \nsum or, if requested, the mean of numeric-variable for each midpoint. The resulting statistics \nare represented by the size of the slice and displayed beside of each slice.\n\nWhen you use SUMVAR=, the TYPE= option must be either SUM or MEAN. With SUMVAR=, the default \nis TYPE=SUM."},"StatementOptionType":"VL"},{"StatementOptionName":"TYPE=","StatementOptionHelp":{"#cdata":"Specifies the chart statistic."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FREQ","@Value2":"PERCENT","@Value3":"SUM","@Value4":"MEAN"},"StatementOptionToolTips":{"@ToolTip1":"[Valid if the SUMVAR= option is not used]Frequency","@ToolTip2":"[Valid if the SUMVAR= option is not used]Percentage","@ToolTip3":"[Valid if the SUMVAR= option is used]--Sum","@ToolTip4":"[Valid if the SUMVAR= option is used]--Mean"}},{"StatementOptionName":"URL=","StatementOptionHelp":{"#cdata":"[URL=character-variable \n          \nSpecifies a character variable whose values are URLs. The variable values are URLs for \nWeb pages to display when the user clicks (drills down) on elements in the graph. \n\nRestrictions: This option affects graphics output that is created through the ODS HTML \ndestination only. Not supported by GIF, PNG, and ACTIVEX devices.\n\nInteraction: If you specify both the HTML= and the URL= options, then the URL= option \nis ignored."},"StatementOptionType":"V"},{"StatementOptionName":"VALUE=","StatementOptionHelp":{"#cdata":"Controls the position and style of the slice value (chart statistic) for each slice."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ARROW","@Value2":"INSIDE","@Value3":"NONE","@Value4":"OUTSIDE"},"StatementOptionToolTips":{"@ToolTip1":"Places the text outside the slice and connects the text to the slice with a line.","@ToolTip2":"Places the text inside the slice. The label overlays the slice fill patterns.","@ToolTip3":"Suppresses the text.","@ToolTip4":"Places the text outside of the slice."}},{"StatementOptionName":"WOUTLINE=","StatementOptionHelp":{"#cdata":"[Syntax: WOUTLINE=block-outline-width] \n          \nSpecifies the width of the block outline in pixels. WOUTLINE= affects both the slice \nand the subgroup outlines."},"StatementOptionType":"V"}]}},{"StatementName":"STAR","StatementHelp":{"#cdata":"Syntax: STAR chart-variable(s) </ option(s)>; \n      \nCreates star charts in which the length of the spines represents the value of the chart \nstatistic for each category of data or midpoint. The STAR statement specifies the variable \nor variables that define the categories of data to chart."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ACROSS=","StatementOptionHelp":{"#cdata":"[Syntax: ACROSS=number-of-columns] \n          \nDraws number-of-columns stars across the procedure output area. ACROSS is ignored \nunless you also use the GROUP= option."},"StatementOptionType":"V"},{"StatementOptionName":"ANGLE=","StatementOptionHelp":{"#cdata":"[Syntax: ANGLE=degrees] \n          \nStarts the first slice at the specified angle. A value of 0 for degrees corresponds to the \nthree o'clock position."},"StatementOptionType":"V"},{"StatementOptionName":"ANNOTATE=|ANNO=","StatementOptionHelp":{"#cdata":"[Syntax: ANNOTATE=Annotate-data-set] \n          \nSpecifies a data set to annotate charts produced by the STAR statement."},"StatementOptionType":"DV"},{"StatementOptionName":"ASCENDING","StatementOptionHelp":{"#cdata":"Arranges the bars in ascending order of the value of the chart statistic."},"StatementOptionType":"S"},{"StatementOptionName":"CFILL=|CF=","StatementOptionHelp":{"#cdata":"[Syntax: CFILL=fill-color] \n          \nSpecifies one color for all slices in the chart, regardless of whether the fill is solid or hatch."},"StatementOptionType":"C"},{"StatementOptionName":"COUTLINE=|CO=","StatementOptionHelp":{"#cdata":"[Syntax: COUTLINE=star-outline-color | SAME] \n          \nSpecifies the color for the circle that surrounds the star chart and for the slice outlines or spines. \nSAME specifies that the outline color of a slice is the same as the interior pattern color."},"StatementOptionType":"C"},{"StatementOptionName":"COUTLINE=SAME","StatementOptionHelp":{"#cdata":"[Syntax: COUTLINE=star-outline-color | SAME] \n          \nSpecifies the color for the circle that surrounds the star chart and for the slice outlines or spines. \nSAME specifies that the outline color of a slice is the same as the interior pattern color."},"StatementOptionType":"S"},{"StatementOptionName":"CTEXT=|CT=","StatementOptionHelp":{"#cdata":"[Syntax: CTEXT=text-color] \n          \nSpecifies a color for all text on the axes and legend, including axis labels, tick mark \nvalues, legend labels, and legend value descriptions."},"StatementOptionType":"C"},{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Arranges the bars in descending order of the value of the chart statistic."},"StatementOptionType":"S"},{"StatementOptionName":"DESCRIPTION=|DES=","StatementOptionHelp":{"#cdata":"[Syntax: DESCRIPTION='description'] \n          \nSpecifies the description of the catalog entry for the chart. The maximum length for \nentry-description is 256 characters."},"StatementOptionType":"V"},{"StatementOptionName":"DISCRETE","StatementOptionHelp":{"#cdata":"Treats a numeric chart variable as a discrete variable rather than as a continuous variable. \nThe GCHART procedure creates a separate midpoint and, hence, a separate grid square and block \nfor each unique value of the chart variable."},"StatementOptionType":"S"},{"StatementOptionName":"DOWN=","StatementOptionHelp":{"#cdata":"[Syntax: DOWN=number-of-rows] \n          \nDraws number-of-rows stars vertically in the procedure output area."},"StatementOptionType":"V"},{"StatementOptionName":"FILL=","StatementOptionHelp":{"#cdata":"Specifies the fill pattern for all slices in the chart."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"SOLID","@Value2":"X"},"StatementOptionToolTips":{"@ToolTip1":"Rotates a solid fill through the color list of the current style as many times as necessary.  SOLID is the default.","@ToolTip2":"Rotates a single hatch pattern through the list of colors defined in the current style."}},{"StatementOptionName":"FREQ=","StatementOptionHelp":{"#cdata":"[Syntax: FREQ=numeric-variable] \n          \nSpecifies a variable whose values weight the contribution of each observation in the \ncomputation of the chart statistic."},"StatementOptionType":"NVL"},{"StatementOptionName":"GROUP=","StatementOptionHelp":{"#cdata":"[Syntax: GROUP=group-variable] \n          \nOrganizes the data according to the values of group-variable and produces a separate pie \n(or donut) chart for each unique value of group-variable. Group-variable can be either \ncharacter or numeric and is always treated as a discrete variable. The group variable \ncan have up to 12 different values."},"StatementOptionType":"VL"},{"StatementOptionName":"HTML=","StatementOptionHelp":{"#cdata":"[Syntax: HTML=variable] \n          \nIdentifies the variable in the input data set whose values create links in the HTML \nfile that is created by the ODS statement."},"StatementOptionType":"V"},{"StatementOptionName":"HTML_LEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: HTML_LEGEND=variable] \n          \nIdentifies the variable in the input data set whose values create links in the HTML file \nthat is created by the ODS statement."},"StatementOptionType":"V"},{"StatementOptionName":"LEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: LEGEND=LEGEND<1...99>] \n          \nAssigns the specified LEGEND definition to the legend generated by the SUBGROUP= option."},"StatementOptionType":"V"},{"StatementOptionName":"LEVELS=","StatementOptionHelp":{"#cdata":"[Syntax: LEVELS=number-of-midpoints|ALL] \n          \nSpecifies the number of midpoints for a numeric chart variable. The range for each midpoint is calculated automatically.\n\nIf you specify LEVELS=ALL, then all unique midpoint values are graphed."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<number-of-midpoints>","@Value2":"ALL"},"StatementOptionToolTips":{"@ToolTip1":"Replace <number-of-midpoints> with the desired number of midpoints for a numeric chart variable.","@ToolTip2":"Specifies that all unique midpoint values are graphed."}},{"StatementOptionName":"MATCHCOLOR","StatementOptionHelp":{"#cdata":"Uses the slice pattern color for all slice labels. MATCHCOLOR overrides the color\nthat is specified in the CTEXT= option."},"StatementOptionType":"V"},{"StatementOptionName":"MIDPOINTS=","StatementOptionHelp":{"#cdata":"[Syntax: MIDPOINTS=value-list | OLD] \n          \nSpecifies the midpoint values for the slices. The way you specify value-list depends \non the type of variable: \n          \nFor numeric chart variables, value-list is either an explicit list of values, or a starting \nand an ending value with an interval increment, or a combination of both forms: \n\n     n <...n>\n     \n     n TO n <BY increment>\n     \n     n<...n> TO n <BY increment> <n <...n>>\n \nFor character chart variables, value-list is a list of unique character values enclosed \nin quotation marks and separated by blanks: \n\n    'value-1' <...'value-n'> \n    \nMIDPOINTS=OLD generates default midpoints using the Nelder algorithm."},"StatementOptionType":"V"},{"StatementOptionName":"MIDPOINTS=OLD","StatementOptionHelp":{"#cdata":"Generates default midpoints using the Nelder algorithm."},"StatementOptionType":"V"},{"StatementOptionName":"MISSING","StatementOptionHelp":{"#cdata":"Accepts a missing value as a valid midpoint for the chart variable. By default, \nobservations with missing values are ignored."},"StatementOptionType":"S"},{"StatementOptionName":"NAME=","StatementOptionHelp":{"#cdata":"[Syntax: NAME='entry-name'] \n          \nSpecifies the name of the GRSEG catalog entry and the name of the graphics output file, \nif one is created."},"StatementOptionType":"V"},{"StatementOptionName":"NOCONNECT","StatementOptionHelp":{"#cdata":"Draws only star spines without connecting lines. By default, the spines are connected to form slices."},"StatementOptionType":"S"},{"StatementOptionName":"NOGROUPHEADING","StatementOptionHelp":{"#cdata":"Suppresses the headings that are normally printed above each star when you use the GROUP= option."},"StatementOptionType":"S"},{"StatementOptionName":"NOHEADING","StatementOptionHelp":{"#cdata":"Suppresses the heading that is normally printed at the top of each page or display of output \nfor all devices except Java and ActiveX."},"StatementOptionType":"S"},{"StatementOptionName":"NOLEGEND","StatementOptionHelp":{"#cdata":"Suppresses the legend that is automatically generated by the SUBGROUP= option"},"StatementOptionType":"S"},{"StatementOptionName":"PERCENT=","StatementOptionHelp":{"#cdata":"Prints the percentage represented by each slice using the specified labeling method."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ARROW","@Value2":"INSIDE","@Value3":"NONE","@Value4":"OUTSIDE"},"StatementOptionToolTips":{"@ToolTip1":"Places the text outside the slice and connects the text to the slice with a line.","@ToolTip2":"Places the text inside the slice. The label overlays the slice fill patterns.","@ToolTip3":"Suppresses the text.","@ToolTip4":"Places the text outside of the slice."}},{"StatementOptionName":"SLICE=","StatementOptionHelp":{"#cdata":"Controls the position and style of the slice name (midpoint value) for each slice."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ARROW","@Value2":"INSIDE","@Value3":"NONE","@Value4":"OUTSIDE"},"StatementOptionToolTips":{"@ToolTip1":"Places the text outside the slice and connects the text to the slice with a line.","@ToolTip2":"Places the text inside the slice. The label overlays the slice fill patterns.","@ToolTip3":"Suppresses the text.","@ToolTip4":"Places the text outside of the slice."}},{"StatementOptionName":"STARMAX=","StatementOptionHelp":{"#cdata":"[Syntax: STARMAX=max-value] \n          \nScales the chart so that the outside (or edge) of the circle represents the value that \nis specified by max-value."},"StatementOptionType":"V"},{"StatementOptionName":"STARMIN=","StatementOptionHelp":{"#cdata":"[Syntax: STARMIN=min-value] \n          \nScales the chart so that the center of the circle represents the value that is specified \nby min-value."},"StatementOptionType":"V"},{"StatementOptionName":"SUMVAR=","StatementOptionHelp":{"#cdata":"[Syntax: SUMVAR=summary-variable] \n          \nSpecifies a numeric variable for sum or mean calculations."},"StatementOptionType":"VL"},{"StatementOptionName":"TYPE=","StatementOptionHelp":{"#cdata":"Specifies the chart statistic."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FREQ","@Value2":"PERCENT","@Value3":"SUM","@Value4":"MEAN"},"StatementOptionToolTips":{"@ToolTip1":"[Valid if the SUMVAR= option is not used]--Frequency","@ToolTip2":"[Valid if the SUMVAR= option is not used]--Percentage","@ToolTip3":"[Valid if the SUMVAR= option is used]--Sum","@ToolTip4":"[Valid if the SUMVAR= option is used]--Mean"}},{"StatementOptionName":"URL=","StatementOptionHelp":{"#cdata":"[URL=character-variable \n          \nSpecifies a character variable whose values are URLs. The variable values are URLs for \nWeb pages to display when the user clicks (drills down) on elements in the graph. \n\nRestrictions: This option affects graphics output that is created through the ODS HTML \ndestination only. Not supported by GIF, PNG, and ACTIVEX devices.\n\nInteraction: If you specify both the HTML= and the URL= options, then the URL= option \nis ignored."},"StatementOptionType":"V"},{"StatementOptionName":"VALUE=","StatementOptionHelp":{"#cdata":"Controls the position and style of the slice value (chart statistic) for each slice."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ARROW","@Value2":"INSIDE","@Value3":"NONE","@Value4":"OUTSIDE"},"StatementOptionToolTips":{"@ToolTip1":"Places the text outside the slice and connects the text to the slice with a line.","@ToolTip2":"Places the text inside the slice. The label overlays the slice fill patterns.","@ToolTip3":"Suppresses the text.","@ToolTip4":"Places the text outside of the slice."}},{"StatementOptionName":"WOUTLINE=","StatementOptionHelp":{"#cdata":"[Syntax: WOUTLINE=slice-outline-width] \n          \nSpecifies the width of the block outline in pixels. The WOUTLINE= option affects the \nslice outlines."},"StatementOptionType":"V"}]}},{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nThe BY statement divides the observations from an input data set into groups for processing. \nEach set of contiguous observations with the same value for a specified variable is called a \nBY group. A variable that defines BY groups is called a BY variable and is the variable that \nis specified in the BY statement. When you use a BY statement, the graphics procedure performs \nthe following operations:\n\n  • processes each group of observations independently\n\n  • generates a separate graph or output for each BY group\n\n  • automatically adds a heading called a BY line to each graph identifying the BY group \n    represented in the graph\n\n  • adds BY statement information below the Description field of the catalog entry.\n\nBy default, the procedure expects the observations in the input data set to be sorted \nin ascending order of the BY variable values. \n\nNote: The BY statement in SAS/GRAPH is essentially the same as the BY statement in Base SAS.\nHowever, the effect on the output is different when it is used with SAS/GRAPH procedures."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Indicates that the data set is sorted in descending order by the specified variable. \nThe option affects only the variable that immediately follows the option name, and \nmust be repeated before every variable that is not sorted in ascending order."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations with the same BY value are grouped together, but are not \nnecessarily sorted in alphabetical or numeric order. The observations can be grouped \nin another way, for example, in chronological order.\n\nNOTSORTED can appear anywhere in the BY statement and affects all variables specified \nin the statement. NOTSORTED overrides DESCENDING if both appear in the same BY statement."},"StatementOptionType":"S"}]}},{"StatementName":"NOTE","StatementHelp":{"#cdata":"Syntax: NOTE <text-arguments(s)>; \n      \nControls the content, appearance, and placement of text. \n\ntext-argument(s) can be one or more of these: \n\n \"text-string\"\n \n text-options (text options must precede text-string.)"},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ANGLE=|A=","StatementOptionHelp":{"#cdata":"[Syntax: ANGLE=degrees | A=degrees] \n          \nSpecifies the angle of the baseline of the entire text string with respect to the horizontal. \nA positive degrees value angles the baseline counterclockwise; a negative value angles it\nclockwise. By default, ANGLE=0 (horizontal)."},"StatementOptionType":"V"},{"StatementOptionName":"BCOLOR=|BC=","StatementOptionHelp":{"#cdata":"[Syntax: BCOLOR=background-color] \n          \nSpecifies the background color of a box produced by the BOX= option. If you omit BOX=, BCOLOR= is \nignored. By default, the background color of the box is the same as the background color for the \nentire graph. The color of the frame of the box is determined by the color specification used in BOX=."},"StatementOptionType":"C"},{"StatementOptionName":"BLANK=YES|BL=YES","StatementOptionHelp":{"#cdata":"[Syntax: BLANK=YES] \n          \nProtects the box and its contents from being overwritten by any subsequent graphics elements\nby blanking out the area where the box is displayed. The BLANK= option enables you to overlay \ngraphics elements with boxed text. It is ignored if you omit the BOX= option. Because titles \nand footnotes are written from the highest numbered to the lowest numbered, the BLANK= option \nonly blanks out titles and footnotes of a lower number."},"StatementOptionType":"V"},{"StatementOptionName":"BOX=|BO=","StatementOptionHelp":{"#cdata":"Draws a box around one line of text."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2","@Value3":"3","@Value4":"4"},"StatementOptionToolTips":{"@ToolTip1":"A value of 1 produces the thinnest box lines.","@ToolTip2":"A value of 2 produces the next thinnest box lines.","@ToolTip3":"A value of 3 produces the next thickest box lines.","@ToolTip4":"A value of 4 produces the thickest box lines."}},{"StatementOptionName":"BSPACE=|BS=","StatementOptionHelp":{"#cdata":"[Syntax: BSPACE=box-space<units>] \n          \nSpecifies the amount of space between the boxed text and the box. The space above the text is \nmeasured from the font maximum, and the space below the text is measured from the font minimum.\nBy default, BSPACE=1. If the BOX= option is not used, the BSPACE= option is ignored."},"StatementOptionType":"V"},{"StatementOptionName":"COLOR=|C=|COLOUR=","StatementOptionHelp":{"#cdata":"[Syntax: COLOR=color] \n          \nSpecifies the color for the following text, box, or line. The COLOR= option affects all text, lines, \nand boxes that follow it and stays in effect until another COLOR= specification is encountered."},"StatementOptionType":"C"},{"StatementOptionName":"DRAW=|D=","StatementOptionHelp":{"#cdata":"[Syntax: DRAW=(x,y...,x-n,y-n)<units>] \n          \nDraws lines anywhere on the graphics output area using x and y as absolute or relative coordinates."},"StatementOptionType":"V"},{"StatementOptionName":"FONT=|F=","StatementOptionHelp":{"#cdata":"[Syntax: FONT=font] \n          \nSpecifies the font for the subsequent text."},"StatementOptionType":"V"},{"StatementOptionName":"HEIGHT=|H=","StatementOptionHelp":{"#cdata":"[Syntax: HEIGHT=text-height<units>] \n          \nSpecifies the height of text characters in number of units. By default, HEIGHT=1. Height is \nmeasured from the font minimum to the capline. Ascenders can extend above the capline,\ndepending on the font."},"StatementOptionType":"V"},{"StatementOptionName":"JUSTIFY=|J=","StatementOptionHelp":{"#cdata":"Specifies the alignment of the text string. The default is LEFT."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"LEFT","@Value2":"CENTER","@Value3":"RIGHT"},"StatementOptionToolTips":{"@ToolTip1":"Justify to the left.","@ToolTip2":"Justify to the center.","@ToolTip3":"Justify to the right."}},{"StatementOptionName":"LANGLE=|LA=","StatementOptionHelp":{"#cdata":"[Syntax: LANGLE=degrees] \n          \nSpecifies the angle of the baseline of the entire text string(s) with respect to the horizontal. \nA positive value for degrees moves the baseline counterclockwise; a negative value moves it\nclockwise. By default, LANGLE=0 (horizontal)."},"StatementOptionType":"V"},{"StatementOptionName":"LINK=","StatementOptionHelp":{"#cdata":"[Syntax: LINK= \"URL\"] \n          \nSpecifies a uniform resource locator (URL) that a title or footnote links to. The text-string that \nyou use to specify the URL can contain occurrences of the variables #BYVAL, #BYVAR, and #BYLINE."},"StatementOptionType":"V"},{"StatementOptionName":"LSPACE=|LS=","StatementOptionHelp":{"#cdata":"[Syntax: LSPACE=line-space <units>] \n          \nSpecifies the amount of spacing above lines of note and title text and the amount of spacing \nbelow lines of footnote text."},"StatementOptionType":"V"},{"StatementOptionName":"MOVE=|M=","StatementOptionHelp":{"#cdata":"[Syntax: MOVE=(x,y) <units>] \n          \nPositions subsequent text or lines anywhere on the graphics output area using x and y as absolute \nor relative coordinates."},"StatementOptionType":"V"},{"StatementOptionName":"ROTATE=|R=","StatementOptionHelp":{"#cdata":"[Syntax: ROTATE=degrees] \n          \nSpecifies the angle at which each character of text is rotated with respect to the baseline of the \ntext string. The angle is measured from the current text baseline angle, which is specified by the \nANGLE= or LANGLE= options. By default, the baseline is horizontal. A positive value for degrees rotates\nthe character counterclockwise; a negative value rotates it clockwise. By default, ROTATE=0 (parallel to \nthe baseline)."},"StatementOptionType":"V"},{"StatementOptionName":"UNDERLIN=|U=","StatementOptionHelp":{"#cdata":"Underlines subsequent text."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"0","@Value2":"1","@Value3":"2","@Value4":"3"},"StatementOptionToolTips":{"@ToolTip1":"UNDERLIN=0 halts underlining for subsequent text.","@ToolTip2":"Undelines with the thinnest line.","@ToolTip3":"Undelines with the next thickest line.","@ToolTip4":"Undelines with the thickest line."}},{"StatementOptionName":"WRAP","StatementOptionHelp":{"#cdata":"Wraps the text to a second line if the text does not fit on one line. If the WRAP option is omitted, \nthe text font-size is reduced until the text fits on one line. Wrapping occurs at the last blank \nbefore the text meets the end of the window. If there are no blanks in the text string, then there \nis no wrapping."},"StatementOptionType":"S"}]}}]}}}