{"Procedure":{"Name":"GINSIDE","ProductGroup":"SAS/GRAPH","#comment":{},"ProcedureHelp":{"#cdata":"Syntax: PROC GINSIDE \n    DATA=points-data-set\n    MAP=map-data-set \n    <OUT=output-data-set > \n    <DROPMAPVARS>\n    <INSIDEONLY>\n    <INCLUDEBORDER>\n    <KEEPMAPVARS>;\n    ID d-variable(s); \n\nThe GINSIDE procedure compares a data set of X and Y coordinates to a map dataset containing \nmap polygons. The procedure determines whether the X and Y coordinates for each point fall \ninside of or outside of the map polygons. If the point falls inside of a polygon, then the \nID variable is set to the ID value of that polygon. For example, if a map contains states, \nthen the ID variable of the output data set is set to the state that contains the point. The \nGINSIDE procedure can be used with the SAS/GRAPH map data sets and the results can be used to \nannotate onto a map with the GMAP procedure. \n\nNote: Points that fall on the border of a polygon might give unpredictable results."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=points-data-set] \n      \nSpecifies an input data set that contains the X and Y coordinates of the individual \npoints that are being compared to the map polygons. \n\nNote: If this data set contains the same ID variable (or variables) as does the map, the \nvalue should be set to MISSING so that the points are not considered to be part of the \nboundary of the polygon."},"ProcedureOptionType":"DV|RV"},{"ProcedureOptionName":"MAP=","ProcedureOptionHelp":{"#cdata":"[Syntax: MAP=map-data-set] \n      \nSpecifies the map data set that contains the polygons that you want to compare the points \nin the input data set to. This data must conform to the rules for a map data set and contain \nvariables X and Y and one or more ID variables. The ID statement should name that variable or \nvariables.\n\nNote: The X and Y values in the input data set must be in the same projection system and \nunits as the X and Y in the map data set. So, if the map data set has unprojected X and Y \nvalues in radians, then the point data set X and Y variable values must also be unprojected \nand in radians."},"ProcedureOptionType":"DV|RV"},{"ProcedureOptionName":"DROPMAPVARS|DMV","ProcedureOptionHelp":{"#cdata":"Specifies that the GINSIDE procedure should keep the ID variable but drop all of the other map data \nset variables when writing to the output data set."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"INSIDEONLY","ProcedureOptionHelp":{"#cdata":"Causes the output data set to contain only points that are inside the map polygons. \nBy default, the data set contains all points."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"INCLUDEBORDER","ProcedureOptionHelp":{"#cdata":"Includes points that are on the border of a polygon in the output data set. If any \npoints are on the border of a polygon, then the output data set includes a variable \nnamed _ONBORDER_. If the value of _ONBORDER_ is 1, then the point is located on the \nborder of a polygon.\n\nNote: If a point is on the border between multiple polygons, then the point is assigned \nto the ID of the first polygon whose border it shares (that is, the polygon that is \nprocessed first from the map data set)."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"KEEPMAPVARS|KMV","ProcedureOptionHelp":{"#cdata":"Specifies that the GINSIDE procedure should include all of the map data set variables in the output data set."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"OUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUT=output-data-set] \n      \nSpecifies the output data set for the GINSIDE procedure. The output data set contains all \nof the observations and variables from the input data set, and an ID variable is added."},"ProcedureOptionType":"V"}]},"ProcedureStatements":{"ProcedureStatement":{"StatementName":"ID","StatementHelp":{"#cdata":"Syntax: ID id-variable(s); \n      \nSpecifies the identification variables in the map data set whose polygons will be \nchecked against the points from the input data set."},"StatementOptions":null}}}}