{"Procedure":{"Name":"GKEYMAP","ProductGroup":"SAS/GRAPH","ProcedureHelp":{"#cdata":"Syntax:  PROC GKEYMAP NAME=map-name \n  data-set-argument \n  <option(s)>; \n  \nThe GKEYMAP procedure creates key maps and device maps that compensate for differences \nbetween the way that characters are encoded internally bySAS/GRAPH software and the way \nthat they are encoded by different operating environments and output devices. \n\nIn addition, the GKEYMAP procedure can create SAS data sets from existing key maps and \ndevice maps, either Institute-supplied or user-generated. This capability is useful when \nyou want to make minor alterations in a large key map or device map and you do not want \nto or cannot re-create the original data set with a DATA step. \n\nThe Institute supplies key maps for many keyboard configurations and operating-environment \ncharacter representations. Your SAS Software Consultant should have selected the appropriate \nkey map for your site. If the Institute-supplied device maps and key maps do not meet your \nneeds, you can use this procedure to modify an existing map or create a new one."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"NAME=","ProcedureOptionHelp":{"#cdata":"[Syntax: NAME=map-name] \n      \nIdentifies the map that is to be created or converted to a SAS data set. Key maps are stored \nas map-name.KEYMAP, and device maps are stored as map-name.DEVMAP. The value of the KEYMAP or \nDEVMAP option determines the type of map and the extension added to map-name. It is possible \nto use the same map-name value for both a key map and a device map. \n\nIf you create a key map or device map, the map is stored as an entry in the catalog GFONTn.FONTS \nwhere n is a number from 1 to 9, and you must use a LIBNAME statement to specify a libref for GFONTn.  \n\nIf you specify an existing key map or device map, SAS/GRAPH software searches for the map using \nthe same search path that it uses to search for fonts."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=keymap-data-set] \n      \nIdentifies the input data set for the GKEYMAP procedure. Used only when you are creating \na key map or device map."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"OUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUT=output-data-set] \n      \nIdentifies the output data set to which the data from a key map or device map are to be \nwritten. Used only when you output an existing key map or device map as a SAS data set."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"DEVICE=","ProcedureOptionHelp":{"#cdata":"[Syntax: DEVICE=device-name] \n      \nSpecifies the device driver that a device map is associated with, where device-name \nis the name of an entry in a device catalog. DEVICE= is not required when creating \na device map, but it can be used if you want to limit the use of the device map to \none particular driver. If you do not use DEVICE=, the device map can be used with \nany device. DEVICE= is valid only if you are creating a device map."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"DEVMAP|KEYMAP","ProcedureOptionHelp":{"#cdata":"Specifies whether you are working with a device map or a key map. The default is KEYMAP unless \nyou use an option that can be used only with DEVMAP. This option also specifies the type of map \nyou are outputting as a data set."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"TYPE=","ProcedureOptionHelp":{"#cdata":"Specifies whether you are mapping characters in a device map one-to-one or one-to-many."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"MAP11","@Value2":"MAP1N"},"ProcedureOptionToolTips":{"@ToolTip1":"Each character in a graphics text string is mapped to only one character on the output device.","@ToolTip2":"A single character in a graphics text string can be mapped to multiple characters on the output device."}},{"ProcedureOptionName":"MULTFONT","ProcedureOptionHelp":{"#cdata":"Specifies that an alternate hardware character set is required to display one or more characters \nin the device map. Specify the MULTFONT option only when you create a device map."},"ProcedureOptionType":"S"}]},"ProcedureStatements":null}}