{"Procedure":{"Name":"GLM","#comment":{},"ProductGroup":"SAS/STAT","ProcedureHelp":{"#cdata":"Syntax: PROC GLM <options> ; \n    CLASS variables </ option> ; \n    MODEL dependent-variables=independent-effects </ options> ; \n    ABSORB variables ; \n    BY variables ; \n    FREQ variable ; \n    ID variables ; \n    WEIGHT variable ; \n    CONTRAST ’label’ effect values <...effect values> </ options> ; \n    ESTIMATE ’label’ effect values <...effect values> </ options> ; \n    LSMEANS effects </ options> ; \n    MANOVA <test-options></ detail-options> ; \n    MEANS effects </ options> ; \n    OUTPUT <OUT=SAS-data-set> keyword=names <...keyword=names> </ option> ; \n    RANDOM effects </ options> ; \n    REPEATED factor-specification </ options> ; \n    STORE <OUT=>item-store-name </ LABEL='label'> ; \n    TEST <H=effects> E=effect </ options> ; \n\nThe GLM procedure uses the method of least squares to fit general linear models. Among \nthe statistical methods available in PROC GLM are regression, analysis of variance, analysis \nof covariance, multivariate analysis of variance, and partial correlation.\n\nPROC GLM analyzes data within the framework of general linear models. PROC GLM handles models \nrelating one or several continuous dependent variables to one or several independent variables. \nThe independent variables can be either classification variables, which divide the observations \ninto discrete groups, or continuous variables. Thus, the GLM procedure can be used for many \ndifferent analyses, including the following: \n\n  simple regression, multiple regression, analysis of variance (ANOVA), especially for unbalanced \n  data, analysis of covariance, response surface models, weighted regression, polynomial regression,\n  partial correlation, multivariate analysis of variance (MANOVA), repeated measures analysis of \n  variance"},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"ALPHA=","ProcedureOptionHelp":{"#cdata":"[Syntax: ALPHA=α] \n      \nSpecifies the level of significance \\U+0391 α for 100(1 - α)% confidence intervals."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n        \nNames the SAS data set used by the GLM procedure."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"MANOVA","ProcedureOptionHelp":{"#cdata":"Requests the multivariate mode of eliminating observations with missing values."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"MULTIPASS","ProcedureOptionHelp":{"#cdata":"Requests that PROC GLM reread the input data set, when necessary, instead of writing the values of \ndependent variables to a utility file."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NAMELEN=","ProcedureOptionHelp":{"#cdata":"[Syntax: NAMELEN=n] \n        \nSpecifies the length of effect names to be n characters long, where n is a value between 20 \nand 200 characters. The default length is 20 characters."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NOPRINT","ProcedureOptionHelp":{"#cdata":"Suppresses the normal display of results."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"ORDER=","ProcedureOptionHelp":{"#cdata":"Specifies the sorting order for the levels of the classification variables (specified in the \nCLASS statement)."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"DATA","@Value2":"FORMATTED","@Value3":"FREQ","@Value4":"INTERNAL"},"ProcedureOptionToolTips":{"@ToolTip1":"Orders values according to their order in the input data set.","@ToolTip2":"Orders values by their ascending formatted values. This order depends on your  operating environment.","@ToolTip3":"Orders values by descending frequency count so that levels with the most observations  are listed first.","@ToolTip4":"Orders values by their unformatted values, which yields the same order as PROC SORT.  This order depends on your operating environment."}},{"ProcedureOptionName":"OUTSTAT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUTSTAT=SAS-data-set] \n        \nNames an output data set that contains sums of squares, degrees of freedom, F statistics, \nand probability levels for each effect in the model."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"PLOTS=","ProcedureOptionHelp":{"#cdata":"Controls the plots produced through ODS Graphics. \n        \nSyntax:\n(1) PLOTS <(global-plot-options)> <= plot-request <(options)>> \n(2) PLOTS <(global-plot-options)> <= (plot-request <(options)> <... plot-request <(options)>>)>\n\nThe global plot options include the following: \n\n  MAXPOINTS=NONE | number \n  specifies that plots with elements that require processing of more than number points be \n  suppressed. The default is MAXPOINTS=5000. This limit is ignored if you specify MAXPOINTS=NONE.\n\n  ONLY \n  suppresses the default plots. Only plots specifically requested are displayed. \n\n  UNPACKPANEL | UNPACK \n  suppresses paneling. By default, multiple plots can appear in some output panels. \n  Specify UNPACKPANEL to get each plot in a separate panel."},"ProcedureOptionType":"S|V","ProcedureOptionValues":{"@Value1":"ALL","@Value2":"ANCOVAPLOT","@Value3":"ANOMPLOT","@Value4":"BOXPLOT","@Value5":"CONTOURFIT","@Value6":"CONTROLPLOT","@Value7":"DIAGNOSTICS","@Value8":"DIFFPLOT","@Value9":"FITPLOT","@Value10":"INTPLOT","@Value11":"MEANPLOT","@Value12":"NONE","@Value13":"RESIDUALS"},"ProcedureOptionToolTips":{"@ToolTip1":"Produces all appropriate plots.","@ToolTip2":"Modifies the analysis of covariance plot produced by default when you have an analysis of covariance  model, with one or two CLASS variables and one continuous variable.  Syntax: ANCOVAPLOT<(CLM CLI LIMITS)>    PLOTS=ANCOVAPLOT(CLM) option adds limits for the expected predicted values.    PLOTS=ANCOVAPLOT(CLI) adds limits for new predictions.    Use PLOTS=ANCOVAPLOT(LIMITS) to add both kinds of limits.","@ToolTip3":"Requests an analysis of means display, in which least squares means are compared against an average  least squares mean.","@ToolTip4":"Modifies the plot produced by default for the model effect in a one-way analysis of variance model,  or for an effect specified in the MEANS statement.  Syntax: BOXPLOT<(NPANELPOS=n)>    Suppose the effect has m levels. By default, or if you specify PLOTS=BOXPLOT(NPANELPOS=0), all m  levels of the effect are displayed in a single plot. Specifying a nonzero value of n will result  in P panels, where P is the integer part of m/n + 1. If n > 0, then the levels will be approximately  balanced across the P panels; whereas if n < 0, precisely |n| levels will be displayed on each  panel except possibly the last.","@ToolTip5":"Modifies the contour fit plot produced by default when you have a model involving only two continuous  predictors. The plot displays a contour plot of the predicted surface overlaid with a scatter plot of  the observed data.   Syntax: CONTOURFIT<(OBS=obs-options)>                                   You can use the following obs-options to control how the observations are displayed:     OBS=GRADIENT    specifies that observations are displayed as circles colored by the observed response.    OBS=NONE    suppresses the observations.     OBS=OUTLINE    specifies that observations are displayed as circles with a border but with a completely transparent fill.     OBS=OUTLINEGRADIENT    is the same as OBS=GRADIENT except that a border is shown around each observation. This option is    useful to identify the location of observations where the residuals are small, since at these points    the color of the observations and the color of the surface are indistinguishable. OBS=OUTLINEGRADIENT    is the default if you do not specify any obs-options.","@ToolTip6":"Requests a display in which least squares means are compared against a reference level. LS-mean  control plots are produced only when you specify PDIFF=CONTROL or ADJUST=DUNNETT in the LSMEANS  statement, and in this case they are produced by default.","@ToolTip7":"Requests that a panel of summary diagnostics for the fit be displayed.                                   Syntax: DIAGNOSTICS<(LABEL UNPACK)>  The LABEL option displays labels on observations satisfying RSTUDENT > 2, LEVERAGE > 2p/n, and on  the Cook’s D plot, COOKSD > 4/n, where n is the number of observations used in fitting the model,  and p is the number of parameters in the model. The label is the first ID variable if the ID statement  is specified; otherwise, it is the observation number.","@ToolTip8":"Modifies the plot produced by an LSMEANS statement with the PDIFF=ALL option (or just PDIFF, since ALL is the default argument).  Syntax: DIFFPLOT<(ABS NOABS CENTER NOLINES)>  The ABS and NOABS options determine the positioning of the line segments in the plot. When the ABS  option is in effect, and this is the default, all line segments are shown on the same side of the  reference line. The NOABS option separates comparisons according to the sign of the difference.   The CENTER option marks the center point for each comparison. This point corresponds to the intersection  of two least squares means.   The NOLINES option suppresses the display of the line segments that represent the confidence bounds  for the differences of the least squares means. The NOLINES option implies the CENTER option.","@ToolTip9":"Modifies the fit plot produced by default when you have a model with a single continuous predictor.                                    Syntax: FITPLOT<(NOCLM NOCLI NOLIMITS)>    PLOTS=FITPLOT(NOCLM) option removes the limits on the expected values.    PLOTS=FITPLOT(NOCLI) option removes the limits on new predictions.    PLOTS=FITPLOT(NOLIMITS) option removes both kinds of confidence limits","@ToolTip10":"Modifies the interaction plot produced by default when you have a two-way analysis of variance model,  with just two CLASS variables.  Syntax: INTPLOT<(CLM CLI LIMITS)>    PLOTS=INTPLOT(CLM) option adds limits for the expected predicted values.    PLOTS=INTPLOT(CLI) adds limits for new predictions.    Use PLOTS=ANCOVAPLOT(LIMITS) to add both kinds of limits.","@ToolTip11":"Modifies the grouped box plot produced by an MEANS statement. Upper and lower confidence limits are  plotted when the CL option is used.  Syntax: MEANPLOT<(CL CLBAND CONNECT ASCENDING DESCENDING)>  Upper and lower confidence limits are plotted when the CL option is used.   When the CLBAND option is in effect, confidence limits are shown as bands and the means are connected.   By default, means are not joined by lines. You can achieve that effect with the CONNECT option.  Means are displayed in the same order as they appear in the \"Means\" table.   You can change that order for plotting with the ASCENDING and DESCENDING options.","@ToolTip12":"Specifies that no graphics be displayed.","@ToolTip13":"Requests that scatter plots of the residuals against each continuous covariate be displayed.                                    Syntax: RESIDUALS<(SMOOTH UNPACK)>  The SMOOTH option overlays a Loess smooth on each residual plot. Note that if a WEIGHT variable is  specified, then it is not used to weight the smoother. See Chapter 50, The LOESS Procedure, for  more information.   The UNPACK option unpanels the residual display and produces a series of individual plots that form  the paneled display."},"SubOptionsKeywords":"\n          ONLY|UNPACKPANEL|UNPACK|CLM|CLI|NOCLM|NOCLI|NOLIMITS|LIMITS|OBS=|SMOOTH|\n          CL|CLBAND|CONNECT|ASCENDING|DESCENDING|ABS|NOABS|CENTER|LABEL|NPANELPOS=\n        "}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"ABSORB","StatementHelp":{"#cdata":"Syntax: ABSORB variables ;\n      \nAbsorption is a computational technique that provides a large reduction in time \nand memory requirements for certain types of models. The variables are one or more \nvariables in the input data set."},"StatementOptions":null},{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nYou can specify a BY statement with PROC GLM to obtain separate analyses on observations \nin groups that are defined by the BY variables. When a BY statement appears, the procedure \nexpects the input data set to be sorted in order of the BY variables. If you specify more \nthan one BY statement, only the last one specified is used."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"CLASS","StatementHelp":{"#cdata":"Syntax: CLASS variables </ TRUNCATE> ; \n      \nThe CLASS statement names the classification variables to be used in the model. \nTypical classification variables are Treatment, Sex, Race, Group, and Replication. \nIf you use the CLASS statement, it must appear before the MODEL statement."},"StatementOptions":{"StatementOption":{"StatementOptionName":"TRUNCATE","StatementOptionHelp":{"#cdata":"Specifies that class levels should be determined by using no more than the first 16 characters \nof the formatted values of CLASS variables."},"StatementOptionType":"S"}}},{"StatementName":"MODEL","StatementHelp":{"#cdata":"Syntax: MODEL dependents=independents </ options> ; \n      \nThe MODEL statement names the dependent variables and independent effects."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ALIASING","StatementOptionHelp":{"#cdata":"Specifies that the estimable functions should be displayed as an aliasing structure, \nfor which each row says which linear combination of the parameters is estimated by \neach estimable function."},"StatementOptionType":"S"},{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=α] \n          \nSpecifies the level of significance α for (100(1 - α)% confidence intervals."},"StatementOptionType":"V"},{"StatementOptionName":"CLI","StatementOptionHelp":{"#cdata":"Produces confidence limits for individual predicted values for each observation."},"StatementOptionType":"S"},{"StatementOptionName":"CLM","StatementOptionHelp":{"#cdata":"Produces confidence limits for a mean predicted value for each observation."},"StatementOptionType":"S"},{"StatementOptionName":"CLPARM","StatementOptionHelp":{"#cdata":"Produces confidence limits for the parameter estimates (if the SOLUTION option is also specified) \nand for the results of all ESTIMATE statements."},"StatementOptionType":"S"},{"StatementOptionName":"E","StatementOptionHelp":{"#cdata":"Displays the general form of all estimable functions. This is useful for determining the order of \nparameters when you are writing CONTRAST and ESTIMATE statements."},"StatementOptionType":"S"},{"StatementOptionName":"E1","StatementOptionHelp":{"#cdata":"Displays the Type I estimable functions for each effect in the model and computes the \ncorresponding sums of squares."},"StatementOptionType":"S"},{"StatementOptionName":"E2","StatementOptionHelp":{"#cdata":"Displays the Type II estimable functions for each effect in the model and computes the \ncorresponding sums of squares."},"StatementOptionType":"S"},{"StatementOptionName":"E3","StatementOptionHelp":{"#cdata":"Displays the Type III estimable functions for each effect in the model and computes the \ncorresponding sums of squares."},"StatementOptionType":"S"},{"StatementOptionName":"E4","StatementOptionHelp":{"#cdata":"Displays the Type IV estimable functions for each effect in the model and computes the \ncorresponding sums of squares."},"StatementOptionType":"S"},{"StatementOptionName":"EFFECTSIZE","StatementOptionHelp":{"#cdata":"[Experimental] \n          \nAdds measures of effect size to each analysis of variance table displayed by the \nprocedure, except for those displayed by the TEST option in the RANDOM statement \nand by CONTRAST statements with the E= option."},"StatementOptionType":"S"},{"StatementOptionName":"INTERCEPT|INT","StatementOptionHelp":{"#cdata":"Produces the hypothesis tests associated with the intercept as an effect in the model."},"StatementOptionType":"S"},{"StatementOptionName":"INVERSE|I","StatementOptionHelp":{"#cdata":"Displays the augmented inverse (or generalized inverse) X'X matrix"},"StatementOptionType":"S"},{"StatementOptionName":"NOINT","StatementOptionHelp":{"#cdata":"Omits the intercept parameter from the model. The NOINT option is ignored when you use an \nABSORB statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOUNI","StatementOptionHelp":{"#cdata":"Suppresses the display of univariate statistics."},"StatementOptionType":"S"},{"StatementOptionName":"P","StatementOptionHelp":{"#cdata":"Displays observed, predicted, and residual values for each observation that does not \ncontain missing values for independent variables."},"StatementOptionType":"S"},{"StatementOptionName":"SINGULAR=","StatementOptionHelp":{"#cdata":"[Syntax: SINGULAR=number] \n          \nTunes the sensitivity of the regression routine to linear dependencies in the design."},"StatementOptionType":"V"},{"StatementOptionName":"SOLUTION","StatementOptionHelp":{"#cdata":"Produces a solution to the normal equations (parameter estimates)."},"StatementOptionType":"S"},{"StatementOptionName":"SS1","StatementOptionHelp":{"#cdata":"Displays the sum of squares associated with Type I estimable functions for each effect. \nThese are also displayed by default."},"StatementOptionType":"S"},{"StatementOptionName":"SS2","StatementOptionHelp":{"#cdata":"Displays the sum of squares associated with Type II estimable functions for each effect."},"StatementOptionType":"S"},{"StatementOptionName":"SS3","StatementOptionHelp":{"#cdata":"Displays the sum of squares associated with Type III estimable functions for each effect. These are \nalso displayed by default."},"StatementOptionType":"S"},{"StatementOptionName":"SS4","StatementOptionHelp":{"#cdata":"Displays the sum of squares associated with Type IV estimable functions for each effect."},"StatementOptionType":"S"},{"StatementOptionName":"TOLERANCE","StatementOptionHelp":{"#cdata":"Displays the tolerances used in the SWEEP routine."},"StatementOptionType":"S"},{"StatementOptionName":"XPX","StatementOptionHelp":{"#cdata":"Displays the augmented X'X crossproducts matrix."},"StatementOptionType":"S"},{"StatementOptionName":"ZETA=","StatementOptionHelp":{"#cdata":"[Syntax: ZETA=value] \n          \nTunes the sensitivity of the check for estimability for Type III and Type IV functions."},"StatementOptionType":"V"}]}},{"StatementName":"CONTRAST","StatementHelp":{"#cdata":"Syntax: CONTRAST ’label’ effect values <...effect values> </ options> ; \n\nThe CONTRAST statement enables you to perform custom hypothesis tests by specifying \nan L vector or matrix for testing the univariate hypothesis Lβ=0 or the multivariate \nhypothesis LBM=0. \n\nThere is no limit to the number of CONTRAST statements you can specify, but they must appear \nafter the MODEL statement. In addition, if you use a CONTRAST statement and a MANOVA, REPEATED, \nor TEST statement, appropriate tests for contrasts are carried out as part of the MANOVA, REPEATED, \nor TEST analysis. If you use a CONTRAST statement and a RANDOM statement, the expected mean square \nof the contrast is displayed. As a result of these additional analyses, the CONTRAST statement must \nappear before the MANOVA, REPEATED, RANDOM, or TEST statement. \n\nIn the CONTRAST statement, \n\n  label \n  identifies the contrast on the output. A label is required for every contrast specified. \n  Labels must be enclosed in quotes. \n\n  effect \n  identifies an effect that appears in the MODEL statement, or the INTERCEPT effect. The \n  INTERCEPT effect can be used when an intercept is fitted in the model. You do not need \n  to include all effects that are in the MODEL statement. \n\n  values \n  are constants that are elements of the L vector associated with the effect."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"E=","StatementOptionHelp":{"#cdata":"[Syntax: E=effect] \n          \nSpecifies an error term, which must be one of the effects in the model."},"StatementOptionType":"V"},{"StatementOptionName":"E","StatementOptionHelp":{"#cdata":"Displays the entire L vector. This option is useful in confirming the ordering of \nparameters for specifying L."},"StatementOptionType":"S"},{"StatementOptionName":"ETYPE=","StatementOptionHelp":{"#cdata":"[Syntax: ETYPE=n] \n          \nSpecifies the type (1, 2, 3, or 4, corresponding to a Type I, II, III, or IV test, \nrespectively) of the E= effect."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2","@Value3":"3","@Value4":"4"},"StatementOptionToolTips":{"@ToolTip1":"Corresponds to a Type I test.","@ToolTip2":"Corresponds to a Type II test.","@ToolTip3":"Corresponds to a Type III test.","@ToolTip4":"Corresponds to a Type IV test."}},{"StatementOptionName":"SINGULAR=","StatementOptionHelp":{"#cdata":"[Syntax: SINGULAR=number] \n          \nTunes the estimability checking."},"StatementOptionType":"V"}]}},{"StatementName":"ESTIMATE","StatementHelp":{"#cdata":"Syntax: ESTIMATE ’label’ effect values <...effect values> </ options> ;\n\nThe ESTIMATE statement enables you to estimate linear functions of the parameters by \nmultiplying the vector L by the parameter estimate vector b, resulting in Lb. All of \nthe elements of the L vector might be given, or, if only certain portions of the L \nvector are given, the remaining elements are constructed by PROC GLM from the context. \n\nThere is no limit to the number of ESTIMATE statements that you can specify, but they \nmust appear after the MODEL statement. In the ESTIMATE statement, \n\n  label \n  identifies the estimate on the output. A label is required for every contrast specified. \n  Labels must be enclosed in quotes. \n\n  effect \n  identifies an effect that appears in the MODEL statement, or the INTERCEPT effect. The \n  INTERCEPT effect can be used as an effect when an intercept is fitted in the model. You \n  do not need to include all effects that are in the MODEL statement. \n\n  values \n  are constants that are the elements of the L vector associated with the preceding effect. \n  For example, \n\n     estimate 'A1 VS A2' A  1 -1;\n\n  forms an estimate that is the difference between the parameters estimated for the first \n  and second levels of the CLASS variable A."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DIVISOR=","StatementOptionHelp":{"#cdata":"[Syntax: DIVISOR=number] \n          \nSpecifies a value by which to divide all coefficients so that fractional coefficients \ncan be entered as integer numerators."},"StatementOptionType":"V"},{"StatementOptionName":"E","StatementOptionHelp":{"#cdata":"Displays the entire L vector. This option is useful in confirming the ordering of \nparameters for specifying L."},"StatementOptionType":"S"},{"StatementOptionName":"SINGULAR=","StatementOptionHelp":{"#cdata":"[Syntax: SINGULAR=number] \n          \nTunes the estimability checking."},"StatementOptionType":"V"}]}},{"StatementName":"FREQ|FREQUENCY","StatementHelp":{"#cdata":"Syntax: FREQ variable;\n      \nThe FREQ statement names a variable that provides frequencies for each observation in the \nDATA= data set. Specifically, if n is the value of the FREQ variable for a given observation, \nthen that observation is used n times."},"StatementOptions":null},{"StatementName":"ID","StatementHelp":{"#cdata":"Syntax: ID variables ; \n    \nWhen predicted values are requested as a MODEL statement option, values of the variables \ngiven in the ID statement are displayed beside each observed, predicted, and residual value \nfor identification. \n\nIf you specify the ID statement, it must appear before the first RUN statement or it is ignored."},"StatementOptions":null},{"StatementName":"LSMEANS","StatementHelp":{"#cdata":"Syntax: LSMEANS effects </ options> ;\n     \nLeast squares means (LS-means) are computed for each effect listed in the LSMEANS statement. \nYou can specify only classification effects in the LSMEANS statement—that is, effects that \ncontain only classification variables. You can also specify options to perform multiple \ncomparisons. In contrast to the MEANS statement, the LSMEANS statement performs multiple \ncomparisons on interactions as well as main effects. \n\nLS-means are predicted population margins; that is, they estimate the marginal means over \na balanced population. In a sense, LS-means are to unbalanced designs as class and subclass \narithmetic means are to balanced designs. Each LS-mean is computed as L'b for a certain column \nvector L, where b is the vector of parameter estimates--that is, the solution of the normal \nequations.  \n\nMultiple effects can be specified in one LSMEANS statement, or multiple LSMEANS statements \ncan be used, but they must all appear after the MODEL statement."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ADJUST=","StatementOptionHelp":{"#cdata":"Requests a multiple comparison adjustment for the p-values and confidence limits for \nthe differences of LS-means."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BON","@Value2":"DUNNETT","@Value3":"NELSON","@Value4":"SCHEFFE","@Value5":"SIDAK","@Value6":"SIMULATE","@Value7":"SMM","@Value8":"TUKEY","@Value9":"T"},"StatementOptionToolTips":{"@ToolTip1":"Bonferroni adjustment","@ToolTip2":"Dunnett adjustment (in which the procedure analyzes all differences with a control level)","@ToolTip3":"Nelson adjustment (in which ANOM differences are taken)","@ToolTip4":"Scheffe's adjustment","@ToolTip5":"Sidak adjustment","@ToolTip6":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum  or maximum absolute value of a multivariate t random vector.  Syntax: SIMULATE<(simoptions)>  You can specify the following simoptions in parentheses after the ADJUST=SIMULATE option.       ACC=value      specifies the target accuracy radius γ of a 100(1-ε)% confidence interval for the true      probability content of the estimated (1-α)th quantile. The default value is ACC=0.005.       CVADJUST      specifies that the quantile should be estimated by the control variate adjustment method of     Hsu and Nelson (1998) instead of simply as the quantile of the simulated sample.      EPS=value      specifies the value ε for a 100(1-ε)% confidence interval for the true probability      content of the estimated (1-α)th quantile.       NSAMP=n      specifies the sample size for the simulation.       REPORT      specifies that a report on the simulation should be displayed, including a listing of the parameters,     such as γ, ε, and α, as well as an analysis of various methods for estimating or approximating      the quantile.       SEED=number      specifies an integer used to start the pseudo-random number generator for the simulation.","@ToolTip7":"SMM adjustment","@ToolTip8":"If your data are unbalanced, PROC GLIMMIX uses the approximation described in Kramer (1956)  and identifies the adjustment as \"Tukey-Kramer\" in the results.","@ToolTip9":"The default, which really signifies no adjustment for multiple comparisons."}},{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=α] \n          \nSpecifies the level of significance α for 100(1 - α)% confidence intervals."},"StatementOptionType":"V"},{"StatementOptionName":"AT","StatementOptionHelp":{"#cdata":"[Syntax: AT variable=value] \n          \nEnables you to modify the values of the covariates used in computing LS-means."},"StatementOptionType":"S","SubOptionsKeywords":"MEANS"},{"StatementOptionName":"BYLEVEL","StatementOptionHelp":{"#cdata":"Requests that PROC GLM process the OM data set by each level of the LS-mean effect in question."},"StatementOptionType":"S"},{"StatementOptionName":"CL","StatementOptionHelp":{"#cdata":"Requests confidence limits for the individual LS-means."},"StatementOptionType":"S"},{"StatementOptionName":"COV","StatementOptionHelp":{"#cdata":"Includes variances and covariances of the LS-means in the output data set specified in the \nOUT= option in the LSMEANS statement."},"StatementOptionType":"S"},{"StatementOptionName":"E","StatementOptionHelp":{"#cdata":"Requests that the L coefficients for all LSMEANS effects be displayed."},"StatementOptionType":"S"},{"StatementOptionName":"E=","StatementOptionHelp":{"#cdata":"[Syntax: E=effect] \n          \nSpecifies an effect in the model to use as an error term."},"StatementOptionType":"V"},{"StatementOptionName":"ETYPE=","StatementOptionHelp":{"#cdata":"[Syntax: ETYPE=n] \n          \nSpecifies the type (1, 2, 3, or 4, corresponding to a Type I, II, III, or IV test, \nrespectively) of the E= effect."},"StatementOptionType":["V","V"],"StatementOptionValues":{"@Value1":"1","@Value2":"2","@Value3":"3","@Value4":"4"},"StatementOptionToolTips":{"@ToolTip1":"Corresponds to a Type I test.","@ToolTip2":"Corresponds to a Type II test.","@ToolTip3":"Corresponds to a Type III test.","@ToolTip4":"Corresponds to a Type IV test."}},{"StatementOptionName":"LINES","StatementOptionHelp":{"#cdata":"Presents results of comparisons between all pairs of means (specified by the PDIFF=ALL option)\nby listing the means in descending order and indicating nonsignificant subsets by line segments\nbeside the corresponding means."},"StatementOptionType":"S"},{"StatementOptionName":"NOPRINT","StatementOptionHelp":{"#cdata":"Suppresses the normal display of results from the LSMEANS statement."},"StatementOptionType":"S"},{"StatementOptionName":"OBSMARGINS|OM","StatementOptionHelp":{"#cdata":"Specifies a potentially different weighting scheme for the computation of LS-means coefficients."},"StatementOptionType":"S"},{"StatementOptionName":"OUT=","StatementOptionHelp":{"#cdata":"[Syntax: OUT=SAS-data-set] \n          \nCreates an output data set that contains the values, standard errors, and, optionally, \nthe covariances (see the COV option) of the LS-means."},"StatementOptionType":"DV"},{"StatementOptionName":"PDIFF=|DIFF=","StatementOptionHelp":{"#cdata":"[Syntax: PDIFF<=difftype>] \n          \nRequests that p-values for differences of the LS-means be produced. The optional \ndifftype specifies which differences to display. Possible values for difftype are \nALL, CONTROL, CONTROLL, CONTROLU, and ANOM. If no difftype is specified, the default \nfor the ADJUST= option is T (that is, no adjustment)."},"StatementOptionType":"S|V","StatementOptionValues":{"@Value1":"ALL","@Value2":"ANOM","@Value3":"CONTROL","@Value4":"CONTROLL","@Value5":"CONTROLU"},"StatementOptionToolTips":{"@ToolTip1":"Requests all pairwise differences, and it is the default.","@ToolTip2":"Requests differences between each LS-mean and the average LS-mean, as in the analysis of means (Ott 1967).","@ToolTip3":"Requests the differences with a control, which, by default, is the first level of each of the  specified LSMEANS effects.","@ToolTip4":"Tests whether the noncontrol levels are significantly smaller than the control; the upper confidence  limits for the control minus the noncontrol levels are considered to be infinity and are displayed as missing.","@ToolTip5":"Tests whether the noncontrol levels are significantly larger than the control; the upper confidence  limits for the noncontrol levels minus the control are considered to be infinity and are displayed as missing."}},{"StatementOptionName":"SLICE=","StatementOptionHelp":{"#cdata":"[Syntax:SLICE=fixed-effect] \n          \nSpecifies effects by which to partition interaction LSMEANS effects."},"StatementOptionType":"V"},{"StatementOptionName":"SINGULAR=","StatementOptionHelp":{"#cdata":"[Syntax: SINGULAR=number] \n          \nTunes the estimability checking."},"StatementOptionType":"V"},{"StatementOptionName":"STDERR","StatementOptionHelp":{"#cdata":"Produces the standard error of the LS-means and the probability level for the hypothesis \nHo: LS-mean = 0."},"StatementOptionType":"S"},{"StatementOptionName":"TDIFF","StatementOptionHelp":{"#cdata":"Produces the t values for all hypotheses Ho: LS-mean(i) = LS-mean(j) and the corresponding \nprobabilities."},"StatementOptionType":"S"}]}},{"StatementName":"MANOVA","StatementHelp":{"#cdata":"Syntax: MANOVA <test-options> <detail-options> ;\n      \nIf the MODEL statement includes more than one dependent variable, you can perform \nmultivariate analysis of variance with the MANOVA statement. The test-options define \nwhich effects to test, while the detail-options specify how to execute the tests and \nwhat results to display."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"H=","StatementOptionHelp":{"#cdata":"Specifies effects in the preceding model to use as hypothesis matrices."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<effects>","@Value2":"INTERCEPT","@Value3":"_ALL_"},"StatementOptionToolTips":{"@ToolTip1":"Replace <effects> with a list of effects listed in the MODEL statement.","@ToolTip2":"Produces tests for the intercept.","@ToolTip3":"Produces tests for all effects listed in the MODEL statement."}},{"StatementOptionName":"E=","StatementOptionHelp":{"#cdata":"[Syntax: E=effect] \n          \nSpecifies the error effect."},"StatementOptionType":"V"},{"StatementOptionName":"M=","StatementOptionHelp":{"#cdata":"Syntax: M=equation,...,equation | (row-of-matrix,...,row-of-matrix)\n          \nSpecifies a transformation matrix for the dependent variables listed in the \nMODEL statement."},"StatementOptionType":"V"},{"StatementOptionName":"MNAMES=","StatementOptionHelp":{"#cdata":"[Syntax: MNAMES=names] \n          \nProvides names for the variables defined by the equations in the M= specification."},"StatementOptionType":"V"},{"StatementOptionName":"PREFIX=","StatementOptionHelp":{"#cdata":"[Syntax: PREFIX=name] \n          \nIs an alternative means of identifying the transformed variables defined by the \nM= specification."},"StatementOptionType":"V"},{"StatementOptionName":"CANONICAL","StatementOptionHelp":{"#cdata":"Displays a canonical analysis of the H and E matrices (transformed by the M matrix, \nif specified) instead of the default display of characteristic roots and vectors."},"StatementOptionType":"S"},{"StatementOptionName":"ETYPE=","StatementOptionHelp":{"#cdata":"[Syntax: ETYPE=n] \n          \nSpecifies the type (1, 2, 3, or 4, corresponding to a Type I, II, III, or IV test, \nrespectively) of the E matrix, the SSCP matrix associated with the E= effect."},"StatementOptionType":["V","V"],"StatementOptionValues":{"@Value1":"1","@Value2":"2","@Value3":"3","@Value4":"4"},"StatementOptionToolTips":{"@ToolTip1":"Corresponds to a Type I test.","@ToolTip2":"Corresponds to a Type II test.","@ToolTip3":"Corresponds to a Type III test.","@ToolTip4":"Corresponds to a Type IV test."}},{"StatementOptionName":"HTYPE=","StatementOptionHelp":{"#cdata":"[Syntax: HTYPE=n] \n          \nSpecifies the type (1, 2, 3, or 4, corresponding to a Type I, II, III, or IV test, \nrespectively) of the H matrix. See the ETYPE= option for more details."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2","@Value3":"3","@Value4":"4"},"StatementOptionToolTips":{"@ToolTip1":"Corresponds to a Type I test.","@ToolTip2":"Corresponds to a Type II test.","@ToolTip3":"Corresponds to a Type III test.","@ToolTip4":"Corresponds to a Type IV test."}},{"StatementOptionName":"MSTAT=","StatementOptionHelp":{"#cdata":"Specifies the method of evaluating the multivariate test statistics."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FAPPROX","@Value2":"EXACT"},"StatementOptionToolTips":{"@ToolTip1":"Specifies that the multivariate tests are evaluated using the usual approximations based on the  F distribution.","@ToolTip2":"ComputeS exact p-values for three of the four tests (Wilks’ lambda, the Hotelling-Lawley trace,  and Roy’s greatest root) and an improved F approximation for the fourth (Pillai’s trace)."}},{"StatementOptionName":"ORTH","StatementOptionHelp":{"#cdata":"Requests that the transformation matrix in the M= specification of the MANOVA statement be \northonormalized by rows before the analysis."},"StatementOptionType":"S"},{"StatementOptionName":"PRINTE","StatementOptionHelp":{"#cdata":"Displays the error SSCP matrix E."},"StatementOptionType":"S"},{"StatementOptionName":"PRINTH","StatementOptionHelp":{"#cdata":"Displays the hypothesis SSCP matrix H associated with each effect specified by the H= specification."},"StatementOptionType":"S"},{"StatementOptionName":"SUMMARY","StatementOptionHelp":{"#cdata":"Produces analysis-of-variance tables for each dependent variable."},"StatementOptionType":"S"}]}},{"StatementName":"MEANS","StatementHelp":{"#cdata":"Syntax: MEANS effects </ options> ;\n      \nWithin each group corresponding to each effect specified in the MEANS statement, PROC GLM \ncomputes the arithmetic means and standard deviations of all continuous variables in the \nmodel (both dependent and independent)."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=α] \n          \nSpecifies the level of significance α for comparisons among the means. By default, \nα=0.05. You can specify any value greater than 0 and less than 1."},"StatementOptionType":"V"},{"StatementOptionName":"BON","StatementOptionHelp":{"#cdata":"Performs Bonferroni t tests of differences between means for all main effect means in the \nMEANS statement."},"StatementOptionType":"S"},{"StatementOptionName":"CLM","StatementOptionHelp":{"#cdata":"Presents results of the BON, GABRIEL, SCHEFFE, SIDAK,SMM, T, and LSD options as intervals \nfor the mean of each level of the variables specified in the MEANS statement."},"StatementOptionType":"S"},{"StatementOptionName":"CLDIFF","StatementOptionHelp":{"#cdata":"Presents results of the BON, GABRIEL, SCHEFFE, SIDAK,SMM, GT2, T, LSD, and TUKEY options \nas confidence intervals for all pairwise differences between means, and the results of \nthe DUNNETT, DUNNETTU, and DUNNETTL options as confidence intervals for differences with \nthe control."},"StatementOptionType":"S"},{"StatementOptionName":"DEPONLY","StatementOptionHelp":{"#cdata":"Displays only means for the dependent variables."},"StatementOptionType":"S"},{"StatementOptionName":"DUNCAN","StatementOptionHelp":{"#cdata":"Performs Duncan’s multiple range test on all main effect means given in the MEANS statement."},"StatementOptionType":"S"},{"StatementOptionName":"DUNNETT","StatementOptionHelp":{"#cdata":"[Syntax: DUNNETT <(formatted-control-values)>] \n          \nPerforms Dunnett’s two-tailed t test, testing if any treatments are significantly \ndifferent from a single control for all main effects means in the MEANS statement."},"StatementOptionType":"S"},{"StatementOptionName":"DUNNETTL","StatementOptionHelp":{"#cdata":"[Syntax: DUNNETTL <(formatted-control-value)>] \n          \nPerforms Dunnett’s one-tailed t test, testing if any treatment is significantly \nless than the control."},"StatementOptionType":"S"},{"StatementOptionName":"DUNNETTU","StatementOptionHelp":{"#cdata":"[Syntax: DUNNETTU <(formatted-control-value)>] \n          \nPerforms Dunnett’s one-tailed t test, testing if any treatment is significantly \ngreater than the control."},"StatementOptionType":"S"},{"StatementOptionName":"E=","StatementOptionHelp":{"#cdata":"[Syntax: E=effect] \n          \nSpecifies the error mean square used in the multiple comparisons."},"StatementOptionType":"V"},{"StatementOptionName":"ETYPE=","StatementOptionHelp":{"#cdata":"[Syntax: ETYPE=n] \n          \nSpecifies the type of mean square for the error effect."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2","@Value3":"3","@Value4":"4"},"StatementOptionToolTips":{"@ToolTip1":"Corresponds to a Type I test.","@ToolTip2":"Corresponds to a Type II test.","@ToolTip3":"Corresponds to a Type III test.","@ToolTip4":"Corresponds to a Type IV test."}},{"StatementOptionName":"GABRIEL","StatementOptionHelp":{"#cdata":"Performs Gabriel’s multiple-comparison procedure on all main effect means in the MEANS statement."},"StatementOptionType":"S"},{"StatementOptionName":"HOVTEST=","StatementOptionHelp":{"#cdata":"Requests a homogeneity of variance test for the groups defined by the MEANS effect."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BARTLETT","@Value2":"BF","@Value3":"LEVENE","@Value4":"OBRIEN"},"StatementOptionToolTips":{"@ToolTip1":"Specifies Bartlett’s test, a modification of the normal-theory likelihood ratio test.","@ToolTip2":"Specifies Brown and Forsythe’s variation of Levene’s test","@ToolTip3":"Specifies Levene’s test, which is widely considered to be the standard homogeneity of variance test.                                     Syntax: LEVENE <( TYPE= ABS | SQUARE )>","@Value4":"OBRIEN <                                     You can use the TYPE= option in parentheses to specify whether to use the absolute residuals (TYPE=ABS)  or the squared residuals (TYPE=SQUARE) in Levene’s test. TYPE=SQUARE is the default.","@ToolTip4":"Specifies O’Brien’s test, which is basically a modification of HOVTEST=LEVENE(TYPE=SQUARE).                                     Syntax: OBRIEN <( W=number )>  You can use the W= option in parentheses to tune the variable to match the suspected kurtosis  of the underlying distribution. By default, W=0.5, as suggested by O’Brien (1979, 1981)."}},{"StatementOptionName":"HTYPE=","StatementOptionHelp":{"#cdata":"[Syntax: HTYPE=n] \n          \nSpecifies the MS type for the hypothesis MS."},"StatementOptionType":"S"},{"StatementOptionName":"KRATIO=","StatementOptionHelp":{"#cdata":"[Syntax: KRATIO=value] \n          \nSpecifies the Type 1/Type 2 error seriousness ratio for the Waller-Duncan test.\nReasonable values for KRATIO are 50, 100, and 500, which roughly correspond for \nthe two-level case to ALPHA levels of 0.1, 0.05, and 0.01. \n\nBy default, the procedure uses the default value of 100."},"StatementOptionType":"V"},{"StatementOptionName":"LINES","StatementOptionHelp":{"#cdata":"Presents results of the BON, DUNCAN, GABRIEL, REGWQ, SCHEFFE, SIDAK,SMM, GT2, SNK, T,  \nLSD TUKEY, and WALLER options by listing the means in descending order and indicating \nnonsignificant subsets by line segments beside the corresponding means."},"StatementOptionType":"S"},{"StatementOptionName":"T|LSD","StatementOptionHelp":{"#cdata":"Performs pairwise t tests, equivalent to Fisher’s least-significant-difference test in the \ncase of equal cell sizes, for all main effect means in the MEANS statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOSORT","StatementOptionHelp":{"#cdata":"Prevents the means from being sorted into descending order when the CLDIFF or CLM option \nis specified."},"StatementOptionType":"S"},{"StatementOptionName":"REGWQ","StatementOptionHelp":{"#cdata":"Performs the Ryan-Einot-Gabriel-Welsch multiple range test on all main effect means in the MEANS statement."},"StatementOptionType":"S"},{"StatementOptionName":"SCHEFFE","StatementOptionHelp":{"#cdata":"Performs Scheffé’s multiple-comparison procedure on all main effect means in the MEANS statement."},"StatementOptionType":"S"},{"StatementOptionName":"SIDAK","StatementOptionHelp":{"#cdata":"Performs pairwise t tests on differences between means with levels adjusted according \nto Sidak’s inequality for all main-effect means in the MEANS statement."},"StatementOptionType":"S"},{"StatementOptionName":"SMM|GT2","StatementOptionHelp":{"#cdata":"Performs pairwise comparisons based on the studentized maximum modulus and Sidak’s \nuncorrelated-t inequality, yielding Hochberg’s GT2 method when sample sizes are \nunequal, for all main effect means in the MEANS statement"},"StatementOptionType":"S"},{"StatementOptionName":"SNK","StatementOptionHelp":{"#cdata":"Performs the Student-Newman-Keuls multiple range test on all main effect means in the \nMEANS statement."},"StatementOptionType":"S"},{"StatementOptionName":"TUKEY","StatementOptionHelp":{"#cdata":"Performs Tukey’s studentized range test (HSD) on all main effect means in the MEANS statement."},"StatementOptionType":"S"},{"StatementOptionName":"WALLER","StatementOptionHelp":{"#cdata":"Performs the Waller-Duncan k-ratio t test on all main effect means in the MEANS statement."},"StatementOptionType":"S"},{"StatementOptionName":"WELCH","StatementOptionHelp":{"#cdata":"Requests Welch’s variance-weighted one-way ANOVA."},"StatementOptionType":"S"}]}},{"StatementName":"REPEATED","StatementHelp":{"#cdata":"Syntax: REPEATED factor-specification </ options> ;\n      \nWhen values of the dependent variables in the MODEL statement represent repeated \nmeasurements on the same experimental unit, the REPEATED statement enables you to \ntest hypotheses about the measurement factors (often called within-subject factors), \nas well as the interactions of within-subject factors with independent variables in \nthe MODEL statement (often called between-subject factors). \n\nThe factor-specification for the REPEATED statement can include any number of individual \nfactor specifications, separated by commas, of the following form: \n\n    factor-name levels < (level-values) > < transformation > \n  \n  where:\n\n  factor-name \n  names a factor to be associated with the dependent variables. The name should not be \n  the same as any variable name that already exists in the data set being analyzed and \n  should conform to the usual conventions of SAS variable names. \n\n  When specifying more than one factor, list the dependent variables in the MODEL statement \n  so that the within-subject factors defined in the REPEATED statement are nested; that is, \n  the first factor defined in the REPEATED statement should be the one with values that change \n  least frequently. \n\n  levels \n  gives the number of levels associated with the factor being defined. When there is only \n  one within-subject factor, the number of levels is equal to the number of dependent \n  variables. In this case, levels is optional. When more than one within-subject factor \n  is defined, however, levels is required, and the product of the number of levels of all \n  the factors must equal the number of dependent variables in the MODEL statement. \n\n  (level-values) \n  gives values that correspond to levels of a repeated-measures factor. These values are \n  used to label output and as spacings for constructing orthogonal polynomial contrasts if \n  you specify a POLYNOMIAL transformation. The number of values specified must correspond \n  to the number of levels for that factor in the REPEATED statement. Enclose the level-values \n  in parentheses."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"CONTRAST","StatementOptionHelp":{"#cdata":"[transformation keyword][Syntax: CONTRAST<(ordinal-reference-level)>]\n          \nGenerates contrasts between levels of the factor and a reference level. By default, the procedure \nuses the last level as the reference level; you can optionally specify a reference level in parentheses \nafter the keyword CONTRAST. The reference level corresponds to the ordinal value of the level rather \nthan the level value specified. For example, to generate contrasts between the first level of a factor \nand the other levels, use \n\n   contrast(1)"},"StatementOptionType":"RS"},{"StatementOptionName":"HELMERT","StatementOptionHelp":{"#cdata":"[transformation keyword] \n          \nGenerates contrasts between each level of the factor and the mean of subsequent levels."},"StatementOptionType":"RS"},{"StatementOptionName":"IDENTITY","StatementOptionHelp":{"#cdata":"[transformation keyword] \n          \nGenerates an identity transformation corresponding to the associated factor."},"StatementOptionType":"RS"},{"StatementOptionName":"MEAN","StatementOptionHelp":{"#cdata":"[transformation keyword][Syntax: MEAN<(ordinal-reference-level)>]\n          \nGenerates contrasts between levels of the factor and the mean of all other levels of the factor. \nSpecifying a reference level eliminates the contrast between that level and the mean. Without a \nreference level, the contrast involving the last level is omitted. See the CONTRAST transformation \nfor an example."},"StatementOptionType":"RS"},{"StatementOptionName":"POLYNOMIAL","StatementOptionHelp":{"#cdata":"[transformation keyword] \n          \nGenerates orthogonal polynomial contrasts. Level values, if provided, are used \nas spacings in the construction of the polynomials; otherwise, equal spacing \nis assumed."},"StatementOptionType":"RS"},{"StatementOptionName":"PROFILE","StatementOptionHelp":{"#cdata":"[transformation keyword]Generates contrasts between adjacent levels of the factor."},"StatementOptionType":"RS"},{"StatementOptionName":"CANONICAL","StatementOptionHelp":{"#cdata":"Performs a canonical analysis of the H and E matrices corresponding to the transformed variables specified \nin the REPEATED statement."},"StatementOptionType":"S"},{"StatementOptionName":"HTYPE=","StatementOptionHelp":{"#cdata":"[Syntax: HTYPE=n] \n          \nSpecifies the type of the H matrix used in the multivariate tests and the type of sums \nof squares used in the univariate tests."},"StatementOptionType":"V"},{"StatementOptionName":"MEAN","StatementOptionHelp":{"#cdata":"Generates the overall arithmetic means of the within-subject variables."},"StatementOptionType":"S"},{"StatementOptionName":"MSTAT=","StatementOptionHelp":{"#cdata":"Specifies the method of evaluating the multivariate test statistics."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FAPPROX","@Value2":"EXACT"},"StatementOptionToolTips":{"@ToolTip1":"Specifies that the multivariate tests are evaluated by using the usual approximations based on the  F distribution.","@ToolTip2":"Computes exact p-values for three of the four tests (Wilks’ lambda, the Hotelling-Lawley trace,  and Roy’s greatest root) and an improved F-approximation for the fourth (Pillai’s trace)."}},{"StatementOptionName":"NOM","StatementOptionHelp":{"#cdata":"Displays only the results of the univariate analyses."},"StatementOptionType":"S"},{"StatementOptionName":"NOU","StatementOptionHelp":{"#cdata":"Displays only the results of the multivariate analyses."},"StatementOptionType":"S"},{"StatementOptionName":"PRINTE","StatementOptionHelp":{"#cdata":"Displays the E matrix for each combination of within-subject factors, as well as partial correlation \nmatrices for both the original dependent variables and the variables defined by the transformations \nspecified in the REPEATED statement."},"StatementOptionType":"S"},{"StatementOptionName":"PRINTH","StatementOptionHelp":{"#cdata":"Displays the H (SSCP) matrix associated with each multivariate test."},"StatementOptionType":"S"},{"StatementOptionName":"PRINTM","StatementOptionHelp":{"#cdata":"Displays the transformation matrices that define the contrasts in the analysis."},"StatementOptionType":"S"},{"StatementOptionName":"PRINTRV","StatementOptionHelp":{"#cdata":"Produces the characteristic roots and vectors for each multivariate test."},"StatementOptionType":"S"},{"StatementOptionName":"SUMMARY","StatementOptionHelp":{"#cdata":"Produces analysis-of-variance tables for each contrast defined by the within-subjects factors."},"StatementOptionType":"S"}],"IgnoreDuplicateName":null}},{"StatementName":"TEST","StatementHelp":{"#cdata":"Syntax: TEST <H=effects> E=effect </ options> ; \n      \nBy default, for each sum of squares in the analysis an F value is computed that uses \nthe residual MS as an error term. Use a TEST statement to request additional F tests \nthat use other effects as error terms."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"H=","StatementOptionHelp":{"#cdata":"[Syntax: H=effects] \n          \nSpecifies which effects in the preceding model are to be used as hypothesis \n(numerator) effects."},"StatementOptionType":"RV"},{"StatementOptionName":"E=","StatementOptionHelp":{"#cdata":"[Syntax: E=effect] \n          \nSpecifies one, and only one, effect to use as the error (denominator) term. \nThe E= specification is required."},"StatementOptionType":"RV"},{"StatementOptionName":"ETYPE=","StatementOptionHelp":{"#cdata":"[Syntax: ETYPE=n] \n          \nSpecifies the type of sum of squares to use for the error term. The type must be \na type computed in the model (n=1, 2, 3, or 4)."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2","@Value3":"3","@Value4":"4"},"StatementOptionToolTips":{"@ToolTip1":"Corresponds to a Type I test.","@ToolTip2":"Corresponds to a Type II test.","@ToolTip3":"Corresponds to a Type III test.","@ToolTip4":"Corresponds to a Type IV test."}},{"StatementOptionName":"HTYPE=","StatementOptionHelp":{"#cdata":"[Syntax: HTYPE=n] \n          \nSpecifies the type of sum of squares to use for the hypothesis. The type must be a type \ncomputed in the model (n=1, 2, 3, or 4)."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2","@Value3":"3","@Value4":"4"},"StatementOptionToolTips":{"@ToolTip1":"Corresponds to a Type I test.","@ToolTip2":"Corresponds to a Type II test.","@ToolTip3":"Corresponds to a Type III test.","@ToolTip4":"Corresponds to a Type IV test."}}]}},{"StatementName":"OUTPUT","StatementHelp":{"#cdata":"Syntax: OUTPUT <OUT=SAS-data-set> keyword=names <...keyword=names> </ option> ; \n      \nThe OUTPUT statement creates a new SAS data set that saves diagnostic measures calculated \nafter fitting the model. At least one specification of the form keyword=names is required."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"COOKD=","StatementOptionHelp":{"#cdata":"Cook’s D influence statistic"},"StatementOptionType":"RV"},{"StatementOptionName":"COVRATIO=","StatementOptionHelp":{"#cdata":"Standard influence of observation on covariance of parameter estimates"},"StatementOptionType":"RV"},{"StatementOptionName":"DFFITS=","StatementOptionHelp":{"#cdata":"Standard influence of observation on predicted value"},"StatementOptionType":"RV"},{"StatementOptionName":"H=","StatementOptionHelp":{"#cdata":"Leverage, hi = xi(X'X)⁻¹x'i"},"StatementOptionType":"RV"},{"StatementOptionName":"LCL=","StatementOptionHelp":{"#cdata":"Lower bound of a 100(1 - p)% confidence interval for an individual prediction."},"StatementOptionType":"RV"},{"StatementOptionName":"LCLM=","StatementOptionHelp":{"#cdata":"Lower bound of a 100(1 - p)% confidence interval for the expected value (mean) of the predicted value."},"StatementOptionType":"RV"},{"StatementOptionName":"PREDICTED=|P=","StatementOptionHelp":{"#cdata":"Predicted values"},"StatementOptionType":"RV"},{"StatementOptionName":"PRESS=","StatementOptionHelp":{"#cdata":"Residual for the th observation that results from dropping it and predicting it on the basis of all other \nobservations."},"StatementOptionType":"RV"},{"StatementOptionName":"RESIDUAL=|R=","StatementOptionHelp":{"#cdata":"Residuals, calculated as ACTUAL - PREDICTED"},"StatementOptionType":"RV"},{"StatementOptionName":"RSTUDENT=","StatementOptionHelp":{"#cdata":"A studentized residual with the current observation deleted"},"StatementOptionType":"RV"},{"StatementOptionName":"STDI=","StatementOptionHelp":{"#cdata":"Standard error of the individual predicted value"},"StatementOptionType":"RV"},{"StatementOptionName":"STDP=","StatementOptionHelp":{"#cdata":"Standard error of the mean predicted value"},"StatementOptionType":"RV"},{"StatementOptionName":"STDR=","StatementOptionHelp":{"#cdata":"Standard error of the residual"},"StatementOptionType":"RV"},{"StatementOptionName":"STUDENT=","StatementOptionHelp":{"#cdata":"Studentized residuals, the residual divided by its standard error"},"StatementOptionType":"RV"},{"StatementOptionName":"UCL=","StatementOptionHelp":{"#cdata":"Upper bound of a 100(1 - p)% confidence interval for an individual prediction. The p-level \nis equal to the value of the ALPHA= option in the OUTPUT statement or, if this option is \nnot specified, to the ALPHA= option in the PROC GLM statement. If neither of these options \nis set, then p=0.05 by default, resulting in the upper bound for a 95% confidence interval."},"StatementOptionType":"RV"},{"StatementOptionName":"UCLM=","StatementOptionHelp":{"#cdata":"Upper bound of a 100(1 - p)% confidence interval for the expected value (mean) of the \npredicted value. The p-level is equal to the value of the ALPHA= option in the OUTPUT \nstatement or, if this option is not specified, to the ALPHA= option in the PROC GLM \nstatement. "},"StatementOptionType":"RV"},{"StatementOptionName":"OUT=","StatementOptionHelp":{"#cdata":"[Syntax: OUT=SAS-data-set] \n          \nGives the name of the new data set. By default, the procedure uses the DATAn \nconvention to name the new data set."},"StatementOptionType":"RV|DV"},{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=α] \n          \nSpecifies the level of significance α for 100(1 - α)% confidence intervals."},"StatementOptionType":"V"}]}},{"StatementName":"RANDOM","StatementHelp":{"#cdata":"Syntax: RANDOM effects </ options> ;\n      \nWhen some model effects are random (that is, assumed to be sampled from a normal \npopulation of effects), you can specify these effects in the RANDOM statement in \norder to compute the expected values of mean squares for various model effects \nand contrasts and, optionally, to perform random effects analysis of variance \ntests."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"Q","StatementOptionHelp":{"#cdata":"Displays all quadratic forms in the fixed effects that appear in the expected mean squares. \nFor some designs, such as large mixed-level factorials, the Q option might generate a substantial \namount of output."},"StatementOptionType":"S"},{"StatementOptionName":"TEST","StatementOptionHelp":{"#cdata":"Performs hypothesis tests for each effect specified in the model, using appropriate error \nterms as determined by the expected mean squares.\n\nCaution: PROC GLM does not automatically declare interactions to be random when the effects \nin the interaction are declared random. For example, \n\n   random a b / test;\n\ndoes not produce the same expected mean squares or tests as \n\n   random a b a*b / test;\n\nTo ensure correct tests, you need to list all random interactions and random main effects \nin the RANDOM statement."},"StatementOptionType":"S"}]}},{"StatementName":"STORE|ITEMSTORE","StatementHelp":{"#cdata":"Syntax: STORE <OUT=>item-store-name </ LABEL='label'> ; \n      \nThe STORE statement requests that the procedure save the context and results of the \nstatistical analysis. The resulting item store is a binary file format that cannot \nbe modified. The contents of the item store can be processed with the PLM procedure. \n\nThe item-store-name is a usual one- or two-level SAS name, like the names that are used \nfor SAS data sets. If you specify a one-level name, then the item store resides in the \nWORK library and is deleted at the end of the SAS session. Since item stores usually are \nused to perform postprocessing tasks, typical usage specifies a two-level name of the form \nlibname.membername. \n\nIf an item store by the same name as specified in the STORE statement already exists, \nthe existing store is replaced."},"StatementOptions":{"StatementOption":{"StatementOptionName":"LABEL=","StatementOptionHelp":{"#cdata":"[Syntax: LABEL='label'] \n          \nAdds a custom label. When the PLM procedure processes an item store, the label appears \nin the PROC PLM output along with other identifying information."},"StatementOptionType":"V"}}},{"StatementName":"WEIGHT|WGT","StatementHelp":{"#cdata":"Syntax: WEIGHT variable;\n      \nWhen a WEIGHT statement is used, a weighted residual sum of squares is minimized. The WEIGHT \nstatement has no effect on degrees of freedom or number of observations, but it is used by the \nMEANS statement when calculating means and performing multiple comparison tests."},"StatementOptions":null}]}}}