{"Procedure":{"Name":"GLMSELECT","#comment":{},"ProductGroup":"SAS/STAT","ProcedureHelp":{"#cdata":"Syntax: PROC GLMSELECT <options> ; \n    BY variables ; \n    CLASS variable <(v-options)> <variable <(v-options ...)> > </ v-options> <options> ; \n    CODE <options>; \n    EFFECT name = effect-type ( variables </ options> ) ; \n    FREQ variable ; \n    MODEL variable = <effects> </ options> ; \n    MODELAVERAGE <options> ; \n    OUTPUT <OUT=SAS-data-set> <keyword <=name> > <...keyword=name> ; \n    PARTITION <options> ; \n    PERFORMANCE <options> ; \n    SCORE <DATA=SAS-data-set> <OUT=SAS-data-set> ; \n    STORE <OUT=>item-store-name </ LABEL='label'> ; \n    WEIGHT variable ; \n\nA variety of model selection methods are available, including the LASSO method of Tibshirani (1996) \nand the related LAR method of Efron et al. (2004). The procedure offers extensive capabilities for \ncustomizing the selection with a wide variety of selection and stopping criteria, from traditional \nand computationally efficient significance-level-based criteria to more computationally intensive \nvalidation-based criteria. The procedure also provides graphical summaries of the selection search. \n\nThe GLMSELECT procedure compares most closely to REG and GLM. The REG procedure supports a variety \nof model-selection methods but does not support a CLASS statement. The GLM procedure supports a CLASS \nstatement but does not include effect selection methods. The GLMSELECT procedure fills this gap. \nGLMSELECT focuses on the standard independently and identically distributed general linear model \nfor univariate responses and offers great flexibility for and insight into the model selection \nalgorithm. GLMSELECT provides results (displayed tables, output data sets, and macro variables) \nthat make it easy to take the selected model and explore it in more detail in a subsequent procedure \nsuch as REG or GLM."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nNames the SAS data set to be used by PROC GLMSELECT. If the DATA= option is not \nspecified, PROC GLMSELECT uses the most recently created SAS data set."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"MAXMACRO=","ProcedureOptionHelp":{"#cdata":"[Syntax: MAXMACRO=n] \n      \nSpecifies the maximum number of macro variables with selected effects to create. \nBy default, MAXMACRO=100."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NOPRINT","ProcedureOptionHelp":{"#cdata":"Suppresses all displayed output including plots."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NAMELEN=","ProcedureOptionHelp":{"#cdata":"[Syntax: NAMELEN=n] \n      \nSpecifies the length of effect names in tables and output data sets to be n characters long, \nwhere n is a value between 20 and 200 characters. The default length is 20 characters."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"OUTDESIGN=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUTDESIGN <(options)><=SAS-data-set>] \n      \nCreates a data set that contains the design matrix.\n      \nYou can specify the following options in parentheses to control the contents of the OUTDESIGN data set: \n\n  ADDINPUTVARS \n  requests that all variables in the input data set be included in the OUTDESIGN= data set. \n\n  FULLMODEL \n  specifies that parameters corresponding to all the effects specified in the MODEL statement be \n  included in the OUTDESIGN= data set. \n\n  NAMES \n  produces a table associating columns in the OUTDESIGN data set with the labels of the parameters \n  they represent. \n\n  PREFIX<=prefix> \n  requests that the design matrix column names consist of a prefix followed by an index. The default \n  naming prefix is \"_X\". You can optionally specify a different prefix."},"ProcedureOptionType":"S|DV","SubOptionsKeywords":"ADDINPUTVARS|FULLMODEL|NAMES|PREFIX|PREFIX="},{"ProcedureOptionName":"PARMLABELSTYLE=","ProcedureOptionHelp":{"#cdata":"Specifies how parameter names and labels are constructed for nested and crossed effects."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"INTERLACED","@Value2":"SEPARATE","@Value3":"SEPARATECOMPACT"},"ProcedureOptionToolTips":{"@ToolTip1":"Syntax: INTERLACED <(SEPARATOR=quoted string)>          Forms parameter names and labels by positioning levels of classification variables and constructed  effects adjacent to the associated variable or constructed effect name and using '*' as the delimiter  for both crossed and nested effects.","@ToolTip2":"Specifies that in forming parameter names and labels, the effect name appears before the levels  associated with the classification variables and constructed effects in the effect.","@ToolTip3":"Requests the same parameter naming and labeling scheme as PARMLABELSTYLE=SEPARATE except that the  first level in the parameter label is separated from the effect name by a single blank."},"SubOptionsKeywords":"SEPARATOR="},{"ProcedureOptionName":"PLOTS=","ProcedureOptionHelp":{"#cdata":"Syntax: PLOTS <(global-plot-options)> <= plot-request <(options)>> \nSyntax: PLOTS <(global-plot-options)> <= (plot-request <(options)> <... plot-request <(options)>>)> \n\nControls the plots produced through ODS Graphics.\n\nThe following global-options apply to all plots generated by the GLMSELECT procedure:\n\n  ENDSTEP=n \n  specifies that the step ranges shown on the horizontal axes of plots terminates at specified step.\n\n  LOGP | LOGPVALUE \n  requests that the natural logarithm of the entry and removal significance levels be displayed. \n\n  MAXSTEPLABEL=n \n  specifies the maximum number of characters beyond which labels of effects on plots are truncated. \n\n  MAXPARMLABEL= n \n  specifies the maximum number of characters beyond which parameter labels on plots are truncated. \n\n  STARTSTEP=n \n  specifies that the step ranges shown on the horizontal axes of plots start at the specified step.\n\n  STEPAXIS=EFFECT | NORMB | NUMBER \n  specifies the horizontal axis to be used on the plots, where this axis represents the sequence \n  of entering or departing effects. \n\n  UNPACK \n  suppresses paneling. By default, multiple plots can appear in some output panels."},"ProcedureOptionType":"S|V","ProcedureOptionValues":{"@Value1":"ALL","@Value2":"ASEPLOT","@Value3":"CANDIDATESPLOT","@Value4":"COEFFICIENTPANEL","@Value5":"CRITERIONPANEL","@Value6":"EFFECTSELECTPCT","@Value7":"PARMDIST","@Value8":"NONE"},"ProcedureOptionToolTips":{"@ToolTip1":"Requests that all default plots be produced.","@ToolTip2":"Syntax: ASEPLOT<(aseplot-option)>                                 Plots the progression of the average square error on the training data, and the test and validation  data whenever these data are provided with the TESTDATA= and VALDATA= options or are produced by  using a PARTITION statement. The following aseplot-option option is available:    STEPAXIS=EFFECT | NORMB | NUMBER    specifies the horizontal axis to be used.","@ToolTip3":"Syntax: CANDIDATESPLOT<(candidatesplot-options)>                       Produces a needle plot of the select criterion values for the candidates for entry or removal at  each step of the selection process, ordered from best to worst.                                 The following candidatesplot-options are available:    LOGP | LOGPVALUE    requests that the natural logarithm of the entry and removal significance levels be displayed. ificance level.    SHOW=number    specifies the maximum number of candidates displayed at each step. The default is SHOW=10.","@ToolTip4":"Syntax: COEFFICIENTPANEL<(coefficientPanel-options)>                                  Plots a panel of two plots. The upper plot shows the progression of the parameter values as the  selection process proceeds. The lower plot shows the progression of the CHOOSE= criterion.   The following coefficientPanel-options are available:     LABELGAP=percentage    specifies the percentage of the vertical axis range that forms the minimum gap between successive    parameter labels at the final step of the coefficient progression plot.    LOGPVALUE    requests that the natural logarithm of the entry and removal significance levels be displayed    if the choose criterion is significance level.    STEPAXIS=EFFECT | NORMB | NUMBER    specifies the horizontal axis to be used.     UNPACK | UNPACKPANEL    displays the coefficient progression and the choose criterion progression in separate plots.","@ToolTip5":"Syntax: CRITERIONPANEL<(criterionPanel-options)>                                  Plots a panel of model fit criteria. The criteria that are displayed are ADJRSQ, AIC, AICC,  and SBC, as well as any other criteria that are named in the CHOOSE=, SELECT=, STOP=,  or STATS= option in the MODEL statement. The following criterionPanel-options are available:     STEPAXIS=EFFECT | NORMB | NUMBER    specifies the horizontal axis to be used.     UNPACK | UNPACKPANEL  displays each criterion progression on a separate plot.","@ToolTip6":"Syntax: EFFECTSELECTPCT  <(effectSelectPct-options)>                                 Requests a bar chart whose bars correspond to effects that are selected in at least one sample when you use  the MODELAVERAGE statement.   The following effectSelectPct-options are available:    MINPCT=percent    specifies that effects that appear in fewer than the specified percentage of the sample selected    models not be included in the plot.  ORDER=ASCENDING | DESCENDING | MODEL    specifies the ordering of the effects in the bar chart.","@ToolTip7":"Syntax: PARMDIST <(parmDist-options)>                                 Produces a panel that shows histograms and box plots of the parameter estimate values across samples  when you use a MODELAVERAGE statement.   The following parmDist-options are available:    MINPCT=percent    specifies that distributions be shown only for parameters whose estimates are nonzero in at least the    specified percentage of the selected models.  ORDER=ASCENDING | DESCENDING | MODEL    specifies the ordering of the parameters in the panels.  NOBOXPLOTS    suppress the box plots.   PLOTSPERPANEL=number    specifies the maximum number of parameter distributions that appear in a panel.   UNPACK    specifies that the distribution for each relevant parameter be shown in a separate plot.","@ToolTip8":"Suppresses all plots."},"SubOptionsKeywords":"UNPACK|UNPACKPANEL|STEPAXIS=|ENDSTEP=|LOGPVALUE|LABELGAP=|SHOW=|LOGP|LOGPVALUE|MAXSTEPLABEL=|MAXPARMLABEL=|STARTSTEP=|MINPCT=|ORDER=|NOBOXPLOTS|PLOTSPERPANEL="},{"ProcedureOptionName":"SEED=","ProcedureOptionHelp":{"#cdata":"[Syntax: SEED=number] \n      \nSpecifies an integer used to start the pseudo-random number generator for random cross \nvalidation and random partitioning of data for training, testing, and validation."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"TESTDATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: TESTDATA=SAS-data-set] \n      \nNames a SAS data set containing test data. This data set must contain all the \nvariables specified in the MODEL statement."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"VALDATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: VALDATA=SAS-data-set] \n      \nNames a SAS data set containing validation data. This data set must contain \nall the variables specified in the MODEL statement."},"ProcedureOptionType":"DV"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY variables; \n\nYou can specify a BY statement with PROC GLMSELECT to obtain separate analyses of observations in groups that \nare defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be \nsorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used. \n\nIf your input data set is not sorted in ascending order, use one of the following alternatives: \n\n  • Sort the data by using the SORT procedure with a similar BY statement. \n  • Specify the NOTSORTED or DESCENDING option in the BY statement for the BCHOICE procedure. The NOTSORTED \n    option does not mean that the data are unsorted but rather that the data are arranged in groups (according to values \n    of the BY variables) and that these groups are not necessarily in alphabetical or increasing numeric order. \n  • Create an index on the BY variables by using the DATASETS procedure (in Base SAS software)."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"CLASS","StatementHelp":{"#cdata":"Syntax: CLASS variable <(v-options)> …<variable <(v-options)>> </ options>; \n\nThe CLASS statement names the classification variables to be used in the analysis. The CLASS statement \nmust precede the MODEL statement."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DELIMITER=","StatementOptionHelp":{"#cdata":"[Syntax: DELIMITER=quoted character] \n          \nSpecifies the delimiter that is used between levels of classification variables \nin building parameter names and lists of class level values."},"StatementOptionType":"V"},{"StatementOptionName":"SHOW|SHOWCODING","StatementOptionHelp":{"#cdata":"Requests a table for each classification variable that shows the coding used for that variable."},"StatementOptionType":"S"},{"StatementOptionName":"CPREFIX=","StatementOptionHelp":{"#cdata":"[Syntax: CPREFIX=n] \n          \nSpecifies that, at most, the first n characters of a CLASS variable name \nbe used in creating names for the corresponding design variables."},"StatementOptionType":"V"},{"StatementOptionName":"DESCENDING|DESC","StatementOptionHelp":{"#cdata":"Reverses the sorting order of the classification variable."},"StatementOptionType":"S"},{"StatementOptionName":"LPREFIX=","StatementOptionHelp":{"#cdata":"[Syntax: LPREFIX=n] \n          \nSpecifies that, at most, the first n characters of a CLASS variable label be \nused in creating labels for the corresponding design variables."},"StatementOptionType":"V"},{"StatementOptionName":"MISSING","StatementOptionHelp":{"#cdata":"Allows missing value ('.' for a numeric variable and blanks for a character variables) as a valid \nvalue for the CLASS variable."},"StatementOptionType":"S"},{"StatementOptionName":"ORDER=","StatementOptionHelp":{"#cdata":"Specifies the sorting order for the levels of classification variables."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"DATA","@Value2":"FORMATTED","@Value3":"FREQ","@Value4":"INTERNAL"},"StatementOptionToolTips":{"@ToolTip1":"Orders values according to their order in the input data set.","@ToolTip2":"Orders values by their ascending formatted values. This order depends on your operating environment.","@ToolTip3":"Orders values by descending frequency count so that levels with the most observations are listed first.","@ToolTip4":"Orders values by their unformatted values, which yields the same order as PROC SORT. This order  depends on your operating environment."}},{"StatementOptionName":"PARAM=","StatementOptionHelp":{"#cdata":"Specifies the parameterization method for the classification variable or variables."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"EFFECT","@Value2":"GLM","@Value3":"ORDINAL|THERMOMETER","@Value4":"POLYNOMIAL|POLY","@Value5":"REFERENCE|REF","@Value6":"ORTHEFFECT","@Value7":"ORTHORDINAL|ORTHOTHERM","@Value8":"ORTHPOLY","@Value9":"ORTHREF"},"StatementOptionToolTips":{"@ToolTip1":"Specifies effect coding","@ToolTip2":"Specifies less-than-full-rank, reference-cell coding; this option can be used only as a global option.","@ToolTip3":"Specifies the cumulative parameterization for an ordinal CLASS variable.","@ToolTip4":"Specifies polynomial coding.","@ToolTip5":"Specifies reference-cell coding.","@ToolTip6":"Orthogonalizes PARAM=EFFECT coding.","@ToolTip7":"Orthogonalizes PARAM=ORDINAL coding.","@ToolTip8":"Orthogonalizes PARAM=POLYNOMIAL coding.","@ToolTip9":"Orthogonalizes PARAM=REFERENCE coding."}},{"StatementOptionName":"REF=","StatementOptionHelp":{"#cdata":"[Syntax: REF='level' | keyword] \n          \nSpecifies the reference level for PARAM=EFFECT, PARAM=REFERENCE, and their orthogonalizations."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<'level'>","@Value2":"FIRST","@Value3":"LAST"},"StatementOptionToolTips":{"@ToolTip1":"For an individual (but not a global) variable REF= option, you can specify the level of the variable  to use as the reference level.","@ToolTip2":"Designates the first-ordered level as reference.","@ToolTip3":"Designates the last-ordered level as reference."}},{"StatementOptionName":"SPLIT","StatementOptionHelp":{"#cdata":"Splits the columns of the design matrix that correspond to any   effect that contains a split \nclassification variable so that they can enter or leave a model independently of the other \ndesign columns for that effect. For example, suppose a variable named temp has three levels \nwith values hot, warm, and cold, and a variable named sex has two levels."},"StatementOptionType":"S"}],"#comment":{}}},{"StatementName":"CODE","StatementHelp":{"#cdata":"Syntax: CODE <option(s)> ; \n\nThe CODE statement writes SAS DATA step code for computing predicted values of the fitted model either \nto a file or to a catalog entry. This code can then be included in a DATA step to score new data."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"CATALOG=|CAT=","StatementOptionHelp":{"#cdata":"Syntax: CATALOG=library.catalog.entry.type\n Syntax: CAT=library.catalog.entry.type \n  \nSpecifies where to write the generated code in the form of library.catalog.entry.type. The compound\nname can have from one to four levels. The default library is determined by the USER= SAS system\noption, which by default is WORK. The default entry is SASCODE, and the default type is SOURCE."},"StatementOptionType":"V"},{"StatementOptionName":"DUMMIES","StatementOptionHelp":{"#cdata":"Specifies to keep dummy variables that represent the CLASS levels in the data set. The default\nis NODUMMIES, which specifies that dummy variables not be retained."},"StatementOptionType":"S"},{"StatementOptionName":"NODUMMIES","StatementOptionHelp":{"#cdata":"Specifies that dummy variables not be retained."},"StatementOptionType":"S"},{"StatementOptionName":"ERROR","StatementOptionHelp":{"#cdata":""},"StatementOptionType":"S"},{"StatementOptionName":"NOERROR","StatementOptionHelp":{"#cdata":"The default is NOERROR, which specifies that the error function not be generated."},"StatementOptionType":"S"},{"StatementOptionName":"FILE=","StatementOptionHelp":{"#cdata":"Syntax: FILE= filename \n          \nNames the external file that saves the generated code. When enclosed in a quoted string (for example,\nFILE=\"c:nmydirnscorecode.sas\"), this option specifies the path for writing the code to an external\nfile. You can also specify unquoted SAS filenames of no more than eight characters for filename. If\nthe filename is assigned as a fileref in a Base SAS FILENAME statement, the file specified in the\nFILENAME statement is opened. The special filerefs LOG and PRINT are always assigned. If the\nspecified filename is not an assigned fileref, the specified value for filename is concatenated with a .txt\nextension before the file is opened. For example, if FOO is not an assigned fileref, FILE=FOO causes\nFOO.txt to be opened. If filename has more than eight characters, an error message is printed."},"StatementOptionType":"V"},{"StatementOptionName":"FORMAT=","StatementOptionHelp":{"#cdata":"Syntax: FORMAT=format \n         \nSpecifies the format for the regression coefficients and other numerical values that do not have a format\nfrom the input data set. The default format is BEST20."},"StatementOptionType":"V"},{"StatementOptionName":"GROUP=","StatementOptionHelp":{"#cdata":"Syntax: GROUP=group-name \n         \nSpecifies the group identifier for group processing. The group-name should be a valid SAS name of no\nmore than 16 characters. It is used to construct array names and statement labels in the generated code."},"StatementOptionType":"V"},{"StatementOptionName":"IMPUTE","StatementOptionHelp":{"#cdata":"Imputes the predicted values according to an intercept-only model for observations with missing or\ninvalid covariate values. For a continuous response, the predicted value is the mean of the response\nvariable; for a categorical response, the predicted values are the proportions of the response categories.\nWhen the IMPUTE option is specified, the scoring code also creates a variable named _WARN_ that\ncontains one or more single-character codes that indicate problems in computing predicted values. The\ncharacter codes used in _WARN_ go in the following positions:\n\nCode Column Meaning\nM     1     Missing covariate value\nU     2     Unrecognized covariate category"},"StatementOptionType":"S"},{"StatementOptionName":"LINESIZE=|LS=","StatementOptionHelp":{"#cdata":"Syntax: LINESIZE=value |  LS=value \n         \nSpecifies the line size for the generated code. The default is 72. The permissible range is 64 to 254."},"StatementOptionType":"V"},{"StatementOptionName":"LOOKUP=","StatementOptionHelp":{"#cdata":"Syntax: LOOKUP=lookup-method \n          \nSpecifies the algorithm for looking up CLASS levels. The default is LOOKUP=AUTO."},"StatementOptionValues":{"@Value1":"AUTO","@Value2":"BINARY","@Value3":"LINEAR","@Value4":"SELECT"},"StatementOptionToolTips":{"@ToolTip1":"Selects the LINEAR algorithm if a CLASS variable has fewer than five categories; otherwise, the BINARY algorithm is used. This is the default.","@ToolTip2":"Uses a binary search. This method is fast, but might produce incorrect results and the normalized category values might contain characters that collate in different orders in ASCII and EBCDIC, if you generate the code on an ASCII machine and execute the code on an EBCDIC machine or vice versa.","@ToolTip3":"Uses a linear search with IF statements that have categories in the order of the class levels. This method is slow if there are many categories.","@ToolTip4":"Uses a SELECT statement."},"StatementOptionType":"V"},{"StatementOptionName":"RESIDUAL","StatementOptionHelp":{"#cdata":"Specifies to generate code to compute residual values. If you request code for residuals and\nthen score a data set that does not contain target values, the residuals will have missing values. The\ndefault is NORESIDUAL, which specifies that the code for residuals not be generated."},"StatementOptionType":"S"},{"StatementOptionName":"NORESIDUAL","StatementOptionHelp":{"#cdata":"The default is NORESIDUAL, which specifies that the code for residuals not be generated."},"StatementOptionType":"S"}]}},{"StatementName":"EFFECT","StatementHelp":{"#cdata":"Syntax: EFFECT name=effect-type (variables </ options>); \n\nThe EFFECT statement enables you to construct special collections of columns for design matrices. These collections \nare referred to as constructed effects to distinguish them from the usual model effects that are formed from continuous \nor classification variables."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"EFFECT-NAME=","StatementOptionHelp":{"#cdata":"Replace 'EFFECT-NAME' with the name of the effect, specified after the EFFECT keyword. \nThis name can appear in only one EFFECT statement and cannot be the name of a \nvariable in the input data set."},"StatementOptionType":"RV","StatementOptionValues":{"@Value1":"COLLECTION","@Value2":"LAG","@Value3":"MULTIMEMBER|MM","@Value4":"POLYNOMIAL|POLY","@Value5":"SPLINE"},"StatementOptionToolTips":{"@ToolTip1":"Is a collection effect that defines one or more variables as a single effect with  multiple degrees of freedom. The variables in a collection are considered as a  unit for estimation and inference.  Option(s) available (specified after a slash (/) following the variable list):   DETAILS  Displays the constituents of the collection effect","@ToolTip2":"Is a classification effect in which the level that is used for a given period  corresponds to the level in the preceding period.   Options available (specified after a slash (/) following the variable list):    DESIGNROLE=    Names a variable that controls to which lag design an observation is assigned     DETAILS    Displays the lag design of the lag effect     NLAG=    Specifies the number of periods in the lag     PERIOD=    Names the variable that defines the period     WITHIN=    Names the variable or variables that define the group within which each period is defined","@ToolTip3":"Is a multimember classification effect whose levels are determined by one or  more variables that appear in a CLASS statement.   Options available (specified after a slash (/) following the variable list):     NOEFFECT    Specifies that observations with all missing levels for the multimember variables should    have zero values in the corresponding design matrix columns     WEIGHT=    Specifies the weight variable for the contributions of each of the classification effects","@ToolTip4":"Is a multivariate polynomial effect in the specified numeric variables.                                      Options available (specified after a slash (/) following the variable list):     DEGREE=    Specifies the degree of the polynomial     MDEGREE=    Specifies the maximum degree of any variable in a term of the polynomial     STANDARDIZE=    Specifies centering and scaling suboptions for the variables that define the polynomial","@ToolTip5":"Is a regression spline effect whose columns are univariate spline expansions of  one or more variables. A spline expansion replaces the original variable with  an expanded or larger set of new variables.   Options available (specified after a slash (/) following the variable list):     BASIS=    Specifies the type of basis (B-spline basis or truncated power function basis) for the spline expansion     DEGREE=    Specifies the degree of the spline transformation     KNOTMETHOD=    Specifies how to construct the knots for spline effects"},"SubOptionsKeywords":"DETAILS|DESIGNROLE=|NLAG=|WITHIN=|NOEFFECT|WEIGHT=|DEGREE=|MDEGREE=|STANDARDIZE=|BASIS=|KNOTMETHOD="},{"StatementOptionName":"PERIOD=","StatementOptionHelp":{"#cdata":"[For the LAG effect-type only]\n          \n[Syntax: PERIOD=variable] \n          \nSpecifies the period variable of the LAG design. The number of periods is the number \nof unique formatted values of the PERIOD= variable, and the ordering of the period is \nformed by sorting these formatted values in ascending order. You must specify a PERIOD= \nvariable."},"StatementOptionType":"V"},{"StatementOptionName":"WITHIN=","StatementOptionHelp":{"#cdata":"[For the LAG effect-type only] \n          \n[Syntax: WITHIN=(variables) | WITHIN=variable] \n\nSpecifies a variable (or a list of variables within parentheses) that defines the \nsubject grouping of the lag design. If there is only one WITHIN= variable, then the \nparentheses are not required. Each subject is defined by the unique set of formatted \nvalues of the variables in the WITHIN= list. The subjects are sorted in ascending \nlexicographic order. You must specify a WITHIN= variable."},"StatementOptionType":"V"},{"StatementOptionName":"DESIGNROLE=","StatementOptionHelp":{"#cdata":"[For the LAG effect-type only] \n          \n[Syntax: DESIGNROLE=variable] \n\nSpecifies a numeric variable that is used to subset observations into a fitting group \nin which the value of the DESIGNROW= variable is nonzero and a second group in which \nthe value of the specified variable is zero. The observations in the fitting group are \nused to form the LAG design matrix that is used in fitting the model. The LAG design \nthat corresponds to the non-fitting group is used when scoring observations in the \ninput data set that do not belong to the fitting group. This option is useful when \nyou want to obtain predicted values in an output data set for observations that are \nnot used in fitting the model. If you do not specify a DESIGNROLE= variable, then all \nobservations are assigned to the fitting group."},"StatementOptionType":"V"},{"StatementOptionName":"DETAILS","StatementOptionHelp":{"#cdata":"[For the LAG | COLLECTION | MULTIMEMBER | POLYNOMIAL |SPLINE effect-type] \n          \nRequests a table that shows the (1) lag design matrix of the lag effect, or (2) constituents \nof the collection effect, or (3) levels of the multimember effect, or (4) details of the specified \npolynomial, or (5) knot locations and the knots associated with each spline basis function."},"StatementOptionType":"S"},{"StatementOptionName":"NLAG=","StatementOptionHelp":{"#cdata":"[For the LAG effect-type only] \n          \n[Syntax: NLAG= n] \n\nSpecifies the number of lags. By default NLAG=1."},"StatementOptionType":"V"},{"StatementOptionName":"NOEFFECT","StatementOptionHelp":{"#cdata":"[For the MULTIMEMBER effect-type only] \n          \nSpecifies that, for observations with all missing levels of the multimember variables, \nthe values in the corresponding design matrix columns be set to zero."},"StatementOptionType":"S"},{"StatementOptionName":"STDIZE","StatementOptionHelp":{"#cdata":"[For the MULTIMEMBER effect-type only] \n          \nSpecifies that for each observation, the entries in the design matrix that corresponds \nto the multimember effect be scaled to have a sum of one."},"StatementOptionType":"S"},{"StatementOptionName":"WEIGHT=","StatementOptionHelp":{"#cdata":"[For the MULTIMEMBER effect-type only] \n          \n[Syntax: WEIGHT=wght-list] \n\nSpecifies numeric variables used to weigh the contributions of each of the classification \neffects that define the constructed multimember effect. The number of variables in wght-list \nmust match the number of classification variables that define the effect."},"StatementOptionType":"V"},{"StatementOptionName":"DEGREE=","StatementOptionHelp":{"#cdata":"[For the POLYNOMIAL and SPLINE effect-type only] \n          \n[Syntax: DEGREE=n] \n\nSpecifies the (1) degree of the polynomial, or (2) degree of the spline transformation. \nThe degree must be a positive integer. The n degree is typically a small integer, such as \n1, 2, or 3. The default for polynomial effect is DEGREE=1, and DEGREE=3 for spline \ntransformation."},"StatementOptionType":"V"},{"StatementOptionName":"LABELSTYLE=","StatementOptionHelp":{"#cdata":"[For the POLYNOMIAL effect-type only] \n          \n[Syntax: LABELSTYLE=(style-opts) | LABELSTYLE=style-opt] \n\nSpecifies how the terms in the polynomial are labeled. By default, powers are shown \nwith ^ as the exponentiation operator and * as the multiplication operator."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"EXPAND","@Value2":"EXPONENT","@Value3":"INCLUDENAME","@Value4":"PRODUCTSYMBOL="},"StatementOptionToolTips":{"@ToolTip1":"Specifies that each variable with an exponent greater than 1 be written as products of that variable.","@ToolTip2":"Syntax: EXPONENT <=quoted string>                                      Specifies that each variable with an exponent greater than 1 be written using exponential  notation. By default, the symbol ^ is used as the exponentiation operator. If you supply the  optional quoted string after an equal sign, then that string is used as the exponentiation  operator.","@ToolTip3":"Specifies that the name of the effect followed by an underscore be used as a prefix  for term labels.","@ToolTip4":"Syntax: PRODUCTSYMBOL=NONE | quoted string                                      Specifies that the supplied string be used as the product symbol."}},{"StatementOptionName":"MDEGREE=","StatementOptionHelp":{"#cdata":"[For the POLYNOMIAL effect-type only] \n          \n[Syntax: MDEGREE=n] \n\nSpecifies the maximum degree of any variable in a term of the polynomial. This degree \nmust be a positive integer. The default is the degree of the specified polynomial."},"StatementOptionType":"V"},{"StatementOptionName":"NOSEPARATE","StatementOptionHelp":{"#cdata":"[For the POLYNOMIAL effect-type only] \n          \nSpecifies that the polynomial be treated as a single effect with multiple degrees \nof freedom. The effect name that you specify is used as the constructed effect name, \nand the labels of the terms are used as labels of the corresponding parameters."},"StatementOptionType":"S"},{"StatementOptionName":"STANDARDIZE","StatementOptionHelp":{"#cdata":"[For the POLYNOMIAL effect-type only] \n          \n[Syntax: STANDARDIZE <(centerscale-opts)> <= standardize-opt>] \n\nSpecifies that the variables that define the polynomial be standardized. By default, \nthe standardized variables receive prefix \"s_\" in the variable names. \n\nYou can use the following centerscale-opts to specify how the center and scale are estimated: \n\n  METHOD=MOMENTS \n  specifies that the center be estimated by the variable mean and the scale be estimated by the standard deviation. \n\n  METHOD=RANGE \n  specifies that the center be estimated by the midpoint of the variable range and the scale be estimated as half the variable range.\n\n  METHOD=WMOMENTS \n  is the same as METHOD=MOMENTS except that weighted means and weighted standard deviations are used. \n\n  PREFIX=NONE | quoted-string \n  specifies the prefix that is appended to standardized variables when forming the term labels."},"StatementOptionType":"S|V","StatementOptionValues":{"@Value1":"CENTER","@Value2":"CENTERSCALE","@Value3":"NONE","@Value4":"SCALE"},"StatementOptionToolTips":{"@ToolTip1":"Specifies that variables be centered but not scaled.","@ToolTip2":"Specifies that variables be centered and scaled. This is the default if you do not  specify a standardization-opt.","@ToolTip3":"Specifies that no standardization be performed.","@ToolTip4":"Specifies that variables be scaled but not centered."}},{"StatementOptionName":"BASIS=","StatementOptionHelp":{"#cdata":"[For the SPLINE effect-type only] \n          \nSpecifies a basis for the spline expansion."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BSPLINE","@Value2":"TPF"},"StatementOptionToolTips":{"@ToolTip1":"Specifies a B-spline basis for the spline expansion.","@ToolTip2":"Syntax: TPF(options)                                      Specifies a truncated power function basis for the spline expansion.   You can modify the number of columns when you request BASIS=TPF with the following options:     NOINT    excludes the intercept column.     NOPOWERS    excludes the intercept and polynomial columns."}},{"StatementOptionName":"DATABOUNDARY","StatementOptionHelp":{"#cdata":"[For the SPLINE effect-type only]\n          \nSpecifies that the extremes of the data be used as boundary knots when building a B-spline basis."},"StatementOptionType":"S"},{"StatementOptionName":"KNOTMAX=","StatementOptionHelp":{"#cdata":"[For the SPLINE effect-type only]\n          \n[Syntax: KNOTMAX=value] \n\nSpecifies that, for each variable in the EFFECT statement, the right-side boundary \nknots be equally spaced starting at the maximum of the variable and ending at the \nspecified value. This option is ignored for variables whose maximum value is greater \nthan the specified value or if the DATABOUNDARY option is also specified."},"StatementOptionType":"V"},{"StatementOptionName":"KNOTMETHOD=","StatementOptionHelp":{"#cdata":"[For the SPLINE effect-type only] \n          \nSpecifies how to construct the knots for spline effects."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"EQUAL","@Value2":"LIST","@Value3":"LISTWITHBOUNDARY","@Value4":"MULTISCALE","@Value5":"PERCENTILES","@Value6":"RANGEFRACTIONS"},"StatementOptionToolTips":{"@ToolTip1":"Syntax: EQUAL<(n)>               Specifies that n equally spaced knots be positioned between the extremes of the data.  The default is n=3. For a B-spline basis, any needed boundary knots continue to be  equally spaced unless the DATABOUNDARY option has also been specified. KNOTMETHOD=EQUAL  is the default if no knot-method is specified.","@ToolTip2":"Syntax: LIST(number-list)                                      Specifies the list of internal knots to be used in forming the spline basis columns.  For a B-spline basis, the data extremes are used as boundary knots.","@ToolTip3":"Syntax: LISTWITHBOUNDARY(number-list)                                      Specifies the list of all knots that are used in forming the spline basis columns.","@ToolTip4":"Syntax: MULTISCALE<(multiscale-options)>                                      Specifies that multiple B-spline bases be generated, corresponding to sets with an  increasing number of internal knots.   You can control which scales are included with the following multiscale-options:     STARTSCALE=n    specifies the start scale, where n is a positive integer. The default is STARTSCALE=0.     ENDSCALE=n    specifies the end scale, where n is a positive integer. The default is ENDSCALE=7.","@ToolTip5":"Syntax: PERCENTILES(n)                                      Requests that internal knots be placed at n equally spaced percentiles of the variable  or variables named in the EFFECT statement.","@ToolTip6":"Syntax: RANGEFRACTIONS(fraction-list)                                      Requests that internal knots be placed at each fraction of the ranges of the variables  in the EFFECT statement."}},{"StatementOptionName":"KNOTMIN=","StatementOptionHelp":{"#cdata":"[For the SPLINE effect-type only] \n          \n[Syntax: KNOTMIN=value] \n\nSpecifies that for each variable in the EFFECT statement, the left-side boundary knots be \nequally spaced starting at the specified value and ending at the minimum of the variable. \nThis option is ignored for variables whose minimum value is less than the specified value \nor if the DATABOUNDARY option is also specified."},"StatementOptionType":"V"},{"StatementOptionName":"SEPARATE","StatementOptionHelp":{"#cdata":"[For the SPLINE effect-type only] \n          \nSpecifies that when multiple variables are specified in the EFFECT statement, \nthe spline basis for each variable be treated as a separate effect. The names \nof these separated effects are formed by appending an underscore followed by \nthe name of the variable to the name that you specify in the EFFECT statement."},"StatementOptionType":"S"},{"StatementOptionName":"SPLIT","StatementOptionHelp":{"#cdata":"[For the SPLINE effect-type only] \n          \nSpecifies that each individual column in the design matrix that corresponds to the spline \neffect be treated as a separate effect that can enter or leave the model independently. \nNames for these split effects are generated by appending the variable name and an index \nfor each column to the name that you specify in the EFFECT statement."},"StatementOptionType":"S"}]}},{"StatementName":"FREQ","StatementHelp":{"#cdata":"Syntax: FREQ variable ;\n      \nThe variable that is specified in the FREQ statement identifies a variable in the input data set that \ncontains the frequency of occurrence of each observation. PROC GLMSELECT treats each observation as if \nit appears n times, where n is the value of the FREQ variable for the observation. If it is not an integer, \nthe frequency value is truncated to an integer. If it is less than 1 or missing, the observation is not used."},"StatementOptions":null},{"StatementName":"MODEL","StatementHelp":{"#cdata":"Syntax: MODEL dependent=<effects> / <options> ;\n      \nThe MODEL statement names the dependent variable and the explanatory effects, including \ncovariates, main effects, constructed effects, interactions, and nested effects"},"StatementOptions":{"StatementOption":[{"StatementOptionName":"CVDETAILS=","StatementOptionHelp":{"#cdata":"Specifies the details produced when cross validation is requested as the CHOOSE=, SELECT=, or STOP= \ncriterion in the MODEL statement."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ALL","@Value2":"COEFFS","@Value3":"CVPRESS"},"StatementOptionToolTips":{"@ToolTip1":"Requests both CVDETAILS=COEFFS and CVDETAILS=CVPRESS.","@ToolTip2":"Requests that the parameter estimates obtained for each of these n subsets be included in the  parameter estimates table.","@ToolTip3":"Requests a table containing the predicted residual sum of squares of each of these models scored  on the omitted subset."}},{"StatementOptionName":"CVMETHOD=","StatementOptionHelp":{"#cdata":"Specifies how the training data are subdivided into n parts when you request n-fold cross validation \nby using any of the CHOOSE=CV, SELECT=CV, and STOP=CV suboptions of the SELECTION= option in the \nMODEL statement."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BLOCK","@Value2":"RANDOM","@Value3":"SPLIT","@Value4":"INDEX"},"StatementOptionToolTips":{"@ToolTip1":"Syntax: BLOCK <(n)>              Requests that parts be formed of n blocks of consecutive training observations.","@ToolTip2":"Syntax: RANDOM <(n)>                                      Assigns each training observation randomly to one of the n parts.","@ToolTip3":"Syntax: SPLIT <(n)>                                      Requests that the ith part consist of training observations i, i+n, i+2n,...","@ToolTip4":"Syntax: INDEX (variable)   Assigns observations to parts based on the formatted value of the named variable."}},{"StatementOptionName":"DETAILS=","StatementOptionHelp":{"#cdata":"[Syntax: DETAILS=level | DETAILS=STEPS <(step options)>] \n          \nSpecifies the level of detail produced, where level can be ALL, STEPS, or SUMMARY. \n\nThe default if the DETAILS= option is omitted is DETAILS=SUMMARY."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ALL","@Value2":"STEPS","@Value3":"SUMMARY"},"StatementOptionToolTips":{"@ToolTip1":"Produces the following: (1) entry and removal statistics for each variable selected  in the model building process, (2) ANOVA, fit statistics, and parameter estimates,  (3)entry and removal statistics for the top 10 candidates for inclusion or exclusion  at each step, and (4) a selection summary table.","@ToolTip2":"Syntax: STEPS <(step options)>                                      Provides the step information and the selection summary table.  The following options can be specified within parentheses after the DETAILS=STEPS option:     ALL    requests ANOVA, fit statistics, parameter estimates, and entry or removal statistics    for the top 10 candidates for inclusion or exclusion at each selection step.     ANOVA    requests ANOVA at each selection step.     FITSTATISTICS | FITSTATS | FIT    requests fit statistics at each selection step.    PARAMETERESTIMATES | PARMEST    requests parameter estimates at each selection step.     CANDIDATES <(SHOW= ALL | n)>    requests entry or removal statistics for the best n candidate effects for inclusion    or exclusion at each step.","@ToolTip3":"Produces only the selection summary table."},"SubOptionsKeywords":"ALL|ANOVA|FITSTATISTICS|FITSTATS|FIT|PARAMETERESTIMATES|PARMEST|CANDIDATES|SHOW="},{"StatementOptionName":"FUZZ=","StatementOptionHelp":{"#cdata":"Syntax: FUZZ=value \n          \nSpecifies the tolerance range for criterion comparisons. Criterion values that differ by less than the \ntolerance are regarded as equal. If you specify FUZZ=0, then the comparisons are based on simple equality. \nThe default is 10^-12."},"StatementOptionType":"V"},{"StatementOptionName":"HIERARCHY=|HIER=","StatementOptionHelp":{"#cdata":"Specifies whether and how the model hierarchy requirement is applied. This option also controls whether a single effect\nor multiple effects are allowed to enter or leave the model in one step. You can specify that only classification effects,\nor both classification and continuous effects, be subject to the hierarchy requirement."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"NONE","@Value2":"SINGLE","@Value3":"SINGLECLASS"},"StatementOptionToolTips":{"@ToolTip1":"Specifies that model hierarchy not be maintained. This is the default.","@ToolTip2":"Specifies that only one effect enter or leave the model at one time, subject to the model  hierarchy requirement.","@ToolTip3":"Is the same as HIERARCHY=SINGLE except that only CLASS effects are subject to the hierarchy  requirement."}},{"StatementOptionName":"NOINT","StatementOptionHelp":{"#cdata":"Specifies that for the selected model, effects be displayed in the order in which they first entered the model."},"StatementOptionType":"S"},{"StatementOptionName":"ORDERSELECT","StatementOptionHelp":{"#cdata":"Specifies that for the selected model, effects be displayed in the order in which they first entered the model."},"StatementOptionType":"S"},{"StatementOptionName":"SELECTION=","StatementOptionHelp":{"#cdata":"[Syntax: SELECTION=method <(method options)>]\n          \nSpecifies the method used to select the model, optionally followed by parentheses \nenclosing options applicable to the specified method. The default if the SELECTION= \noption is omitted is SELECTION=STEPWISE."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"NONE","@Value2":"FORWARD","@Value3":"BACKWARD","@Value4":"STEPWISE","@Value5":"LAR","@Value6":"LASSO","@Value7":"ELASTICNET","@Value8":"GROUPLASSO"},"StatementOptionToolTips":{"@ToolTip1":"No model selection","@ToolTip2":"Forward selection. This method starts with no effects in the model and adds effects.","@ToolTip3":"Backward elimination. This method starts with all effects in the model and deletes effects.","@ToolTip4":"Stepwise regression. This is similar to the FORWARD method except that effects already in the  model do not necessarily stay there.","@ToolTip5":"Least angle regression. This method, like forward selection, starts with no effects in the model  and adds effects.","@ToolTip6":"This method adds and deletes parameters based on a version of ordinary least squares where the  sum of the absolute regression coefficients is constrained.","@ToolTip7":"Specifies the elastic net method, an extension of LASSO that estimates parameters based on a version  of ordinary least squares in which both the sum of the absolute regression coefficients and the sum  of the squared regression coefficients are constrained.","@ToolTip8":"Specifies the group LASSO method, a variant of LASSO that estimates parameters based on a version of ordinary least squares in which the sum of the Euclidean norms of a group of regression coefficients  is constrained."},"SubOptionsKeywords":"STOP=|CHOOSE=|STEPS=|MAXSTEPS=|SELECT=|INCLUDE=|SLENTRY=|SLSTAY=|DROP=|ADAPTIVE|LSCOEFFS|L1=|L1CHOICE=|L2=|L2STEPS|L2LOW=|L2HIGH=|L2SEARCH=|ENSCALE|RHO=|SCREEN=|TOL="},{"StatementOptionName":"STAT=|STATS=","StatementOptionHelp":{"#cdata":"Specifies which model fit statistics are displayed in the fit summary table and fit statistics tables."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ADJRSQ","@Value2":"AIC","@Value3":"AICC","@Value4":"ASE","@Value5":"BIC","@Value6":"CP","@Value7":"FVALUE","@Value8":"PRESS","@Value9":"RSQUARE","@Value10":"SBC","@Value11":"SL"},"StatementOptionToolTips":{"@ToolTip1":"The adjusted R-square statistic","@ToolTip2":"The Akaike information criterion","@ToolTip3":"The corrected Akaike information criterion","@ToolTip4":"The average square errors for the training, test, and validation data.","@ToolTip5":"The Sawa Bayesian information criterion","@ToolTip6":"The Mallows C(p) statistic","@ToolTip7":"The F statistic for entering or departing effects","@ToolTip8":"The predicted residual sum of squares statistic","@ToolTip9":"The R-square statistic","@ToolTip10":"The Schwarz Bayesian information criterion","@ToolTip11":"The significance level of the F statistic for entering or departing effects"}},{"StatementOptionName":"SHOWPVALUES","StatementOptionHelp":{"#cdata":"Displays p-values in the \"ANOVA\" and \"Parameter Estimates\" tables."},"StatementOptionType":"S"},{"StatementOptionName":"STB","StatementOptionHelp":{"#cdata":"Produces standardized regression coefficients."},"StatementOptionType":"S"},{"StatementOptionName":"TOL=","StatementOptionHelp":{"#cdata":"Syntax: TOL=value \n          \nSpecifies the tolerance value that determines the optimization precision in SELECTION=GROUPLASSO. \nThe default value is 10^-6."},"StatementOptionType":"V"}]}},{"StatementName":"MODELAVERAGE","StatementHelp":{"#cdata":"Syntax: MODELAVERAGE <options> ; \n\nThe MODELAVERAGE statement requests that model selection be repeated on resampled \nsubsets of the input data. An average model is produced by averaging the parameter \nestimates of the selected models that are obtained for each resampled subset of the \ninput data."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=α] \n          \nControls which lower and upper quantiles of the sample parameter estimates are displayed. \nThe ALPHA= option also controls which quantiles of the predicted values are added to the \noutput data set when the LOWER= and UPPER= options are specified in the OUTPUT statement. \nThe lower and upper quantiles used are α/2 and 1-α/2, respectively. The value specified \nmust lie in the interval [0,1]. The default value is ALPHA=0.5."},"StatementOptionType":"V"},{"StatementOptionName":"DETAILS","StatementOptionHelp":{"#cdata":"Requests that model selection details be displayed for each sample of the data. \nThe level of detail shown is controlled by the DETAILS= option in the MODEL \nstatement."},"StatementOptionType":"S"},{"StatementOptionName":"NSAMPLES=","StatementOptionHelp":{"#cdata":"[Syntax: NSAMPLES=n] \n          \nSpecifies the number of samples to be used. The default value is NSAMPLES=100."},"StatementOptionType":"V"},{"StatementOptionName":"REFIT","StatementOptionHelp":{"#cdata":"[Syntax: REFIT <(refit-options)>] \n          \nRequests that a second round of model averaging, referred to as the refit averaging, be \nperformed. Usually, the initial round of model averaging produces a model that contains \na large number of effects. You can use the refit option to obtain a more parsimonious \nmodel. For each data sample in the refit, a least squares model is fit with no effect \nselection. The effects that are used in the refit depend on the results of the initial \nround of model averaging. If you do not specify any refit-options, then effects that \nare selected in at least twenty percent of the samples in the initial round of model \naveraging are used in the refit model average. The following refit-options are available: \n\n  BEST=n \n  specifies that the n most frequently selected effects in the initial round of model \n  averaging be used in the refit averaging. \n\n  MINPCT=percent \n  specifies that the effects that are selected at least the specified percentage of times \n  in the initial round of model averaging be used in the refit averaging. \n\n  NSAMPLES=n \n  specifies the number of samples to be used for the refit averaging. The default value \n  is the number of samples used in the initial round of model averaging."},"StatementOptionType":"S","SubOptionsKeywords":"BEST=|MINPCT=|NSAMPLES="},{"StatementOptionName":"SAMPLING=","StatementOptionHelp":{"#cdata":"Syntax: SAMPLING=SRS | URS <(sampling-options)> \n          \nSpecifies how the samples of the usable observations in the training data are generated. \nModel averaging with samples drawn without replacement corresponds to the bootstrap \nmethodology. The default is SAMPLING=URS. If you specify a frequency variable by using \na FREQ statement, then the ith observation is sampled fi times, where fi is the frequency \nof the ith observation. \n\nYou can specify one of the following sampling-options: \n\n  PERCENT=percent \n  specifies the percentage of the training data that is used in each sample. The default \n  value is 75% for SAMPLING=SRS and 100% for SAMPLING=URS. \n\n  SIZE=n \n  specifies the sum of frequencies in each sample."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"SRS","@Value2":"URS"},"StatementOptionToolTips":{"@ToolTip1":"Specifies simple random sampling in which samples are generated by randomly drawing  without replacement.","@ToolTip2":"Specifies unrestricted random sampling in which samples are generated by randomly  drawing with replacement."},"SubOptionsKeywords":"PERCENT=|SIZE="},{"StatementOptionName":"SUBSET","StatementOptionHelp":{"#cdata":"[Syntax: SUBSET(subset-options)] \n          \nSpecifies that only a subset of the selected models be used in forming the average model \nand producing predicted values. The following subset-options are available: \n\n  BEST=n \n  specifies that only the best n models be used, where the model ranking criterion used is \n  the frequency score. See the section Model Selection Frequencies and Frequency Scores for \n  the definition of the frequency score. If multiple models with the same frequency score \n  correspond to the th best model, then all these tied models are used in forming the average \n  model and producing predicted values. \n\n  MINMODELFREQ=freq \n  specifies that only models that are selected at least freq times be used in forming the \n  average model and producing predicted values."},"StatementOptionType":"S","SubOptionsKeywords":"BEST=|MINMODELFREQ="},{"StatementOptionName":"TABLES=","StatementOptionHelp":{"#cdata":"Controls the displayed output that is produced in the initial round of model averaging.\n          \nSyntax:\nTABLES <(ONLY)> <=table-request <(options)>> \nTABLES <(ONLY)> <= (table-request <(options)> <... table-request <(options)>>)> \n\nIf you specify the ONLY option within parentheses after the TABLES option, then only \nthe tables specifically requested are produced."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ALL","@Value2":"EFFECTSELECTPCT","@Value3":"MODELSELECTFREQ","@Value4":"AVGPARMEST"},"StatementOptionToolTips":{"@ToolTip1":"Specifies that parameters that are nonzero in the selected model for any sample be displayed.","@ToolTip2":"Syntax: EFFECTSELECTPCT <(effectSelectPct-options)>  Specifies how the effects in the \"EffectSelectPct\" table are displayed.  The following effectSelectPct-options are available:     ALL    specifies that effects that appear in the selected model for any sample be displayed.     MINPCT=percent    specifies that the effects displayed must appear in the selected model for at least    the specified percentage of the samples. By default, this table includes effects that    appear in at least twenty percent of the selected models. The MINPCT= option is ignored    if you also specify the ALL option as a effectSelectPct option.     ORDER=ASCENDING | DESCENDING | MODEL    specifies the order in which the effects are displayed. ORDER=MODEL specifies that effects    be displayed in the order in which they appear in the MODEL statement. ORDER= ASCENDING |    DESCENDING specifies that the effects be displayed in ascending or descending order of    their selection frequency.","@ToolTip3":"Syntax: MODELSELECTFREQ <(modelSelectFreq-options)>                Specifies how the models in the \"ModelSelectFreq\" table are displayed.   The following modelSelectFreq-options are available:     ALL    specifies that all selected models be displayed in the \"ModelSelectFreq\" table.     BEST=n    specifies that only the best n models be displayed, where the model ranking criterion    used is the frequency score.","@ToolTip4":"Syntax: AVGPARMEST <(parmEst-options)>                                      Specifies how the parameters in the <AvgParmEst> table are displayed.   The following parmEst-options are available:     ALL    specifies that parameters that are nonzero in the selected model for any sample be displayed.     MINPCT=percent    specifies that the parameters displayed must have nonzero estimates in the selected model for    at least the specified percentage of the samples. By default, this table includes parameters    that appear in at least twenty percent of the selected models. The MINPCT= option is ignored    if you also specify the ALL option as a parmEst option.     NONZEROPARMS    specifies that for each parameter, the sample that is used to compute the estimate mean,    standard deviation, and quantiles consist of just the nonzero values of that parameter in    the selected models. If you do not specify the NONZEROPARMS option, then parameters that    do not appear in a selected model are assigned the value zero in that model and these zero    values are retained when computing the estimate means, standard deviations, and quantiles.     ORDER=ASCENDING | DESCENDING | MODEL    specifies the order in which the effects are displayed. ORDER=MODEL specifies that effects    are displayed in the order in which they appear in the MODEL statement. ORDER=ASCENDING |    DESCENDING specifies that the effects are displayed in ascending or descending order of    their selection frequency."},"SubOptionsKeywords":"ORDER=|NONZEROPARMS|MINPCT=|ALL|BEST="}]}},{"StatementName":"OUTPUT","StatementHelp":{"#cdata":"Syntax: OUTPUT <OUT=SAS-data-set> <keyword <=name> > ...<keyword <=name> > ; \n      \nThe OUTPUT statement creates a new SAS data set that saves diagnostic measures calculated \nfor the selected model. If you do not specify a keyword, then the only diagnostic included \nis the predicted response."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"OUT=","StatementOptionHelp":{"#cdata":"[Syntax: OUT=SAS data set] \n          \nSpecifies the name of the new data set. By default, the procedure uses the DATAn \nconvention to name the new data set."},"StatementOptionType":"RV"},{"StatementOptionName":"PREDICTED|PRED|P","StatementOptionHelp":{"#cdata":"Predicted values. The prefix for the default name is p."},"StatementOptionType":"S|V"},{"StatementOptionName":"RESIDUAL|RESID|R","StatementOptionHelp":{"#cdata":"Residual, calculated as ACTUAL - PREDICTED. The prefix for the default name is r."},"StatementOptionType":"S|V"},{"StatementOptionName":"LOWER","StatementOptionHelp":{"#cdata":"α/2 percentile of the sample predicted values. By default, α=0.05, which yields \nthe 25th percentile. You can change the value of α by using the ALPHA= option in \nthe MODELAVERAGE statement. The default name is LOWER."},"StatementOptionType":"S|V"},{"StatementOptionName":"MEDIAN","StatementOptionHelp":{"#cdata":"Median of the sample predicted values. The default name is median."},"StatementOptionType":"S|V"},{"StatementOptionName":"SAMPLEFREQ|SF","StatementOptionHelp":{"#cdata":"Sample frequencies. For the i-th sample, a column that contains the frequencies used for \nthat sample is added. The name of this column is formed by appending an index i to \nthe name that you specify. If you do not specify a name, then the default prefix \nis sf."},"StatementOptionType":"S|V"},{"StatementOptionName":"SAMPLEPRED|SP","StatementOptionHelp":{"#cdata":"Sample frequencies. For the i-th sample, a column that contains the frequencies used \nfor that sample is added. The name of this column is formed by appending an index i \nto the name that you specify. If you do not specify a name, then the default prefix \nis sf."},"StatementOptionType":"S|V"},{"StatementOptionName":"STANDARDDEVIATION|STDDEV","StatementOptionHelp":{"#cdata":"Standard deviation of the sample predicted values. The default name is stdDev."},"StatementOptionType":"S|V"},{"StatementOptionName":"UPPER","StatementOptionHelp":{"#cdata":"1-α/2 percentile of the sample predicted values. By default, α=0.05, which yields \nthe 75th percentile. You can change the value of α by using the ALPHA= option in \nthe MODELAVERAGE statement. The default name is UPPER"},"StatementOptionType":"S|V"}]}},{"StatementName":"PARTITION","StatementHelp":{"#cdata":"Syntax: PARTITION <options> ;\n      \nThe PARTITION statement specifies how observations in the input data set are logically \npartitioned into disjoint subsets for model training, validation, and testing. Either \nyou can designate a variable in the input data set and a set of formatted values of that \nvariable to determine the role of each observation, or you can specify proportions to \nuse for random assignment of observations for each role."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ROLEVAR=|ROLE=","StatementOptionHelp":{"#cdata":"Syntax: ROLEVAR= | ROLE=variable(<TEST='value'> <TRAIN='value'> <VALIDATE='value'>)\n          \nNames the variable in the input data set whose values are used to assign roles to \neach observation."},"StatementOptionType":"V","SubOptionsKeywords":"TEST=|TRAIN=|VALIDATE="},{"StatementOptionName":"FRACTION","StatementOptionHelp":{"#cdata":"Syntax: FRACTION(<TEST=fraction> <VALIDATE=fraction>)\n          \nFRACTION(<TEST=fraction> <VALIDATE=fraction>) \n\nRequests that specified proportions of the observations in the input data set be randomly \nassigned training and validation roles."},"StatementOptionType":"S","SubOptionsKeywords":"TEST=|VALIDATE="}]}},{"StatementName":"PERFORMANCE","StatementHelp":{"#cdata":"Syntax: PERFORMANCE <options> ;\n      \nThe PERFORMANCE statement is used to change default options that affect the performance of PROC GLMSELECT\nand to request tables that show the performance options in effect and timing details."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DETAILS","StatementOptionHelp":{"#cdata":"Requests the \"PerfSettings\" table that shows the performance settings in effect and the \"Timing\" \ntable that provides a broad timing breakdown of the PROC GLMSELECT step."},"StatementOptionType":"S"},{"StatementOptionName":"BUILDSSCP=","StatementOptionHelp":{"#cdata":"Specifies whether the SSCP matrix is built incrementally as the selection process progresses or \nwhether the SCCP matrix for the full model is built at the outset."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FULL","@Value2":"INCREMENTAL"},"StatementOptionToolTips":{"@ToolTip1":"Specifies that the SSCP matrix for the full model is built at the outset.","@ToolTip2":"Specifies that the SSCP matrix is built incrementally as the selection process progresses."}}]}},{"StatementName":"SCORE","StatementHelp":{"#cdata":"Syntax: SCORE <DATA=SAS-data-set> <OUT=SAS-data-set> <keyword <=name> > ...<keyword <=name> > ;\n      \nThe SCORE statement creates a new SAS data set containing predicted values and optionally residuals \nfor data in a new data set that you name."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DATA=","StatementOptionHelp":{"#cdata":"[Syntax: DATA=SAS data set] \n          \nNames the data set to be scored."},"StatementOptionType":"DV"},{"StatementOptionName":"PREDICTED","StatementOptionHelp":{"#cdata":"Predicted values. The prefix for the default name is p."},"StatementOptionType":"S|V"},{"StatementOptionName":"RESIDUAL","StatementOptionHelp":{"#cdata":"Residual, calculated as ACTUAL - PREDICTED. The prefix for the default name is r."},"StatementOptionType":"S|V"},{"StatementOptionName":"OUT=","StatementOptionHelp":{"#cdata":"[Syntax: OUT=SAS data set] \n          \nGives the name of the new data set. By default, the procedure uses the DATAn convention \nto name the new data set."},"StatementOptionType":"V"}]}},{"StatementName":"STORE","StatementHelp":{"#cdata":"Syntax: STORE <OUT=>item-store-name </ LABEL='label'> ;\n      \nThe STORE statement requests that the procedure save the context and results of the \nstatistical analysis. The resulting item store is a binary file format that cannot \nbe modified. The contents of the item store can be processed with the PLM procedure."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"OUT=","StatementOptionHelp":{"#cdata":"Syntax: OUT=item-store-name \n          \nThe item-store-name is a usual one- or two-level SAS name, like the names that are used \nfor SAS data sets. If you specify a one-level name, then the item store resides in the \nWORK library and is deleted at the end of the SAS session. Since item stores usually are \nused to perform postprocessing tasks, typical usage specifies a two-level name of the \nform libname.membername."},"StatementOptionType":"RV"},{"StatementOptionName":"LABEL=","StatementOptionHelp":{"#cdata":"You can add a custom label with the LABEL= option in the STORE statement after the \nslash (/). When the PLM procedure processes an item store, the label appears in \nthe PROC PLM output along with other identifying information."},"StatementOptionType":"S"}]}},{"StatementName":"WEIGHT","StatementHelp":{"#cdata":"Syntax: WEIGHT variable ;\n      \nA WEIGHT statement names a variable in the input data set with values that are relative \nweights for a weighted least squares fit. If the weight value is proportional to the \nreciprocal of the variance for each observation, then the weighted estimates are the best \nlinear unbiased estimates (BLUE). \n\nValues of the weight variable must be nonnegative. If an observation's weight is zero, \nthe observation is deleted from the analysis. If a weight is negative or missing, it is \nset to zero, and the observation is excluded from the analysis."},"StatementOptions":null}]}}}