{"Procedure":{"Name":"GRADAR","ProductGroup":"SAS/GRAPH","ProcedureHelp":{"#cdata":"Syntax: PROC GRADAR <DATA=input-data-set> <GOUT=<libref.>output-catalog> \n      <ANNOTATE=Annotate-data-set>;  \n      CHART chart-variable </ option(s)>;  \n\nThe GRADAR procedure creates radar charts that show the relative frequency of data measures \nin quality control or market research problems. Radar charts are sometimes also called star \ncharts. \n\nOn a radar chart, the chart statistics are displayed along spokes that radiate from the center \nof the chart. The charts are often stacked on top of one another with reference circles, thus \ngiving them the look of a radar screen. By default, the chart vertices--the points where the \nstatistical values intersect the spokes--are based on the frequencies associated with the levels \nof a single numeric variable. Non-integer values of the chart variable are truncated to integers. \nThe measures can be displayed in decreasing order, the order in which they appear in the input \ndata, increasing order of internal values, or lexicographic order of variable names. \n\nNote: The GRADAR procedure is not supported by the Java device drivers."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"ANNOTATE=|ANNO=","ProcedureOptionHelp":{"#cdata":"[Syntax: ANNOTATE=Annotate-data-set] \n      \nSpecifies a data set to add annotate elements to all graphs that are produced by the GRADAR \nprocedure. To add annotate elements to individual graphs, use ANNOTATE= in the CHART statement.\n\nRestriction: The GRADAR procedure does not support coordinate systems 2 or 8."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=input-data-set] \n      \nSpecifies the SAS data set that contains the variable(s) to chart. By default, \nthe procedure uses the most recently created SAS data set."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"GOUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: GOUT=<libref.>output-catalog] \n      \nSpecifies the SAS catalog in which to save the graphics output produced by the \nGRADAR procedure."},"ProcedureOptionType":"DV"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"CHART","StatementHelp":{"#cdata":"Syntax: CHART chart-variable </ option(s)>; \n      \nCreates the radar charts in which the length of the vertices along the spines represent \nthe values of the chart statistic for the data categories."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ACROSSVAR=|ACROSS=","StatementOptionHelp":{"#cdata":"[Syntax: ACROSSVAR=variable] \n          \nGenerates a radar chart for each value of the specified variable and displays the charts \nfrom left-to-right across the output area. If used with the DOWN= option, the charts are \ndrawn in left-to-right and top-to-bottom order. To limit the number of columns or rows that \nare displayed, specify the NCOLS= and NROWS= options.\n\nRestriction: This option is not valid with CALENDAR charts--use the OVERLAY option instead."},"StatementOptionType":"V"},{"StatementOptionName":"ANNOTATE=|ANNO=","StatementOptionHelp":{"#cdata":"[Syntax: ANNOTATE=Annotate-data-set] \n          \nSpecifies a data set to add annotate elements to charts produced by the CHART statement. \n\nRestriction: The GRADAR procedure does not support coordinate systems 2 or 8."},"StatementOptionType":"DV"},{"StatementOptionName":"CALENDAR","StatementOptionHelp":{"#cdata":"Produces a radar chart displaying 12 equal-sized segments, one for each month of the year \nJanuary through December. The color shading of each segment represents the magnitude of \nthe frequency variable. Use the OVERLAY variable to subdivide each segment, for example, \nby year.\n\nRestriction: When you specify the CALENDAR option, you must also specify the OVERLAYVAR= option."},"StatementOptionType":"S"},{"StatementOptionName":"CAXIS=|CAXES=|CA=","StatementOptionHelp":{"#cdata":"[Syntax: AXIS=grid-color] \n          \nSpecifies a color for the chart frame outline and the spokes or grid lines of the chart. \nThe specified color must be a valid SAS/GRAPH color name. If you omit the CAXIS= option, \nthe default color is retrieved from the current style or from the first color in the color \nlist if the NOGSTYLE system option is specified."},"StatementOptionType":"C"},{"StatementOptionName":"CFRAME=|CFR=","StatementOptionHelp":{"#cdata":"[Syntax: CFRAME=background-color | (variable)] \n          \nFills the frame area with the specified color. You can specify a valid SAS/GRAPH color name, \nor a character variable of length eight whose value is the background color."},"StatementOptionType":"C"},{"StatementOptionName":"CFRAMESIDE=","StatementOptionHelp":{"#cdata":"[Syntax: CFRAMESIDE=color | (variable)] \n          \nSpecifies the color for filling the frame area for the row labels displayed along the left \nside of a chart. The specified color must be a valid SAS/GRAPH color name or a character \nvariable of length eight whose value is a valid SAS/GRAPH color name. If a label is associated \nwith the classification variable, the specified color is also used to fill the frame area for \nthis label. By default, these areas are not filled. \n\nRestriction: The CFRAMESIDE= option is ignored unless you also specify the DOWNVAR= option."},"StatementOptionType":"C"},{"StatementOptionName":"CFRAMETOP=","StatementOptionHelp":{"#cdata":"[Syntax: CFRAMETOP=color | (variable)] \n          \nSpecifies the color for filling the frame area for the column labels that are displayed \nacross the top of a chart. The specified color must be a valid SAS/GRAPH color name, or \na character variable of length eight whose value is a valid SAS/GRAPH color name. If a \nlabel is associated with the classification variable, the specified color is also used \nto fill the frame area for this label. By default, these areas are not filled.\n\nRestriction: The CFRAMESIDE= option is ignored unless you also specify the ACROSSVAR= option."},"StatementOptionType":"C"},{"StatementOptionName":"CSPOKES=|CSPOKE=","StatementOptionHelp":{"#cdata":"[Syntax: CSPOKES=spoke-color | (variable)] \n          \nSpecifies a color to use for the spokes in a chart. The specified color must be a valid \nSAS/GRAPH color name, or a character variable of length eight whose value is the color. \nThe default color is specified by the current style or is the first color in the color \nlist if the NOGSTYLE option is specified."},"StatementOptionType":"C"},{"StatementOptionName":"CSTARCIRCLES=|CSTARCIRCLE=","StatementOptionHelp":{"#cdata":"[Syntax: CSTARCIRCLES=color | (colors-list)] \n          \nSpecifies a color or list of colors for the circles that are requested with the STARCIRCLES= \noption. All specified colors must be valid SAS/GRAPH color names, or a character variable of \nlength eight whose value is the color. By default, the color specified with the CSTARS= option \nis used. If the CSTARS= option is omitted, the default color is specified by the current style \nor is the first color in the color list if the NOGSTYLE option is specified."},"StatementOptionType":"C"},{"StatementOptionName":"CSTARFILL=","StatementOptionHelp":{"#cdata":"[Syntax: CSTARFILL=color | (color-list)] \n          \nSpecifies a color or colors for filling the interior of stars when STARFILL= is set to SOLID."},"StatementOptionType":"C"},{"StatementOptionName":"CSTARS=|CSTAR=","StatementOptionHelp":{"#cdata":"[Syntax: CSTARS=color | (color-list)] \n          \nSpecifies a color or list of colors for the outlines of stars."},"StatementOptionType":"C"},{"StatementOptionName":"CTEXT=","StatementOptionHelp":{"#cdata":"[Syntax: CTEXT=text-color] \n          \nSpecifies a color for all text on the chart."},"StatementOptionType":"C"},{"StatementOptionName":"CTILES=|CTILE=","StatementOptionHelp":{"#cdata":"[Syntax: CTILES=(variable) | color] \n          \nSpecifies either a character variable of length eight whose values are the fill colors for \nthe tiles or a single color that is the fill color for all tiles. \n\nIf you specify a variable, the values of the specified variable must be identical for all \nobservations with the same level of the classification variables. The same color can be used \nto fill more than one tile. Use the special value, EMPTY, to indicate that a tile is not to be \nfilled.\n\nThe CTILES= option cannot be used in conjunction with the NOFRAME option or the CFRAME= option. \nYou can use the TILELEGEND= option in conjunction with the CTILES= option to add an explanatory \nlegend for the CTILES= option colors at the bottom of the chart."},"StatementOptionType":"C"},{"StatementOptionName":"DESCRIPTION=|DES=","StatementOptionHelp":{"#cdata":"[Syntax: DESCRIPTION='description'] \n          \nSpecifies the description of the output. The maximum length for description is 256 characters. \nThe description does not appear in the output."},"StatementOptionType":"V"},{"StatementOptionName":"DOWNVAR=|DOWN=","StatementOptionHelp":{"#cdata":"[Syntax: DOWNVAR=variable] \n          \nGenerates a radar chart for each value of the specified variable, and displays the charts \nfrom top-to-bottom. If used with the ACROSS= option, the charts are drawn in left-to-right \nand top-to-bottom order. To limit the number of columns or rows that are displayed, use the \nNCOLS= option or the NROWS= option.\n\nRestriction: This option is not valid with CALENDAR charts--use OVERLAY instead."},"StatementOptionType":"V"},{"StatementOptionName":"FONT=","StatementOptionHelp":{"#cdata":"[Syntax: FONT=font] \n          \nSpecifies the font for all text strings in the radar chart. If you omit the FONT= option, the \nfont that is specified by the FTEXT= graphics option is used. If neither option is specified, \nthe default font is specified by the current style or, if the NOGSTYLE option is specified, by \nthe current device."},"StatementOptionType":"V"},{"StatementOptionName":"FRAME","StatementOptionHelp":{"#cdata":"Specifies that a frame is drawn around the chart."},"StatementOptionType":"S"},{"StatementOptionName":"NOFRAME","StatementOptionHelp":{"#cdata":"Specifies that no frame is drawn around the chart."},"StatementOptionType":"S"},{"StatementOptionName":"FREQ=","StatementOptionHelp":{"#cdata":"[Syntax: FREQ=numeric-variable] \n          \nSpecifies a variable whose values weight the contribution of each observation in the computation \nof the chart statistic. Each observation is counted the number of times that are specified by the \nvalue of numeric-variable for that observation. If the value of numeric-variable is missing, 0, or \nnegative, the observation is not used in the statistic calculation. Non-integer values of numeric-\nvariable are truncated to integers.\n\nThe statistics are not affected by applying a format to numeric-variable."},"StatementOptionType":"NVL"},{"StatementOptionName":"HEIGHT=|HLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: HEIGHT=height] \n          \nSpecifies the height in cells for labels and legends. The HEIGHT= option overrides the HTEXT= \noption in a GOPTIONS statement. This does not change the size of titles or footnotes."},"StatementOptionType":"V"},{"StatementOptionName":"HTML=","StatementOptionHelp":{"#cdata":"[Syntax: HTML=variable] \n          \nIdentifies the variable in the input data set whose values create links in the HTML file \ncreated by the ODS statement."},"StatementOptionType":"V"},{"StatementOptionName":"HTML_LEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: HTML_LEGEND=variable] \n          \nIdentifies the variable in the input data set whose values create links in the HTML file that \nis created by the ODS statement."},"StatementOptionType":"V"},{"StatementOptionName":"IFRAME=","StatementOptionHelp":{"#cdata":"[Syntax: IFRAME=fileref | \"external-image-file\"] \n          \nSpecifies an image file to use on the chart's frame. Fileref must be a valid SAS fileref up \nto eight characters long and must have been previously assigned with a FILENAME statement. \nExternal-image-file must specify the complete filename of the image file you want to use. \nThe format of external-image-file varies across operating environments."},"StatementOptionType":"V"},{"StatementOptionName":"IMAGESTYLE=","StatementOptionHelp":{"#cdata":"Specifies the way to display the image file that is specified on the IFRAME= option."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"TILE","@Value2":"FIT"},"StatementOptionToolTips":{"@ToolTip1":"Copies the image as many times as needed to fit the frame.","@ToolTip2":"Stretches the image so that a single copy fits within the frame."}},{"StatementOptionName":"INBORDER","StatementOptionHelp":{"#cdata":"Generates a inside border around the chart."},"StatementOptionType":"V"},{"StatementOptionName":"INHEIGHT=","StatementOptionHelp":{"#cdata":"[Syntax: INHEIGHT=value] \n          \nSpecifies the height for spoke labels. The default unit is PCT, which is percentage of graphics  \noutput area. The INHEIGHT= option overrides the HTEXT= option in a GOPTIONS statement. This option \ndoes not change the size of titles or footnotes."},"StatementOptionType":"V"},{"StatementOptionName":"INTERTILE=|INTERCHART=","StatementOptionHelp":{"#cdata":"[Syntax: INTERTILE=value] \n          \nSpecifies the distance (in cells) between tiles in a chart, and is used only with the ACROSSVAR= \noption and the DOWNVAR= option. By default, the tiles are contiguous (value=0)."},"StatementOptionType":"V"},{"StatementOptionName":"LSPOKES=","StatementOptionHelp":{"#cdata":"[Syntax: LSPOKES=linetype] \n          \nSpecifies a line type for the spokes in a radar chart. \n\nDefault: 1 (solid line)"},"StatementOptionType":"V"},{"StatementOptionName":"LSTARCIRCLES=|LSTARCIRCLE=","StatementOptionHelp":{"#cdata":"[Syntax: LSTARCIRCLES=linetypes | (linetypes)] \n          \nSpecifies one or more line types for the circles requested with the STARCIRCLES= option. \nIf the number of line types specified with LSTARCIRCLES= matches the number of circles \nrequested with STARCIRCLES=, then the line types are paired with the circles in the order \nspecified. If you request more circles than you specify lines types for, SAS/GRAPH uses the \nline types that you specify and defaults to 1 (solid) for the remaining circles.\n\nDefault: 1 (solid line)"},"StatementOptionType":"V"},{"StatementOptionName":"LSTARS=|LSTAR=","StatementOptionHelp":{"#cdata":"[Syntax: LSTARS=(linetypes)] \n          \nSpecifies the line types for the outlines of stars that are produced for a radar chart. \nBy default, the outlines rotate through the list of line types. The default line type \nfor the star positioned at subgroup n is the value of the line type corresponding to the \nposition n in the list of line types."},"StatementOptionType":"V"},{"StatementOptionName":"MAXNVERT=|MAXVERT=","StatementOptionHelp":{"#cdata":"[Syntax: MAXNVERT=n] \n          \nSpecifies the maximum number of vertices, from 1 to 360, in the radar chart."},"StatementOptionType":"V"},{"StatementOptionName":"MISSING","StatementOptionHelp":{"#cdata":"Accepts a missing value as a valid midpoint for the chart variable. By default, observations \nwith missing values are ignored. Missing values are always valid for the overlay variables."},"StatementOptionType":"S"},{"StatementOptionName":"MODE=","StatementOptionHelp":{"#cdata":"Specifies the display mode for a radar chart."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"SHARE","@Value2":"PROTECT","@Value3":"RESERVE"},"StatementOptionToolTips":{"@ToolTip1":"Shares the drawing space between the text and the graph.","@ToolTip2":"Shares the drawing space but maintains a solid rectangle (using the  background color) behind the text.","@ToolTip3":"Reduces the size of the text and graph in order to accommodate both."}},{"StatementOptionName":"NAME=","StatementOptionHelp":{"#cdata":"[Syntax: NAME=\"name\"] \n          \nSpecifies the name of the GRSEG catalog entry and the name of the graphics output file, if \none is created. The name can be up to 256 characters long, but the GRSEG name is truncated \nto eight characters. Uppercase characters are converted to lowercase, and periods are converted \nto underscores. The default name is RADAR. If the name duplicates an existing name, then SAS/GRAPH \nadds a number to the name to create a unique name--for example, RADAR1."},"StatementOptionType":"V"},{"StatementOptionName":"NCOLS=|NCOL=","StatementOptionHelp":{"#cdata":"[Syntax: NCOLS=n] \n          \nSpecifies the number of columns in a chart. You can use the NCOLS= option in conjunction with \nthe NROWS= option. NCOLS=2 and NROWS=2 if two classification variables are specified. If used \nwith the ACROSSVAR= or DOWNVAR= options, the default number of columns or rows is calculated \nfrom the number of classifications for the variables that are listed on the ACROSSVAR= or DOWNVAR= \noptions. In that case, you can use the NCOLS= option and NROWS= option to limit the number of \ncolumns and rows that are specified.\n\nDefault: 1 if one classification variable is specified"},"StatementOptionType":"V"},{"StatementOptionName":"NLEVELS=","StatementOptionHelp":{"#cdata":"[Syntax: NLEVELS=n] \n          \nSpecifies the number of colors used in the calendar chart to represent the magnitude of the \nfrequency variable. The colors are shown in the legend as a color ramp ranging from white to \nthe full intensity of one color.\n\nDefault: 6"},"StatementOptionType":"V"},{"StatementOptionName":"NOLOGEND","StatementOptionHelp":{"#cdata":"Suppresses the legend that is otherwise automatically displayed."},"StatementOptionType":"S"},{"StatementOptionName":"NOZEROREF","StatementOptionHelp":{"#cdata":"Turns off the zero reference circle when negative values are plotted. When a negative value \nis plotted, a dashed circle indicates the zero position. You cannot change the appearance \nof this zero reference circle, but you can turn it off with the NOZEROREF option. The zero \nreference circle does not appear if there are no negative values plotted."},"StatementOptionType":"S"},{"StatementOptionName":"NROWS=|NROW=","StatementOptionHelp":{"#cdata":"[Syntax: NROWS=n] \n          \nSpecifies the number of rows in a chart."},"StatementOptionType":"V"},{"StatementOptionName":"ORDERACROSS=","StatementOptionHelp":{"#cdata":"Specifies the display order for the values of the ACROSS= option variable."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FREQ","@Value2":"DATA","@Value3":"INTERNAL","@Value4":"FORMATTED","@Value5":"EXTERNAL"},"StatementOptionToolTips":{"@ToolTip1":"Orders values by descending frequency count so that levels with the most observations  are listed first.","@ToolTip2":"Orders values according to their order in the input data set.","@ToolTip3":"Orders values by their unformatted values, which yields the same order as PROC SORT.","@ToolTip4":"Orders values by their ascending formatted values. This order depends on your  operating environment.","@ToolTip5":"(Description not currently available)"}},{"StatementOptionName":"OTHER=","StatementOptionHelp":{"#cdata":"[Syntax: OTHER=\"category\"] \n          \nSpecifies a new category that merges all categories not selected because of the MAXNVERT= option. \nThe category should be specified as a formatted value of the chart variable.\n\nRestriction: The OTHER= option is ignored unless you also specify the MAXNVERT= option."},"StatementOptionType":"V"},{"StatementOptionName":"OVERLAYVAR=|OVERLAY=","StatementOptionHelp":{"#cdata":"[Syntax: OVERLAYVAR=overlay-variable] \n          \nCreates a comparative radar chart using the levels of the overlay variable. All charts are \ndisplayed in the same set of spokes. A maximum of 24 overlays can be displayed in a single \nradar chart.\n\nRestriction: This option cannot be used with the ACROSSVAR= option or the DOWNVAR= options."},"StatementOptionType":"VL"},{"StatementOptionName":"SPEED=","StatementOptionHelp":{"#cdata":"[Syntax: SPEED=speed-variable] \n          \nSpecifies the wind speed in windrose charts."},"StatementOptionType":"V"},{"StatementOptionName":"SPIDERWEB|SPIDER","StatementOptionHelp":{"#cdata":"Displays lines connecting the points where tick marks would be instead of displaying the \ntick marks, using the same number of points for all axes as for the first axis.  \n\nThe default number of web lines is three."},"StatementOptionType":"S"},{"StatementOptionName":"SPKLABEL=","StatementOptionHelp":{"#cdata":"Labels the chart spokes with the category of the variable that is being charted. The default \nis CATEGORY; however, if the STARLEGEND= option is specified, the default is NONE."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"CATEGORY","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Labels the chart spokes with the category of the variable that is being charted.","@ToolTip2":"Suppresses the labels."}},{"StatementOptionName":"SPOKESCALE=","StatementOptionHelp":{"#cdata":"Specifies whether every spoke is drawn to the same scale, or whether each spoke is drawn to \na different scale."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"CATEGORY","@Value2":"VERTEX"},"StatementOptionToolTips":{"@ToolTip1":"GRADAR procedure determines the minimum and maximum value of all the spokes.  Then, the vertices of all the spokes have that same maximum value and minimum value.","@ToolTip2":"Each vertex has its own maximum value and minimum value, and each vertex is labeled at the tick marks."}},{"StatementOptionName":"STARAXIS=|STARAXES=","StatementOptionHelp":{"#cdata":"[Syntax: STARAXIS= (AXIS<1...99><, ... ,AXIS<1...99>>)] \n          \nAssigns one or more axis definitions to the axis spokes in the radar chart. GRADAR displays \naxis spokes clockwise, starting at the 12 o'clock position. The axis definitions that are \nspecified using the STARAXIS= option are assigned consecutively to the spokes, starting from \nthe first spoke. AXIS statements are assigned in clockwise order. For example, the STARAXIS=\n(AXIS3, AXIS1, AXIS2) option assigns the AXIS3 statement's definition to the first axis spoke \n(at the 12 o'clock position), the AXIS1 statement's definition to the second axis spoke, and \nthe AXIS2 statement's definition to the third axis spoke."},"StatementOptionType":"V"},{"StatementOptionName":"STARCIRCLES=|STARCIRCLE=","StatementOptionHelp":{"#cdata":"[Syntax: STARCIRCLES=(values)] \n          \nSpecifies reference circles that are superimposed on the stars that are produced for a radar \nchart. All of the circles are displayed and centered at each point plotted on the primary chart. \nThe value determines the diameter of the circle. A value of 0.0 specifies a circle with the inner \nradius, which displays a circle at the minimum data value. A value of 1.0 specifies a circle with \nthe outer radius, which is the length of the spokes in the chart. In general, a value of h specifies \na circle with a radius equal to inradius + h×(outradius - inradius).\n\nFor example, the values 0.0 and 1.0 correspond to an inner circle and an outer circle. The value \n0.5 specifies a circle with a radius of inradius + 0.5×( outradius - inradius), or a circle halfway \nbetween the inner circle and the outer circle. Likewise, the value 0.25 specifies a circle one-fourth \nof the way from the inner circle to the outer circle.\n\nTo specify the line types for the circles, use the LSTARCIRCLES= option. To specify colors for the \ncircles, use the CSTARCIRCLES= option."},"StatementOptionType":"V"},{"StatementOptionName":"STARFILL=","StatementOptionHelp":{"#cdata":"[Syntax: STARFILL= lists of (SOLID | EMPTY) one for each star] \n          \nDetermines whether the stars in the radar chart are empty or filled with a solid color. \nValid values are EMPTY (the default) and SOLID. If there are multiple stars in the chart, \nspecify, in parentheses, a separate value for each star.\n\nIf the STARFILL=(SOLID) option and the CSTARFILL= option are not specified, then each star is \nfilled with the colors specified on the CSTARS= option. If the CSTARS= option is not specified, \nthen the fill colors are determined by the current style or, if the NOGSTYLE option is specified, \nby the device color list.\n\nIf STARFILL= is not set or is set to EMPTY, then CSTARFILL= is ignored."},"StatementOptionType":"V"},{"StatementOptionName":"STARINRADIUS=","StatementOptionHelp":{"#cdata":"[Syntax: STARINRADIUS=percent] \n          \nSpecifies inner radius of stars as a percent from 0 to 100. The inner radius of a star is \nthe distance from the center of the star to the circle that represents the lower limit of \nthe standardized vertex variables. The lower limit can correspond to the minimum value, a \nmultiple of standard deviations below the mean, or a lower specification limit. The value \nmust be less than the value that is specified with the STAROUTRADIUS= option. The default \nvalue is one-third of the outer radius."},"StatementOptionType":"V"},{"StatementOptionName":"STARLEGEND=","StatementOptionHelp":{"#cdata":"Specifies the style of the legend used to identify the vertices of stars that are produced for \na radar chart."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"CLOCK","@Value2":"CLOCK0","@Value3":"NUMBER","@Value4":"DEGREES","@Value5":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Identifies the vertex variables by their positions on the clock (starting with 12:00).","@ToolTip2":"Identifies the vertex variables by their positions on the clock (starting with 0:00  corresponding to 12:00).","@ToolTip3":"Identifies the vertex variables by numbers, with 1 corresponding to 12 o'clock.  Legend entries are assigned in clockwise order.","@ToolTip4":"Identifies the vertex variables by angles in degrees, with 0 degrees corresponding  to 12 o'clock.","@ToolTip5":"Suppresses the legend. This is the default."}},{"StatementOptionName":"STARLEGENDLAB=","StatementOptionHelp":{"#cdata":"[Syntax: STARLEGENDLAB=\"legend-label\"] \n          \nSpecifies the label displayed to the left of the legend for stars requested with the STARLEGEND= option. \nThe label can be up to 16 characters and must be enclosed in quotes. The default label is Vertices:."},"StatementOptionType":"V"},{"StatementOptionName":"STAROUTRADIUS=","StatementOptionHelp":{"#cdata":"[Syntax: STAROUTRADIUS=value] \n          \nSpecifies outer radius of stars as a percent up to 100. The value must be greater than the \nvalue of the STARINRADIUS= option. The inner radius of a star is the distance from the center \nof the star to the circle that represents the lower limit of the standardized vertex variables. \nThe lower limit can correspond to the minimum value, a multiple of standard deviations below the \nmean, or a lower specification limit."},"StatementOptionType":"V"},{"StatementOptionName":"STARSTART=","StatementOptionHelp":{"#cdata":"[Syntax: STARSTART=value] \n          \nSpecifies the vertex angle for the first variable that is specified on the CHART statement. \nYou can specify the value in the following ways: \n\n  Clock position: If you specify the value as a time literal (between '0:00'T and '12:00'T), \n  the corresponding clock position is used for the first vertex variable. For example, '12:00'T \n  indicates the 12 o'clock position, '03:00'T the 3 o'clock position (90 degrees), and '09:00'T \n  the 9 o'clock position (270 degrees).\n\n  Degrees: To specify a value in degrees you must specify a negative number. (This is to \n  distinguish degrees from clock values, which are stored internally as positive numbers.) \n  If you specify a negative number, the absolute value is used for the first vertex angle \n  in degrees. Here, 0 degrees corresponds to 12:00, -90 degrees to 3:00, and -270 degrees \n  to 9:00. Always specify the value in degrees as a negative number.\n\nThe default value is zero, so the first vertex variable is positioned at 12:00."},"StatementOptionType":"V"},{"StatementOptionName":"STARTYPE=","StatementOptionHelp":{"#cdata":"Specifies the style of the stars that are produced for a radar chart."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"CORONA","@Value2":"POLYGON","@Value3":"RADIAL","@Value4":"SPOKE","@Value5":"WEDGE"},"StatementOptionToolTips":{"@ToolTip1":"Polygon with star-vertices emanating from the inner circle","@ToolTip2":"Closed polygon","@ToolTip3":"Rays emanating from the center","@ToolTip4":"Rays emanating from the inner circle","@ToolTip5":"Closed polygon with rays from the center to the full spoke length."}},{"StatementOptionName":"SUMVAR=","StatementOptionHelp":{"#cdata":"[Syntax: SUMVAR=summary-variable] \n          \nSpecifies a numeric variable to be used to construct weighted radar charts. The values of \nsummary-variable can be positive, negative, zero, or missing.  If SUMVAR= is not specified, \nthe weights applied to the chart variable are assumed to be one. The chart is not affected \nby applying a format to numeric-variable."},"StatementOptionType":"NVL"},{"StatementOptionName":"TILELEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: TILELEGEND=(variable)] \n          \nSpecifies a variable used to add a legend for CTILES= colors. The variable can have a formatted \nlength less than or equal to 32. If a format is associated with the variable, then the formatted \nvalue is displayed. The TILELEGEND= option must be used in conjunction with the CTILES= option for \nfilling the tiles in a chart. If CTILES= is specified and TILELEGEND= is not specified, a color \nlegend is not displayed.\n\nThe values of the CTILES= and TILELEGEND= variables should be consistent for all observations \nwith the same level of the classification variables. The value of the TILELEGEND= variable is \nused to identify the corresponding color value of the CTILES= variable in the legend."},"StatementOptionType":"V"},{"StatementOptionName":"TILELEGLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: TILELEGLABEL=\"label\"] \n          \nSpecifies a label displayed to the left of the legend that is created when you specify a \nTILELEGEND= variable. The label can be up to 16 characters and must be enclosed in quotes. \nThe default label is Tiles:."},"StatementOptionType":"V"},{"StatementOptionName":"URL=","StatementOptionHelp":{"#cdata":"[URL=character-variable \n          \nSpecifies a character variable whose values are URLs. The variable values are URLs for \nWeb pages to display when the user clicks (drills down) on elements in the graph. \n\nRestrictions: This option affects graphics output that is created through the ODS HTML \ndestination only. Not supported by GIF, PNG, and ACTIVEX devices.\n\nInteraction: If you specify both the HTML= and the URL= options, then the URL= option \nis ignored."},"StatementOptionType":"V"},{"StatementOptionName":"WFRAME=|WAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: WFRAME=n] \n          \nSpecifies the width in pixels for the frame lines. \n\nDefault: 1"},"StatementOptionType":"V"},{"StatementOptionName":"WINDROSE","StatementOptionHelp":{"#cdata":"Specifies creation of a windrose chart. The windrose chart is named for charts of wind speed and \ndirection. Windrose charts are a type of histogram which are useful when the extreme values of \nthe histogram's midpoint variable are related. Typical applications include histograms involving \ndirection, clock time, or other cyclical values."},"StatementOptionType":"S"},{"StatementOptionName":"WINDROSECIRCLES=|WINDROSECIRCLE=","StatementOptionHelp":{"#cdata":"[Syntax: WINDROSECIRCLES=n] \n          \nSpecifies the number of reference circles."},"StatementOptionType":"V"},{"StatementOptionName":"WSPOKES=|WSPOKE=","StatementOptionHelp":{"#cdata":"[Syntax: WSPOKES=line-width] \n          \nSpecifies the width in pixels of the spokes in a radar chart. \n\nDefault: 1"},"StatementOptionType":"V"},{"StatementOptionName":"WSTARCIRCLES=","StatementOptionHelp":{"#cdata":"[Syntax: WSTARCIRCLES=(line-widths)] \n          \nSpecifies the width in pixels of the outline of circles requested by the STARCIRCLES= option. \n\nDefault: 1 \n\nRestriction: This option is ignored unless the STARCIRCLES= option is specified."},"StatementOptionType":"V"},{"StatementOptionName":"WSTARS=|WSTAR=","StatementOptionHelp":{"#cdata":"[Syntax: WSTARS=line-width | (line-widths)] \n          \nSpecifies the width in pixels of the outline of stars that are produced for a radar chart. \n\nDefault: 1"},"StatementOptionType":"V"}]}},{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nThe BY statement divides the observations from an input data set into groups for processing. \nEach set of contiguous observations with the same value for a specified variable is called a \nBY group. A variable that defines BY groups is called a BY variable and is the variable that \nis specified in the BY statement. When you use a BY statement, the graphics procedure performs \nthe following operations:\n\n  • processes each group of observations independently\n\n  • generates a separate graph or output for each BY group\n\n  • automatically adds a heading called a BY line to each graph identifying the BY group \n    represented in the graph\n\n  • adds BY statement information below the Description field of the catalog entry.\n\nBy default, the procedure expects the observations in the input data set to be sorted \nin ascending order of the BY variable values. \n\nNote: The BY statement in SAS/GRAPH is essentially the same as the BY statement in Base SAS.\nHowever, the effect on the output is different when it is used with SAS/GRAPH procedures."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Indicates that the data set is sorted in descending order by the specified variable. \nThe option affects only the variable that immediately follows the option name, and \nmust be repeated before every variable that is not sorted in ascending order."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations with the same BY value are grouped together, but are not \nnecessarily sorted in alphabetical or numeric order. The observations can be grouped \nin another way, for example, in chronological order.\n\nNOTSORTED can appear anywhere in the BY statement and affects all variables specified \nin the statement. NOTSORTED overrides DESCENDING if both appear in the same BY statement."},"StatementOptionType":"S"}]}},{"StatementName":"NOTE","StatementHelp":{"#cdata":"Syntax: NOTE <text-arguments(s)>; \n      \nControls the content, appearance, and placement of text. \n\ntext-argument(s) can be one or more of these: \n\n \"text-string\"\n \n text-options (text options must precede text-string.)"},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ANGLE=|A=","StatementOptionHelp":{"#cdata":"[Syntax: ANGLE=degrees | A=degrees] \n          \nSpecifies the angle of the baseline of the entire text string with respect to the \nhorizontal. A positive degrees value angles the baseline counterclockwise; a negative \nvalue angles it clockwise. By default, ANGLE=0 (horizontal)."},"StatementOptionType":"V"},{"StatementOptionName":"BCOLOR=|BC=","StatementOptionHelp":{"#cdata":"[Syntax: BCOLOR=background-color] \n          \nSpecifies the background color of a box produced by the BOX= option. If you omit \nBOX=, BCOLOR= is ignored. By default, the background color of the box is the same \nas the background color for the entire graph. The color of the frame of the box is \ndetermined by the color specification used in BOX=."},"StatementOptionType":"C"},{"StatementOptionName":"BLANK=YES|BL=YES","StatementOptionHelp":{"#cdata":"[Syntax: BLANK=YES] \n          \nProtects the box and its contents from being overwritten by any subsequent graphics elements\nby blanking out the area where the box is displayed. The BLANK= option enables you to overlay \ngraphics elements with boxed text. It is ignored if you omit the BOX= option. Because titles \nand footnotes are written from the highest numbered to the lowest numbered, the BLANK= option \nonly blanks out titles and footnotes of a lower number."},"StatementOptionType":"V"},{"StatementOptionName":"BOX=|BO=","StatementOptionHelp":{"#cdata":"Draws a box around one line of text."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2","@Value3":"3","@Value4":"4"},"StatementOptionToolTips":{"@ToolTip1":"A value of 1 produces the thinnest box lines.","@ToolTip2":"A value of 2 produces the next thinnest box lines.","@ToolTip3":"A value of 3 produces the next thickest box lines.","@ToolTip4":"A value of 4 produces the thickest box lines."}},{"StatementOptionName":"BSPACE=|BS=","StatementOptionHelp":{"#cdata":"[Syntax: BSPACE=box-space<units>] \n          \nSpecifies the amount of space between the boxed text and the box. The space above the text is \nmeasured from the font maximum, and the space below the text is measured from the font minimum.\nBy default, BSPACE=1. If the BOX= option is not used, the BSPACE= option is ignored."},"StatementOptionType":"V"},{"StatementOptionName":"COLOR=|C=","StatementOptionHelp":{"#cdata":"[Syntax: COLOR=color] \n          \nSpecifies the color for the following text, box, or line. The COLOR= option affects \nall text, lines, and boxes that follow it and stays in effect until another COLOR= \nspecification is encountered."},"StatementOptionType":"C"},{"StatementOptionName":"DRAW=|D=","StatementOptionHelp":{"#cdata":"[Syntax: DRAW=(x,y...,x-n,y-n)<units>] \n          \nDraws lines anywhere on the graphics output area using x and y as absolute or \nrelative coordinates."},"StatementOptionType":"V"},{"StatementOptionName":"FONT=|F=","StatementOptionHelp":{"#cdata":"[Syntax: FONT=font] \n          \nSpecifies the font for the subsequent text."},"StatementOptionType":"V"},{"StatementOptionName":"HEIGHT=|H=","StatementOptionHelp":{"#cdata":"[Syntax: HEIGHT=text-height<units>] \n          \nSpecifies the height of text characters in number of units. By default, HEIGHT=1. \nHeight is measured from the font minimum to the capline. Ascenders can extend above \nthe capline, depending on the font."},"StatementOptionType":"V"},{"StatementOptionName":"JUSTIFY=|J=","StatementOptionHelp":{"#cdata":"Specifies the alignment of the text string. The default is LEFT."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"LEFT","@Value2":"CENTER","@Value3":"RIGHT"},"StatementOptionToolTips":{"@ToolTip1":"Justify to the left.","@ToolTip2":"Justify to the center.","@ToolTip3":"Justify to the right."}},{"StatementOptionName":"LANGLE=|LA=","StatementOptionHelp":{"#cdata":"[Syntax: LANGLE=degrees] \n          \nSpecifies the angle of the baseline of the entire text string(s) with respect to \nthe horizontal. A positive value for degrees moves the baseline counterclockwise; \na negative value moves it clockwise. By default, LANGLE=0 (horizontal)."},"StatementOptionType":"V"},{"StatementOptionName":"LINK=","StatementOptionHelp":{"#cdata":"[Syntax: LINK= \"URL\"] \n          \nSpecifies a uniform resource locator (URL) that a title or footnote links to. The \ntext-string that you use to specify the URL can contain occurrences of the variables \n#BYVAL, #BYVAR, and #BYLINE."},"StatementOptionType":"V"},{"StatementOptionName":"LSPACE=|LS=","StatementOptionHelp":{"#cdata":"[Syntax: LSPACE=line-space <units>] \n          \nSpecifies the amount of spacing above lines of note and title text and the amount \nof spacing below lines of footnote text."},"StatementOptionType":"V"},{"StatementOptionName":"MOVE=|M=","StatementOptionHelp":{"#cdata":"[Syntax: MOVE=(x,y) <units>] \n          \nPositions subsequent text or lines anywhere on the graphics output area using x and y \nas absolute or relative coordinates."},"StatementOptionType":"V"},{"StatementOptionName":"ROTATE=|R=","StatementOptionHelp":{"#cdata":"[Syntax: ROTATE=degrees] \n          \nSpecifies the angle at which each character of text is rotated with respect to the \nbaseline of the text string. The angle is measured from the current text baseline \nangle, which is specified by the ANGLE= or LANGLE= options. By default, the baseline \nis horizontal. A positive value for degrees rotates the character counterclockwise; \na negative value rotates it clockwise. By default, ROTATE=0 (parallel to the baseline)."},"StatementOptionType":"V"},{"StatementOptionName":"UNDERLIN=|U=","StatementOptionHelp":{"#cdata":"Underlines subsequent text."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"0","@Value2":"1","@Value3":"2","@Value4":"3"},"StatementOptionToolTips":{"@ToolTip1":"UNDERLIN=0 halts underlining for subsequent text.","@ToolTip2":"Undelines with the thinnest line.","@ToolTip3":"Undelines with the next thickest line.","@ToolTip4":"Undelines with the thickest line."}},{"StatementOptionName":"WRAP","StatementOptionHelp":{"#cdata":"Wraps the text to a second line if the text does not fit on one line. If the WRAP \noption is omitted, the text font-size is reduced until the text fits on one line. \nWrapping occurs at the last blank before the text meets the end of the window. If \nthere are no blanks in the text string, then there is no wrapping."},"StatementOptionType":"S"}]}}]}}}