{"Procedure":{"Name":"GREDUCE","ProductGroup":"SAS/GRAPH","ProcedureHelp":{"#cdata":"Syntax: PROC GREDUCE <option(s)>;  \n    ID id-variable(s);  \n\nThe GREDUCE procedure processes map data sets so that they can draw simpler maps with fewer \nboundary points. It creates an output map data set that contains all of the variables in the \ninput map data set plus a new variable named DENSITY. For each observation in the input map \ndata set, the procedure determines the significance of that point for maintaining a semblance \nof the original shape and gives the observation a corresponding DENSITY value.\n\nYou can then use the value of the DENSITY variable to create a subset of the original map data \nset. The observations in the subset can draw a map that retains the overall appearance of the \noriginal map but contains fewer points, requires considerably less storage space, and can be \ndrawn much more quickly.\n\nGREDUCE does not produce any graphics output. Instead, it produces an output map data set that \ncan become either \n\n  o the input map data set for the GMAP procedure\n  o the input map data set for a DATA step that removes points from the map."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=input-map-data-set] \n      \nIdentifies the map data set that you want to process. By default, the procedure \nuses the most recently created SAS data set."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"E1=","ProcedureOptionHelp":{"#cdata":"[Syntax: E1=min-distance] \n      \nSpecify the minimum distance that a point must lie from a straight line segment \nto be included at density level 1."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"E2=","ProcedureOptionHelp":{"#cdata":"[Syntax: E2=min-distance] \n      \nSpecify the minimum distance that a point must lie from a straight line segment \nto be included at density level 2."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"E3=","ProcedureOptionHelp":{"#cdata":"[Syntax: E3=min-distance] \n      \nSpecify the minimum distance that a point must lie from a straight line segment \nto be included at density level 3."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"E4=","ProcedureOptionHelp":{"#cdata":"[Syntax: E4=min-distance] \n      \nSpecify the minimum distance that a point must lie from a straight line segment \nto be included at density level 4."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"E5=","ProcedureOptionHelp":{"#cdata":"[Syntax: E5=min-distance] \n      \nSpecify the minimum distance that a point must lie from a straight line segment \nto be included at density level 5."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"N1=","ProcedureOptionHelp":{"#cdata":"[Syntax: N1=max-points] \n      \nSpecify that for density level 1, the boundary of a unit area should contain no \nmore than max-points points."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"N2=","ProcedureOptionHelp":{"#cdata":"[Syntax: N2=max-points] \n      \nSpecify that for density level 2, the boundary of a unit area should contain no \nmore than max-points points."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"N3=","ProcedureOptionHelp":{"#cdata":"[Syntax: N3=max-points] \n      \nSpecify that for density level 3, the boundary of a unit area should contain no \nmore than max-points points."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"N4=","ProcedureOptionHelp":{"#cdata":"[Syntax: N4=max-points] \n      \nSpecify that for density level 4, the boundary of a unit area should contain no \nmore than max-points points."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"N5=","ProcedureOptionHelp":{"#cdata":"[Syntax: N5=max-points] \n      \nSpecify that for density level 5, the boundary of a unit area should contain no \nmore than max-points points."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NOCLEAN","ProcedureOptionHelp":{"#cdata":"Disables post-processing cleanup of the output data set. By default, the GREDUCE procedure \npost-processes the output data set to ensure that at least three vertices are present for \neach polygon at each density level. If you specify NOCLEAN, then shapes with only one or \ntwo points will be included in the output data set."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"OUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUT=output-data-set] \n      \nNames the new map data set, which contains all of the observations and variables in the \noriginal map data set plus the new DENSITY variable. If the input map data set contains \na variable named DENSITY, the GREDUCE procedure replaces the values of the variable in \nthe output map data set. The original values of the DENSITY variable from the input map \ndata set are not included in the output map data set.\n\nBy default, the GREDUCE procedure names the new data set that uses the DATAn naming \nconvention. That is, the procedure uses the name WORK.DATAn, where n is the next unused \nnumber in sequence. Thus, the first automatically named data set is DATA1, the second is \nDATA2, and so on."},"ProcedureOptionType":"DV"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"ID","StatementHelp":{"#cdata":"Syntax: ID id-variable(s); \n      \nIdentifies the variable or variables that define the hierarchy of the current unit \nareas in the input map data set."},"StatementOptions":null},{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nThe BY statement divides the observations from an input data set into groups for processing. \nEach set of contiguous observations with the same value for a specified variable is called a \nBY group. A variable that defines BY groups is called a BY variable and is the variable that \nis specified in the BY statement. When you use a BY statement, the graphics procedure performs \nthe following operations:\n\n  • processes each group of observations independently\n\n  • generates a separate graph or output for each BY group\n\n  • automatically adds a heading called a BY line to each graph identifying the BY group \n    represented in the graph\n\n  • adds BY statement information below the Description field of the catalog entry.\n\nBy default, the procedure expects the observations in the input data set to be sorted \nin ascending order of the BY variable values. \n\nNote: The BY statement in SAS/GRAPH is essentially the same as the BY statement in Base SAS.\nHowever, the effect on the output is different when it is used with SAS/GRAPH procedures."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Indicates that the data set is sorted in descending order by the specified variable. \nThe option affects only the variable that immediately follows the option name, and \nmust be repeated before every variable that is not sorted in ascending order."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations with the same BY value are grouped together, but are not \nnecessarily sorted in alphabetical or numeric order. The observations can be grouped \nin another way, for example, in chronological order.\n\nNOTSORTED can appear anywhere in the BY statement and affects all variables specified \nin the statement. NOTSORTED overrides DESCENDING if both appear in the same BY statement."},"StatementOptionType":"S"}]}}]}}}