{"Procedure":{"Name":"GREMOVE","ProductGroup":"SAS/GRAPH","ProcedureHelp":{"#cdata":"Syntax: PROC GREMOVE <DATA=input-map-data-set> \n    <FUZZ=fuzz-factor> <OUT=output-map-data-set> <NODECYCLE>;  \n    BY <DESCENDING>variable-l <...<DESCENDING>variable-n> <NOTSORTED>;  \n    ID variable(s);  \n\nThe GREMOVE procedure processes a map data set that is used as input. It does not produce any \ngraphics output. Instead, it produces an output data set that typically becomes the input map \ndata set for the GMAP procedure (see The GMAP Procedure). The GREMOVE procedure combines unit \nareas defined in a map data set into larger unit areas by removing shared borders between the \noriginal unit areas. For example, Map before Removing Borders (GRMUSMAP(a)) and Map after\nRemoving Borders (GRMUSMAP(b)) show combined unit areas in a typical map data set by removing \nstate boundaries to create regional census divisions."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=input-map-data-set] \n      \nSpecifies the map data set that is to be processed. By default, the procedure uses the most \nrecently created SAS data set. The GREMOVE procedure expects the observations in the input map \ndata set to be sorted in ascending order of the BY-variable values."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"FUZZ=","ProcedureOptionHelp":{"#cdata":"[Syntax: FUZZ=fuzz-factor] \n      \nSpecifies a tolerance for possible error in the data. This allows for points that are very close\nbut not quite equal to be considered as the same point. The fuzz-factor can be any non-negative \nnumber. A fuzz-factor of 0.0 would indicate that the points have to be exactly the same. The unit \nrepresented by the fuzz-factor (degrees, radians, feet, meters, kilometers, miles) is the same as \nthat represented by the X and Y values of the points. \n\nThe error is computed the same in both X and Y directions using the following formula: \n\n  Point_is_equal = (ABS(x1 - x2) <= fuzz-factor) && (ABS(y1 - y2) <= fuzz-factor)"},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NODECYCLE|NC","ProcedureOptionHelp":{"#cdata":"Tells PROC GREMOVE to use a topological algorithm for closing the resulting polygons. By default, \nPROC GREMOVE simply removes internal boundaries without using any polygon information. This might \ncause errors in closing the resulting polygons in certain cases--specifically when two resulting \npolygons intersect at a single point. Using a topological algorithm allows PROC GREMOVE to traverse \nthe resulting polygons for proper closure of the polygons. When the single point intersection is \nencountered, the algorithm uses the topology to correctly interpret which existing segment to choose \nin closing the polygon. The use of NODECYCLE, thus, requires that the data be topologically correct \n(that is, polygons do not overlap themselves or each other and there are no anomalies in the boundaries \nsuch as a repeated series of points)."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"OUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUT=output-data-set] \n      \nNames the new map data set, which contains the coordinates of the new unit areas created by \nthe GREMOVE procedure. By default, the GREMOVE procedure names the new data set using the DATAn \nnaming convention. That is, the procedure uses the name WORK.DATAn, where n is the next unused \nnumber in sequence. Thus, the first automatically named data set is DATA1, the second is DATA2, \nand so on."},"ProcedureOptionType":"DV"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nLists the variable or variables that identify the new unit areas."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"ID","StatementHelp":{"#cdata":"Syntax: ID id-variable(s); \n      \nIdentifies the variable or variables that define the hierarchy of the current unit areas \nin the input map data set."},"StatementOptions":null}]}}}