{"Procedure":{"Name":"GREPLAY","ProductGroup":"SAS/GRAPH","ProcedureHelp":{"#cdata":"Syntax: PROC GREPLAY <BYLINE> <CC=color-map-catalog> <CMAP=color-map-entry> \n    <FS> <GOUT=<libref.>output-catalog> <IGOUT=<libref.>input-catalog> \n    <IMAGEMAP=output-data-set> <NOBYLINE> <NOFS> <PRESENTATION> \n    <TC=template-catalog> <TEMPLATE=template-entry>;  \n    ? required-argument;  \n    BYLINE;  \n    CC color-map-catalog;  \n    CCOPY <color-map-catalog.>color-map-entry<.CMAP>;  \n    CDEF color-map-entry <color-definition(s)> <DES=\"description\">;  \n    CDELETE color-map-entry(s) | _ALL_ ;  \n    CMAP color-map-entry;  \n    COPY entry-id(s) | _ALL_ ;  \n    DELETE entry-id(s) | _ALL_ ;  \n    DEVICE device-name;  \n    FS;  \n    GOUT <libref.>output-catalog;  \n    GROUP entry-id(s);  \n    IGOUT <libref.>input-catalog ;  \n    LIST required-argument;  \n    MODIFY modify-pair(s);  \n    MOVE entry-id-1 AFTER | BEFORE entry-id-2;  \n    NOBYLINE;  \n    PREVIEW template-entry(s) | _ALL_ ;  \n    QUIT | END | STOP;  \n    REPLAY entry-id(s) | _FIRST_ | _LAST_ | _ALL_ ;  \n    TC template-catalog;  \n    TCOPY <template-catalog.>template-entry<.TEMPLATE>;  \n    TDEF template-entry \n    < panel definition(s)> \n    <DES=\"description\">;  \n    TDELETE template-entry(s) | _ALL_ ;  \n    TEMPLATE template-entry;  \n    TREPLAY select-pair(s);  \n\nThe GREPLAY procedure displays and manages graphics output that is stored in SAS catalogs. \nThe GREPLAY procedure also creates templates and color maps that you can use when you replay \nyour graphics output. The GREPLAY procedure operates in line mode, batch mode, and in the SAS \nwindowing environments."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"BYLINE","ProcedureOptionHelp":{"#cdata":"Specifies that the BY statement information for the SAS catalog entries should \nbe displayed. \n      \nDefault: BY statement information is displayed"},"ProcedureOptionType":"S"},{"ProcedureOptionName":"CC=","ProcedureOptionHelp":{"#cdata":"[Syntax: CC=color-map-catalog] \n      \nSpecifies the color map catalog where the color map entries are stored. \n\nNote: To replay graphics output using a color map, you must specify a color map catalog with \nthe CC= option and a color map entry with the CMAP= option. "},"ProcedureOptionType":"C"},{"ProcedureOptionName":"CMAP=","ProcedureOptionHelp":{"#cdata":"[Syntax: CMAP=color-map-entry-type] \n      \nSpecifies the type of catalog entry to use with the GREPLAY procedure. A color map entry \noption must have a catalog entry type of CMAP. \n\nNote: To replay graphics output using a color map entry, you must specify a color map catalog \nwith the CC= option and a color map entry with the CMAP= option. "},"ProcedureOptionType":"C"},{"ProcedureOptionName":"FS","ProcedureOptionHelp":{"#cdata":"Specifies that the GREPLAY procedure should use full-screen windows. \n      \nDefault: If your device supports windows, the GREPLAY procedure uses windows. If your device \ndoes not support windows, the procedure begins execution in line mode, and the FS option has \nno effect."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"GOUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: GOUT=<libref.>output-catalog] \n      \nSpecifies the graphics output catalog. New GRSEG entries or GRSEG entries from other catalogs \ncan be copied to an output catalog. If you omit the libref, SAS/GRAPH looks for the catalog in \nthe temporary WORK library, and creates the GSEG catalog if it does not exist. \n\nNote: The output catalog can be the same catalog specified in the IGOUT= option."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"IGOUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: IGOUT=<libref.>input-catalog] \n      \nSpecifies the input catalog that stores the graphics output that you want to use with the \nGREPLAY procedure. If you omit the libref, SAS/GRAPH looks for the catalog in the temporary \nWORK library.\n\nNote: The input catalog can be the same catalog specified in the GOUT= option."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"IMAGEMAP=","ProcedureOptionHelp":{"#cdata":"[Syntax: IMAGEMAP=output-data-set] \n      \nUsed with the REPLAY statement (see REPLAY Statement). The IMAGEMAP= option creates \na temporary SAS data set that contains information about the graph. The graph is replayed \nfrom the graphics catalog. The image map data set contains the following information about \nthe graph:\n\n  o the shapes of the elements \n  o the coordinates of the elements \n  o the values that are associated with those element; in variables that are identified \n    in the HTML= option \n  o the values that are associated with those element; in variables that are identified \n    in the HTML_LEGEND= option\n\nThe image map data set can be used to generate an HTML image map in an HTML output file \nusing the IMAGEMAP macro. The IMAGEMAP macro takes two arguments: the image map data set \nname and the name or fileref of an HTML output file, as shown in this example: \n\n  %imagemap(imgmapds, myimgmap.html);"},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"NOBYLINE","ProcedureOptionHelp":{"#cdata":"Specifies that the BY statement information for the SAS catalog entries should be suppressed. \n      \nDefault: BY statement information is displayed"},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOFS","ProcedureOptionHelp":{"#cdata":"Specifies that the GREPLAY procedure should use line mode. \n      \nDefault: If your device does not support windows: NOFS"},"ProcedureOptionType":"S"},{"ProcedureOptionName":"PRESENTATION","ProcedureOptionHelp":{"#cdata":"Specifies that the GREPLAY procedure should open the PRESENTATION window, and use the catalog \nspecified by the IGOUT= option as the input catalog. The PRESENTATION option is often used \nin applications to prevent the application users from deleting or reordering catalog entries. \nYou can only replay graphics output from the PRESENTATION window.\n\nNote: The PRESENTATION option overrides the NOFS option on full-screen devices."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"TC=","ProcedureOptionHelp":{"#cdata":"[Syntax: TC=template-catalog] \n      \nSpecifies the template catalog to use with the GREPLAY procedure, and identifies the template \ncatalog where the template entry is stored to replay your graphics. \n \nNote: To replay graphics output using a template catalog, you must also assign the template \nentry with the TEMPLATE= option."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"TEMPLATE=","ProcedureOptionHelp":{"#cdata":"[Syntax: TEMPLATE=template-entry] \n      \nIdentifies the template entry to use with the GREPLAY procedure. The template entry\nmust have a catalog entry type of TEMPLATE. \n\nNote: To replay graphics output using a template entry, you must also assign a current \ntemplate catalog with the TC= option. If the template entry is not in the template catalog, \nan error message is written to the SAS log."},"ProcedureOptionType":"V"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"?","StatementHelp":{"#cdata":"Syntax: ? required-argument(s);  \n     CC  \n     CMAP  \n     DEVICE  \n     GOUT  \n     IGOUT  \n     TC  \n     TEMPLATE \n\nWrites the current value of certain PROC GREPLAY options, or of the current device driver to the SAS log."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"CC","StatementOptionHelp":{"#cdata":"Writes the name of the current color map catalog."},"StatementOptionType":"RS"},{"StatementOptionName":"CMAP","StatementOptionHelp":{"#cdata":"Writes the name of the current color map."},"StatementOptionType":"RS"},{"StatementOptionName":"DEVICE|DEV","StatementOptionHelp":{"#cdata":"Writes the name of the current device driver."},"StatementOptionType":"RS"},{"StatementOptionName":"GOUT","StatementOptionHelp":{"#cdata":"Writes the name of the output catalog."},"StatementOptionType":"RS"},{"StatementOptionName":"IGOUT","StatementOptionHelp":{"#cdata":"[Writes the name of the input catalog."},"StatementOptionType":"RS"},{"StatementOptionName":"TC","StatementOptionHelp":{"#cdata":"Writes the name of the current template catalog."},"StatementOptionType":"RS"},{"StatementOptionName":"TEMPLATE","StatementOptionHelp":{"#cdata":"Writes the name of the current template."},"StatementOptionType":"RS"}]}},{"StatementName":"BYLINE","StatementHelp":{"#cdata":"Syntax: BYLINE; \n      \nDisplays BY statement information directly beneath the primary description of the catalog \nentries when you list the input catalog contents."},"StatementOptions":null},{"StatementName":"CC","StatementHelp":{"#cdata":"Syntax: CC libref.color-map-catalog;\n     \nSpecifies a color map catalog, and enables you to change the color map catalog without \nexiting the procedure.\n\ncolor-map catalog \nidentifies the SAS catalog where color map entries are stored."},"StatementOptions":null},{"StatementName":"CCOPY","StatementHelp":{"#cdata":"Syntax: CCOPY <libref.><color-map-catalog.>color-map-entry.<.CMAP>; \n      \nCopies a color map from one color map catalog to another color map catalog. \n\nRequired Arguments:\n\n<libref.><color-map-catalog.>color-map-entry<.CMAP> \n  identifies the color map entry to be copied. \n\n  color-map-catalog \n  is the color map catalog that contains the color map to be copied.\n\n  color-map-entry \n  is the name of the color map entry.\n\n  CMAP \n  is the color map entry type."},"StatementOptions":null},{"StatementName":"CDEF","StatementHelp":{"#cdata":"Syntax: CDEF color-map-entry <color-definition(s)> <DES=\"description\">;  \n\ncolor-definition has the following form:  color-number / from-color:to-color  \n \nDefines or modifies a color map in the color map catalog. \n\nRequired Arguments:\n\n  color-map-entry \n  identifies a color map entry.\n\n  If the color map entry is not in the color map catalog, then the procedure creates a color \n  map entry. If the color map entry exists in the color map catalog, then the GREPLAY procedure \n  modifies or adds to that color map entry."},"StatementOptions":{"StatementOption":{"StatementOptionName":"DES=","StatementOptionHelp":{"#cdata":"[Syntax: DES=\"description\"] \n          \nSpecifies a catalog entry description for the color map entry. \nMaximum length for the description is 256 characters."},"StatementOptionType":"V"}}},{"StatementName":"CDELETE|CDEL","StatementHelp":{"#cdata":"Syntax: CDELETE color-map-entry(s) | _ALL_ ; \n\nDeletes one or more color map entries from the current color map catalog. \n\nRequired Arguments:\n\n  color-map-entry(s) \n  identifies one or more color map entries to delete from the color map catalog. You can \n  submit one entry, or a list of entries in one delete statement.\n\n  _ALL_ \n  deletes all of the color map entries from the color map catalog."},"StatementOptions":{"StatementOption":{"StatementOptionName":"_ALL_","StatementOptionHelp":{"#cdata":"Deletes all of the color map entries from the color map catalog."},"StatementOptionType":"RS"}}},{"StatementName":"CMAP","StatementHelp":{"#cdata":"Syntax: CMAP color-map-entry;\n      \nAssigns a color map entry to be used when replaying graphics output. \n\nRequired Arguments:\n\ncolor-map-entry \n  identifies the color map entry, contained in the current color map catalog, to use when \n  replaying your graphics output. If the color map entry is not in the current color map \n  catalog, the GREPLAY procedure issues an error message."},"StatementOptions":null},{"StatementName":"COPY","StatementHelp":{"#cdata":"Syntax: COPY entry-id(s) | _ALL_ ; \n\nCopies one or more GRSEG catalog entries from the input catalog to the output catalog. \n\nRequired Arguments: \n\n  entry-id(s) \n  is the number (in the order in which they were created) or name of a catalog entry or group \n  of entries to be copied from the input catalog to the output catalog. Entries must contain \n  graphics output. Multiple catalog entries can contain both numbers and names.\n\n  _ALL_ \n  copies all graphics output entries in the input catalog to the output catalog."},"StatementOptions":{"StatementOption":{"StatementOptionName":"_ALL_","StatementOptionHelp":{"#cdata":"Copies all graphics output entries in the input catalog to the output catalog."},"StatementOptionType":"S","SubOptionsKeywords":"BY|TO"}}},{"StatementName":"DELETE|DEL","StatementHelp":{"#cdata":"Syntax: DELETE entry-id(s) | _ALL_ ; \n\nDeletes SAS catalog entries containing graphics output from the current input catalog. \n\nRequired Arguments:\n\n  entry-id(s) \n  is the number (in the order in which they were created) or name of a catalog entry or a group \n  of entries to be deleted from the input catalog. Entries must contain graphics output. Multiple \n  catalog entries can contain both numbers and names.\n\n  _ALL_ \n  deletes all graphics output entries in the input catalog."},"StatementOptions":{"StatementOption":{"StatementOptionName":"_ALL_","StatementOptionHelp":{"#cdata":"Deletes all graphics output entries in the input catalog."},"StatementOptionType":"S","SubOptionsKeywords":"BY|TO"}}},{"StatementName":"DEVICE|DEV","StatementHelp":{"#cdata":"Syntax: DEVICE device-name; \n      \nSpecifies the device driver. \n\nRequired Arguments: \n\n  device-name \n  specifies the device driver to use when you replay graphics output. The device driver that \n  you specify becomes the current device. It is used for subsequent replays and the output of \n  other graphics procedures.. This device driver remains in effect until you change the device \n  driver."},"StatementOptions":null},{"StatementName":"FS","StatementHelp":{"#cdata":"Syntax: FS;\n      \nToggles from line mode to the GREPLAY procedure windows."},"StatementOptions":null},{"StatementName":"GOUT","StatementHelp":{"#cdata":"Syntax: GOUT <libref.>output-catalog;\n      \nAssigns the SAS output catalog used by the GREPLAY procedure. \n\nRequired Arguments:\n\n<libref.>output-catalog \n  identifies the SAS catalog to use as an output catalog.\n\n  Default: WORK.GSEG"},"StatementOptions":null},{"StatementName":"GROUP","StatementHelp":{"#cdata":"Syntax: GROUP entry-id(s);\n      \nCreates groups of entries in the current input catalog. Only one group can be created per group \nstatement. The default name for a group header is GROUP. The default description for the group \nheader is REPLAY GROUP. Duplicate entry names are resolved as described in Duplicate Entry Names.\n\nTo change the name or description of a group, use the MODIFY statement. To manage and display \ngroups of entries use the DELETE, COPY, and REPLAY statements.\n\nRequired Arguments:\n\nentry-id(s) \n  is the number (in the order in which they were created) or name of a catalog entry. All \n  entries specified in the GROUP statement are included in one group, and identified with \n  a group header. You can submit one catalog entry or a list of catalog entries with one \n  GROUP statement. A list of catalog entries can contain both catalog entry numbers and \n  catalog entry names."},"StatementOptions":null},{"StatementName":"IGOUT","StatementHelp":{"#cdata":"Syntax: IGOUT <libref.>input-catalog;\n      \nAssigns the SAS input catalog used by the GREPLAY procedure. \n\nRequired Arguments:\n\n<libref.>input-catalog \n  identifies the SAS catalog with entries that contain graphics output that you want to replay."},"StatementOptions":null},{"StatementName":"LIST","StatementHelp":{"#cdata":"Syntax: LIST required-argument;\n      \nLists entries in the input, template, and color map catalogs, as well as the contents of templates\nand color maps in the SAS log."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"CC","StatementOptionHelp":{"#cdata":"Lists the color maps that are in the current color map catalog."},"StatementOptionType":"RS"},{"StatementOptionName":"CMAP","StatementOptionHelp":{"#cdata":"Lists the From and To values in the current color map."},"StatementOptionType":"RS"},{"StatementOptionName":"IGOUT","StatementOptionHelp":{"#cdata":"Lists the number, name, and description of the entries in the input catalog that contain \ngraphics output. In addition, the type of graphics output (dependent or independent) \nis shown."},"StatementOptionType":"RS"},{"StatementOptionName":"TC","StatementOptionHelp":{"#cdata":"Lists the templates in the current template catalog."},"StatementOptionType":"RS"},{"StatementOptionName":"TEMPLATE","StatementOptionHelp":{"#cdata":"Lists the panel definition values of the current template."},"StatementOptionType":"RS"}]}},{"StatementName":"MODIFY","StatementHelp":{"#cdata":"Syntax: MODIFY modify-pair(s);  \n        \nwhere modify-pair or pairs has the following form:  entry-id / description(s)  \n \nChanges the name, description, and BY statement information of entries or group headers in the \ninput catalog. \n\nRequired Arguments:\n\n  entry-id / description(s) \n  specifies the entry to modify. \n\n  entry-id \n  specifies the number (in the order in which they were created) or name of a catalog entry or \n  a group of entries in the input catalog. Entries must contain graphics output. Multiple entry \n  ids can contain both numbers and names.\n\n  description(s) \n\n    BYLINE=\"character-string\" \n    specifies a character string that can be used for additional information or for BY statement \n    information. A character string can be up to 40 characters long, and must be enclosed in quotation \n    marks. BY statement information appears directly beneath the primary description of the catalog entry.\n\n    NAME=\"entry-name\" \n    specifies the entry name. Maximum length for an entry name is eight characters. Duplicate entry \n    names are resolved as described Duplicate Entry Names\n\n    DES=\"description\" \n    specifies the graph's description. Maximum length for entry description is 256 characters. \n    The description does not appear on the graph."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"BYLINE=","StatementOptionHelp":{"#cdata":"[Syntax: BYLINE=\"character-string\"] \n          \nSpecifies a character string that can be used for additional information or for BY \nstatement information."},"StatementOptionType":"V"},{"StatementOptionName":"NAME=","StatementOptionHelp":{"#cdata":"[Syntax: NAME=\"entry-name\"] \n          \nSpecifies the entry name. Maximum length for an entry name is eight characters."},"StatementOptionType":"V"},{"StatementOptionName":"DES=","StatementOptionHelp":{"#cdata":"[Syntax: DES=\"description\"] \n          \nSpecifies the graph's description. Maximum length for entry description is 256 characters.\nThe description does not appear on the graph."},"StatementOptionType":"V"}]}},{"StatementName":"MOVE","StatementHelp":{"#cdata":"Syntax: MOVE entry-id-1 AFTER | BEFORE entry-id-2; \n      \nRearranges entries in the input catalog by moving entries before or after other entries.\n\nRequired Arguments: \n\n  entry-id-1 \n  specifies the number (in the order in which they were created) or name of a catalog entry \n  or a group header that is to be moved.\n\n  entry-id-2 \n  is the number (in the order in which they were created) or name of a catalog entry or a group header.\n\n  AFTER | BEFORE \n  specifies whether entry-id-1 should be moved before or after entry-id-2."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"AFTER","StatementOptionHelp":{"#cdata":"Specifies that entry-id-1 should be moved after entry-id-2."},"StatementOptionType":"RV"},{"StatementOptionName":"BEFORE","StatementOptionHelp":{"#cdata":"Specifies that entry-id-1 should be moved before entry-id-2."},"StatementOptionType":"RV"}]}},{"StatementName":"NOBYLINE","StatementHelp":{"#cdata":"Syntax: NOBYLINE; \n      \nSuppresses BY statement information."},"StatementOptions":null},{"StatementName":"PREVIEW","StatementHelp":{"#cdata":"Syntax: PREVIEW template-entry(s) | _ALL_ ; \n\nDisplays the panel outlines for one or more templates using the current device. \n\nRequired Arguments:\n\n  template-entry(s) \n  identifies one or more template entries contained in the template catalog. You can preview \n  one entry or a list of entries with one PREVIEW statement.\n\n  _ALL_ \n  previews all templates in the current template catalog."},"StatementOptions":{"StatementOption":{"StatementOptionName":"_ALL_","StatementOptionHelp":{"#cdata":"Previews all templates in the current template catalog."},"StatementOptionType":"S"}}},{"StatementName":"QUIT|END|STOP","StatementHelp":{"#cdata":"Syntax: QUIT;\n      \nExits the GREPLAY procedure."},"StatementOptions":null},{"StatementName":"REPLAY|PLAY","StatementHelp":{"#cdata":"Syntax: REPLAY entry-id(s) | _FIRST_ | _LAST_ | _ALL_ ; \n      \nIdentifies one or more entries for replay from the input catalog. \n\nentry-id(s) \n  is the number (in the order in which they were created) or name of a catalog entry or a group \n  of entries in the input catalog. Entries must contain graphics output. Multiple entries can \n  contain both numbers and names. This statement specifies both the entry named GRAPH, and the \n  third entry in the catalog: \n\n    replay graph 3;"},"StatementOptions":{"StatementOption":[{"StatementOptionName":"_ALL_","StatementOptionHelp":{"#cdata":"Identifies one or more entries for replay from the input catalog. "},"StatementOptionType":"S"},{"StatementOptionName":"_FIRST_","StatementOptionHelp":{"#cdata":"Replays the first entry in the input catalog."},"StatementOptionType":"S"},{"StatementOptionName":"_LAST_","StatementOptionHelp":{"#cdata":"Replays the last entry in the input catalog."},"StatementOptionType":"S"}]}},{"StatementName":"TC","StatementHelp":{"#cdata":"Syntax: TC template-catalog;\n      \nSpecifies the template catalog for the GREPLAY procedure. \n\nRequired Arguments: \n\ntemplate-catalog \n  identifies the SAS catalog where templates are to be stored or identifies the name \n  of a SAS catalog that contains templates."},"StatementOptions":null},{"StatementName":"TCOPY","StatementHelp":{"#cdata":"Syntax: TCOPY <template-catalog.>template-entry<.TEMPLATE>; \n      \nCopies templates from a catalog to the template catalog, or creates a duplicate of a template \nwithin the template catalog. \n\nRequired Arguments:\n\n  <template-catalog.>template-entry<.TEMPLATE> \n  identifies the template entry to be copied. \n\n  template-catalog \n  is the SAS catalog that contains the template to be copied.\n\n  template-entry \n  is the template entry name.\n\n  TEMPLATE \n  is the catalog entry type. Duplicate entry names are resolved as described in \n  Duplicate Entry Names."},"StatementOptions":null},{"StatementName":"TDEF","StatementHelp":{"#cdata":"Syntax: TDEF template-entry <panel-definition(s)> <DES=\"description\">; \n      \nDefines or modifies templates in the template catalog."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"CLIP","StatementOptionHelp":{"#cdata":"Specifies that any panel behind this panel should be clipped."},"StatementOptionType":"S"},{"StatementOptionName":"COLOR=","StatementOptionHelp":{"#cdata":"[Syntax: COLOR=border-color] \n          \nSpecifies the panel border color."},"StatementOptionType":"C"},{"StatementOptionName":"COPY=","StatementOptionHelp":{"#cdata":"[Syntax: COPY=panel-number] \n          \nSpecifies the panel number definition to be copied to this panel."},"StatementOptionType":"V"},{"StatementOptionName":"DEF","StatementOptionHelp":{"#cdata":"Specifies a default panel with these coordinates: \n\n    Panel Corner  Coordinates \n    lower left    (0,0) \n    upper left    (0,100) \n    upper right   (100,100) \n    lower right   (100,0)"},"StatementOptionType":"V"},{"StatementOptionName":"DELETE|DEL","StatementOptionHelp":{"#cdata":"Deletes the panel."},"StatementOptionType":"S"},{"StatementOptionName":"DES=","StatementOptionHelp":{"#cdata":"[Syntax: DES=\"description\"] \n          \nSpecifies the template entry description. The maximum length for the template entry \ndescription is 256 characters."},"StatementOptionType":"V"},{"StatementOptionName":"LLX=","StatementOptionHelp":{"#cdata":"[Syntax: LLX=x] \n          \nSpecifies the X coordinate of the lower-left corner of the panel. Units for x are a percentage \nof the graphics output area."},"StatementOptionType":"V"},{"StatementOptionName":"LLY=","StatementOptionHelp":{"#cdata":"[Syntax: LLY=y] \n          \nSpecifies the Y coordinate of the lower-right corner of the panel. Units for y are a percentage \nof the graphics output area."},"StatementOptionType":"V"},{"StatementOptionName":"LRX=","StatementOptionHelp":{"#cdata":"[Syntax: LRX=x] \n          \nSpecifies the X coordinate of the lower-right corner of the panel. Units for x are a percentage \nof the graphics output area."},"StatementOptionType":"V"},{"StatementOptionName":"LRY=","StatementOptionHelp":{"#cdata":"[Syntax: LRY=y] \n          \nSpecifies the Y coordinate of the lower-right corner of the panel. Units for y are a percentage \nof the graphics output area."},"StatementOptionType":"V"},{"StatementOptionName":"PANEL-NUMBER=","StatementOptionHelp":{"#cdata":"Identifies the panel number being defined or modified."},"StatementOptionType":"V"},{"StatementOptionName":"ROTATE=","StatementOptionHelp":{"#cdata":"[Syntax: ROTATE=degrees] \n          \nSpecifies the rotation angle for the panel. Panel corner coordinates are automatically adjusted."},"StatementOptionType":"V"},{"StatementOptionName":"SCALEX=","StatementOptionHelp":{"#cdata":"[Syntax: SCALEX=factor] \n          \nSpecifies the scale factor for the X coordinates in the panel. Use this scale factor to increase \nor decrease the panel size in the X direction, or to reverse the X coordinates for the panel."},"StatementOptionType":"V"},{"StatementOptionName":"SCALEY=","StatementOptionHelp":{"#cdata":"[Syntax: SCALEY=factor] \n          \nSpecifies the scale factor for the Y coordinates in the panel. Use this scale factor to increase \nor decrease the panel size in the Y direction, or to reverse the Y coordinates for the panel."},"StatementOptionType":"V"},{"StatementOptionName":"ULX=","StatementOptionHelp":{"#cdata":"[Syntax: ULX=x] \n          \nSpecifies the X coordinate upper-left corner of the panel. Units for x are a percentage \nof the graphics output area."},"StatementOptionType":"V"},{"StatementOptionName":"ULY=","StatementOptionHelp":{"#cdata":"[Syntax: ULY=y] \n          \nSpecifies the Y coordinate upper-left corner of the panel. Units for y are a percentage \nof the graphics output area."},"StatementOptionType":"V"},{"StatementOptionName":"URX=","StatementOptionHelp":{"#cdata":"[Syntax: URX=x] \n          \nSpecifies the X coordinate upper-rignt corner of the panel. Units for x are a percentage \nof the graphics output area."},"StatementOptionType":"V"},{"StatementOptionName":"URY=","StatementOptionHelp":{"#cdata":"[Syntax: URY=y] \n          \nSpecifies the Y coordinate upper-rignt corner of the panel. Units for y are a percentage \nof the graphics output area."},"StatementOptionType":"V"},{"StatementOptionName":"XLATEX=","StatementOptionHelp":{"#cdata":"[Syntax: XLATEX=distance] \n          \nSpecifies the distance to move the X coordinates of the panel. Units for distance are a \npercentage of the graphics output area."},"StatementOptionType":"V"},{"StatementOptionName":"XLATEY=","StatementOptionHelp":{"#cdata":"[Syntax: XLATEY=distance] \n          \nSpecifies the distance to move the Y coordinates of the panel. Units for distance are a \npercentage of the graphics output area."},"StatementOptionType":"V"}]}},{"StatementName":"TDELETE|TDEL","StatementHelp":{"#cdata":"Syntax: TDELETE template-entry(s) | _ALL_ ; \n\nDeletes templates from the template catalog. \n\nRequired Arguments :\n\n  template-entry(s) \n  identifies a template entry to be deleted from the template entry catalog. You can submit \n  one entry or a list of entries in one TDELETE statement.\n\n  _ALL_ \n  deletes all template entries in the template entry catalog."},"StatementOptions":{"StatementOption":{"StatementOptionName":"_ALL_","StatementOptionHelp":{"#cdata":"Deletes all template entries in the template entry catalog."},"StatementOptionType":"S"}}},{"StatementName":"TEMPLATE","StatementHelp":{"#cdata":"Syntax: TEMPLATE template-entry; \n      \nAssigns a template to use when replaying graphics output. \n\nRequired Arguments:\n\ntemplate-entry \n  identifies an existing template to use when replaying graphics output. Use the TREPLAY \n  statement to replay graphics output in the template."},"StatementOptions":null},{"StatementName":"TREPLAY|TPLAY","StatementHelp":{"#cdata":"Syntax: TREPLAY select-pairs<DES=\"description\" NAME=\"entry-name\">; \n      \nReplays graphics entries into template panels. TREPLAY copies one or more entries from the \ngraphics input catalog into a template-entry in the graphics output catalog, using positioning \ninformation provided by the template. \n\nRequired Arguments:\n\n  template-panel-number:entry-id \n  specifies the template panel number and the name of the template entry. \n\n  template-panel-number \n  specifies the number of the panel in the template into which you want to replay the entry. \n  This number determines the position of the graph in the new entry in the graphics output catalog.\n\n  entry-id \n  specifies the name or number of the entry in the graphics input catalog that is to be added \n  to the new entry in the graphics output catalog."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DES=","StatementOptionHelp":{"#cdata":"[Syntax: DES=\"entry-description\"] \n          \nAdds a description to the entry in the graphics output catalog. Descriptions are truncated \nafter 256 characters."},"StatementOptionType":"RV"},{"StatementOptionName":"NAME=","StatementOptionHelp":{"#cdata":"[Syntax: NAME=\"entry-name\"] \n          \nNames the entry in the graphics output catalog. The name must begin with a letter, and continue \nwith up to seven more letters, numbers, or underscores."},"StatementOptionType":"RV"}]}},{"StatementName":"NOTE","StatementHelp":{"#cdata":"Syntax: NOTE <text-arguments(s)>; \n      \nControls the content, appearance, and placement of text. \n\ntext-argument(s) can be one or more of these: \n\n \"text-string\"\n \n text-options (text options must precede text-string.)"},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ANGLE=|A=","StatementOptionHelp":{"#cdata":"[Syntax: ANGLE=degrees | A=degrees] \n          \nSpecifies the angle of the baseline of the entire text string with respect to the \nhorizontal. A positive degrees value angles the baseline counterclockwise; a negative \nvalue angles it clockwise. By default, ANGLE=0 (horizontal)."},"StatementOptionType":"V"},{"StatementOptionName":"BCOLOR=|BC=","StatementOptionHelp":{"#cdata":"[Syntax: BCOLOR=background-color] \n          \nSpecifies the background color of a box produced by the BOX= option. If you omit \nBOX=, BCOLOR= is ignored. By default, the background color of the box is the same \nas the background color for the entire graph. The color of the frame of the box is \ndetermined by the color specification used in BOX=."},"StatementOptionType":"C"},{"StatementOptionName":"BLANK=YES|BL=YES","StatementOptionHelp":{"#cdata":"[Syntax: BLANK=YES] \n          \nProtects the box and its contents from being overwritten by any subsequent graphics elements\nby blanking out the area where the box is displayed. The BLANK= option enables you to overlay \ngraphics elements with boxed text. It is ignored if you omit the BOX= option. Because titles \nand footnotes are written from the highest numbered to the lowest numbered, the BLANK= option \nonly blanks out titles and footnotes of a lower number."},"StatementOptionType":"V"},{"StatementOptionName":"BOX=|BO=","StatementOptionHelp":{"#cdata":"Draws a box around one line of text."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2","@Value3":"3","@Value4":"4"},"StatementOptionToolTips":{"@ToolTip1":"A value of 1 produces the thinnest box lines.","@ToolTip2":"A value of 2 produces the next thinnest box lines.","@ToolTip3":"A value of 3 produces the next thickest box lines.","@ToolTip4":"A value of 4 produces the thickest box lines."}},{"StatementOptionName":"BSPACE=|BS=","StatementOptionHelp":{"#cdata":"[Syntax: BSPACE=box-space<units>] \n          \nSpecifies the amount of space between the boxed text and the box. The space above the text is \nmeasured from the font maximum, and the space below the text is measured from the font minimum.\nBy default, BSPACE=1. If the BOX= option is not used, the BSPACE= option is ignored."},"StatementOptionType":"V"},{"StatementOptionName":"COLOR=|C=","StatementOptionHelp":{"#cdata":"[Syntax: COLOR=color] \n          \nSpecifies the color for the following text, box, or line. The COLOR= option affects \nall text, lines, and boxes that follow it and stays in effect until another COLOR= \nspecification is encountered."},"StatementOptionType":"C"},{"StatementOptionName":"DRAW=|D=","StatementOptionHelp":{"#cdata":"[Syntax: DRAW=(x,y...,x-n,y-n)<units>] \n          \nDraws lines anywhere on the graphics output area using x and y as absolute or \nrelative coordinates."},"StatementOptionType":"V"},{"StatementOptionName":"FONT=|F=","StatementOptionHelp":{"#cdata":"[Syntax: FONT=font] \n          \nSpecifies the font for the subsequent text."},"StatementOptionType":"V"},{"StatementOptionName":"HEIGHT=|H=","StatementOptionHelp":{"#cdata":"[Syntax: HEIGHT=text-height<units>] \n          \nSpecifies the height of text characters in number of units. By default, HEIGHT=1. \nHeight is measured from the font minimum to the capline. Ascenders can extend above \nthe capline, depending on the font."},"StatementOptionType":"V"},{"StatementOptionName":"JUSTIFY=|J=","StatementOptionHelp":{"#cdata":"Specifies the alignment of the text string. The default is LEFT."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"LEFT","@Value2":"CENTER","@Value3":"RIGHT"},"StatementOptionToolTips":{"@ToolTip1":"Justify to the left.","@ToolTip2":"Justify to the center.","@ToolTip3":"Justify to the right."}},{"StatementOptionName":"LANGLE=|LA=","StatementOptionHelp":{"#cdata":"[Syntax: LANGLE=degrees] \n          \nSpecifies the angle of the baseline of the entire text string(s) with respect to \nthe horizontal. A positive value for degrees moves the baseline counterclockwise; \na negative value moves it clockwise. By default, LANGLE=0 (horizontal)."},"StatementOptionType":"V"},{"StatementOptionName":"LINK=","StatementOptionHelp":{"#cdata":"[Syntax: LINK= \"URL\"] \n          \nSpecifies a uniform resource locator (URL) that a title or footnote links to. The \ntext-string that you use to specify the URL can contain occurrences of the variables \n#BYVAL, #BYVAR, and #BYLINE."},"StatementOptionType":"V"},{"StatementOptionName":"LSPACE=|LS=","StatementOptionHelp":{"#cdata":"[Syntax: LSPACE=line-space <units>] \n          \nSpecifies the amount of spacing above lines of note and title text and the amount \nof spacing below lines of footnote text."},"StatementOptionType":"V"},{"StatementOptionName":"MOVE=|M=","StatementOptionHelp":{"#cdata":"[Syntax: MOVE=(x,y) <units>] \n          \nPositions subsequent text or lines anywhere on the graphics output area using x and y \nas absolute or relative coordinates."},"StatementOptionType":"V"},{"StatementOptionName":"ROTATE=|R=","StatementOptionHelp":{"#cdata":"[Syntax: ROTATE=degrees] \n          \nSpecifies the angle at which each character of text is rotated with respect to the \nbaseline of the text string. The angle is measured from the current text baseline \nangle, which is specified by the ANGLE= or LANGLE= options. By default, the baseline \nis horizontal. A positive value for degrees rotates the character counterclockwise; \na negative value rotates it clockwise. By default, ROTATE=0 (parallel to the baseline)."},"StatementOptionType":"V"},{"StatementOptionName":"UNDERLIN=|U=","StatementOptionHelp":{"#cdata":"Underlines subsequent text."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"0","@Value2":"1","@Value3":"2","@Value4":"3"},"StatementOptionToolTips":{"@ToolTip1":"UNDERLIN=0 halts underlining for subsequent text.","@ToolTip2":"Undelines with the thinnest line.","@ToolTip3":"Undelines with the next thickest line.","@ToolTip4":"Undelines with the thickest line."}},{"StatementOptionName":"WRAP","StatementOptionHelp":{"#cdata":"Wraps the text to a second line if the text does not fit on one line. If the WRAP \noption is omitted, the text font-size is reduced until the text fits on one line. \nWrapping occurs at the last blank before the text meets the end of the window. If \nthere are no blanks in the text string, then there is no wrapping."},"StatementOptionType":"S"}]}}]}}}