{"Procedure":{"Name":"GSLIDE","ProductGroup":"SAS/GRAPH","ProcedureHelp":{"#cdata":"Syntax: PROC GSLIDE <option(s)>; \n  \nThe GSLIDE procedure is useful for creating text slides for presentations. You can overlay \ntext slides on other graphics output with the GREPLAY procedure. The GSLIDE procedure produces \ngraphics output that consists of text and straight lines that are generated by TITLE, FOOTNOTE, \nand NOTE statements. In addition, the procedure provides an easy way to add titles, notes, and \nfootnotes to output that is produced entirely with an Annotate data set."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"ANNOTATE=|ANNO=","ProcedureOptionHelp":{"#cdata":"[Syntax: ANNOTATE=Annotate-data-set] \n      \nSpecifies a data set that includes Annotate variables that identify graphics commands \nand parameters."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"BORDER","ProcedureOptionHelp":{"#cdata":"Draws a border around the graphics output area, which includes the title area, the footnote \narea, and the procedure output area. A color specification for the border is searched for \nin the following order: \n\n  o the CTITLE= option in a GOPTIONS statement. \n  o the CTEXT= option in a GOPTIONS statement. \n  o the color of the current style. If the NOGSTYLE option is specified, then the color \n    is the first color in the device's color list\n\n"},"ProcedureOptionType":"S"},{"ProcedureOptionName":"CFRAME=|CF=","ProcedureOptionHelp":{"#cdata":"[Syntax: CFRAME=frame-color] \n      \nDraws a frame around the procedure output area in the specified color. If you use both the \nCFRAME= and FRAME options, the FRAME option is ignored. If you use the IFRAME= option, the \nspecified image fills the background of the slide.\n\nNote: The CFRAME= option does not color the background of the slide."},"ProcedureOptionType":"C"},{"ProcedureOptionName":"DESCRIPTION=|DES=","ProcedureOptionHelp":{"#cdata":"[Syntax: DESCRIPTION='entry-description'] \n      \nSpecifies the description of the catalog entry for the slide. The maximum length \nfor entry-description is 256 characters. By default, the GSLIDE procedure assigns \nthe description GRAPHICS TEXT SLIDE.\n\nThe descriptive text is shown in each of the following: \n\n  o the \"description\" portion of the Results window \n  o the catalog-entry properties that you can view from the Explorer window \n  o the Description field of the PROC GREPLAY window"},"ProcedureOptionType":"V"},{"ProcedureOptionName":"FRAME","ProcedureOptionHelp":{"#cdata":"Draws a frame around the procedure output area. By default, the frame color is the color \nof the current style; if the NOGSTYLE option is specified, then the color is the first \ncolor in the device's color list. If you want to specify a different color for the frame, \nuse the CFRAME= option instead. The FRAME option is overridden by the IFRAME= option, which \nfills the backplane frame with an image."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"GOUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: GOUT=<libref.>output-catalog] \n      \nSpecifies the SAS catalog in which to save the graphics output produced by the GSLIDE \nprocedure. If you omit the libref, SAS/GRAPH looks for the catalog in the temporary \nlibrary called WORK and creates the catalog if it does not exist."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"IFRAME=|IF=","ProcedureOptionHelp":{"#cdata":"[Syntax: IFRAME=fileref | 'external-file'] \n      \nIdentifies the image file you want to apply to the backplane of the plot. The IFRAME= option \nis overridden by the NOIMAGEPRINT goption."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"IMAGEMAP=","ProcedureOptionHelp":{"#cdata":"[Syntax: IMAGEMAP=output-data-set] \n      \nCreates a temporary SAS data set that is used to generate an image map in an HTML output file. \nThe information in the image map data set includes the shape and coordinates of the elements in \nthe graph and drill-down URLs that have been associated with those elements. The drill-down URLs \nare provided by one or two variables in the input data set. These variables are identified to the \nGSLIDE procedure with the HTML= or HTML_LEGEND= options or both.\n\nThe %IMAGEMAP macro generates the image map in the HTML output file. The macro takes two arguments, \nthe name of the image map data set and the name or fileref of the HTML output file, as shown in the \nfollowing example: \n\n  %imagemap(imgmapds, myimgmap.html);"},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"IMAGESTYLE=","ProcedureOptionHelp":{"#cdata":"Specifies whether to tile the image specified with the IFRAME= option to fill the backplane \nor to stretch the image to fit the backplane."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"TILE","@Value2":"FIT"},"ProcedureOptionToolTips":{"@ToolTip1":"Specifies to tile the image specified with the IFRAME= option to fill the backplane.","@ToolTip2":"Specifies to stretch the image specified with the IFRAME= option to fit the backplane."}},{"ProcedureOptionName":"LFRAME=|LF=","ProcedureOptionHelp":{"#cdata":"[Syntax: LFRAME=line-type] \n      \nSpecifies the line type for a frame and draws a frame around the procedure output area. \nValues for line-type are 1 through 46. By default, the line type is specified by the current \nstyle. LFRAME=1, which produces a solid line, is the default."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NAME=","ProcedureOptionHelp":{"#cdata":"[Syntax: NAME='entry-name'] \n      \nSpecifies the name of the GRSEG catalog entry and the name of the graphics output file, \nif one is created. The name can be up to 256 characters long, but the GRSEG name is truncated \nto eight characters. Uppercase characters are converted to lowercase, and periods are converted \nto underscores. The default GRSEG name is GSLIDE. If the name duplicates an existing name, then \nSAS/GRAPH adds a number to the name to create a unique name--for example, GSLIDE1."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"WFRAME=|WF=","ProcedureOptionHelp":{"#cdata":"[Syntax: WFRAME=n] \n      \nSpecifies the width of the frame where n is a number. The thickness of the frame increases \ndirectly with n, but the thickness of the line can vary from device to device. By default, \nthe line width is specified by the current style. WFRAME=1, which is the thinnest line, is \nthe default. The WFRAME= option also draws the frame."},"ProcedureOptionType":"V"}]},"ProcedureStatements":{"ProcedureStatement":{"StatementName":"NOTE","StatementHelp":{"#cdata":"Syntax: NOTE <text-arguments(s)>; \n      \nControls the content, appearance, and placement of text. \n\ntext-argument(s) can be one or more of these: \n\n \"text-string\"\n \n text-options (text options must precede text-string.)"},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ANGLE=|A=","StatementOptionHelp":{"#cdata":"[Syntax: ANGLE=degrees | A=degrees] \n          \nSpecifies the angle of the baseline of the entire text string with respect to the horizontal. \nA positive degrees value angles the baseline counterclockwise; a negative value angles it\nclockwise. By default, ANGLE=0 (horizontal)."},"StatementOptionType":"V"},{"StatementOptionName":"BCOLOR=|BC=","StatementOptionHelp":{"#cdata":"[Syntax: BCOLOR=background-color] \n          \nSpecifies the background color of a box produced by the BOX= option. If you omit BOX=, BCOLOR= is \nignored. By default, the background color of the box is the same as the background color for the \nentire graph. The color of the frame of the box is determined by the color specification used in BOX=."},"StatementOptionType":"C"},{"StatementOptionName":"BLANK=YES|BL=YES","StatementOptionHelp":{"#cdata":"[Syntax: BLANK=YES] \n          \nProtects the box and its contents from being overwritten by any subsequent graphics elements\nby blanking out the area where the box is displayed. The BLANK= option enables you to overlay \ngraphics elements with boxed text. It is ignored if you omit the BOX= option. Because titles \nand footnotes are written from the highest numbered to the lowest numbered, the BLANK= option \nonly blanks out titles and footnotes of a lower number."},"StatementOptionType":"V"},{"StatementOptionName":"BOX=|BO=","StatementOptionHelp":{"#cdata":"Draws a box around one line of text."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2","@Value3":"3","@Value4":"4"},"StatementOptionToolTips":{"@ToolTip1":"A value of 1 produces the thinnest box lines.","@ToolTip2":"A value of 2 produces the next thinnest box lines.","@ToolTip3":"A value of 3 produces the next thickest box lines.","@ToolTip4":"A value of 4 produces the thickest box lines."}},{"StatementOptionName":"BSPACE=|BS=","StatementOptionHelp":{"#cdata":"[Syntax: BSPACE=box-space<units>] \n          \nSpecifies the amount of space between the boxed text and the box. The space above \nthe text is measured from the font maximum, and the space below the text is measured \nfrom the font minimum. By default, BSPACE=1. If the BOX= option is not used, the BSPACE= \noption is ignored."},"StatementOptionType":"V"},{"StatementOptionName":"COLOR=|C=","StatementOptionHelp":{"#cdata":"[Syntax: COLOR=color] \n          \nSpecifies the color for the following text, box, or line. The COLOR= option affects \nall text, lines, and boxes that follow it and stays in effect until another COLOR= \nspecification is encountered."},"StatementOptionType":"C"},{"StatementOptionName":"DRAW=|D=","StatementOptionHelp":{"#cdata":"[Syntax: DRAW=(x,y...,x-n,y-n)<units>] \n          \nDraws lines anywhere on the graphics output area using x and y as absolute or \nrelative coordinates."},"StatementOptionType":"V"},{"StatementOptionName":"FONT=|F=","StatementOptionHelp":{"#cdata":"[Syntax: FONT=font] \n          \nSpecifies the font for the subsequent text."},"StatementOptionType":"V"},{"StatementOptionName":"HEIGHT=|H=","StatementOptionHelp":{"#cdata":"[Syntax: HEIGHT=text-height<units>] \n          \nSpecifies the height of text characters in number of units. By default, HEIGHT=1. Height is \nmeasured from the font minimum to the capline. Ascenders can extend above the capline,\ndepending on the font."},"StatementOptionType":"V"},{"StatementOptionName":"JUSTIFY=|J=","StatementOptionHelp":{"#cdata":"Specifies the alignment of the text string. The default is LEFT."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"LEFT","@Value2":"CENTER","@Value3":"RIGHT"},"StatementOptionToolTips":{"@ToolTip1":"Justify to the left.","@ToolTip2":"Justify to the center.","@ToolTip3":"Justify to the right."}},{"StatementOptionName":"LANGLE=|LA=","StatementOptionHelp":{"#cdata":"[Syntax: LANGLE=degrees] \n          \nSpecifies the angle of the baseline of the entire text string(s) with respect to the horizontal. \nA positive value for degrees moves the baseline counterclockwise; a negative value moves it\nclockwise. By default, LANGLE=0 (horizontal)."},"StatementOptionType":"V"},{"StatementOptionName":"LINK=","StatementOptionHelp":{"#cdata":"[Syntax: LINK= \"URL\"] \n          \nSpecifies a uniform resource locator (URL) that a title or footnote links to. The \ntext-string that you use to specify the URL can contain occurrences of the variables \n#BYVAL, #BYVAR, and #BYLINE."},"StatementOptionType":"V"},{"StatementOptionName":"LSPACE=|LS=","StatementOptionHelp":{"#cdata":"[Syntax: LSPACE=line-space <units>] \n          \nSpecifies the amount of spacing above lines of note and title text and the amount of \nspacing below lines of footnote text."},"StatementOptionType":"V"},{"StatementOptionName":"MOVE=|M=","StatementOptionHelp":{"#cdata":"[Syntax: MOVE=(x,y) <units>] \n          \nPositions subsequent text or lines anywhere on the graphics output area using x and y as \nabsolute or relative coordinates."},"StatementOptionType":"V"},{"StatementOptionName":"ROTATE=|R=","StatementOptionHelp":{"#cdata":"[Syntax: ROTATE=degrees] \n          \nSpecifies the angle at which each character of text is rotated with respect to the \nbaseline of the text string. The angle is measured from the current text baseline \nangle, which is specified by the ANGLE= or LANGLE= options. By default, the baseline \nis horizontal. A positive value for degrees rotates the character counterclockwise; \na negative value rotates it clockwise. By default, ROTATE=0 (parallel to the baseline)."},"StatementOptionType":"V"},{"StatementOptionName":"UNDERLIN=|U=","StatementOptionHelp":{"#cdata":"Underlines subsequent text."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"0","@Value2":"1","@Value3":"2","@Value4":"3"},"StatementOptionToolTips":{"@ToolTip1":"UNDERLIN=0 halts underlining for subsequent text.","@ToolTip2":"Undelines with the thinnest line.","@ToolTip3":"Undelines with the next thickest line.","@ToolTip4":"Undelines with the thickest line."}},{"StatementOptionName":"WRAP","StatementOptionHelp":{"#cdata":"Wraps the text to a second line if the text does not fit on one line. If the WRAP\noption is omitted, the text font-size is reduced until the text fits on one line. \nWrapping occurs at the last blank before the text meets the end of the window. If \nthere are no blanks in the text string, then there is no wrapping."},"StatementOptionType":"S"}]}}}}}