{"Procedure":{"Name":"HAPLOTYPE","ProductGroup":"SAS/GENETICS","ProcedureHelp":{"#cdata":"Syntax: PROC HAPLOTYPE <options> ; \n    BY variables ; \n    ID variables ; \n    TRAIT variable </ options> ; \n    VAR variables ; \n\nA haplotype is a combination of alleles at multiple loci on a single chromosome. A pair \nof haplotypes constitutes the multilocus genotype. Haplotype information has to be inferred \nbecause data are usually collected at the genotypic, not haplotype pair, level. For homozygous \nmarkers, there is no problem. If one locus has alleles A and a, and a second locus has alleles  \nB and b, the observed genotype AaBB must contain two haplotypes of type AB; genotype AaBB must \ncontain haplotypes AB and aB, and so on. Haplotypes and their frequencies can be obtained directly. \nWhen both loci are heterozygous, however, there is ambiguity; a variety of combinations of haplotypes \ncan generate the genotype, and it is not possible to determine directly which two haplotypes constitute \nany individual genotype. For example, the genotype AaBb might be of type AB/ab with haplotypes AB and\nab, or of type Ab/aB with haplotypes Ab and aB. The HAPLOTYPE procedure uses the expectation-maximization \n(EM) algorithm to generate maximum likelihood estimates of haplotype frequencies given a multilocus \nsample of genetic marker genotypes under the assumption of Hardy-Weinberg equilibrium (HWE). These \nestimates can then be used to assign the probability that each individual possesses a particular \nhaplotype pair. A Bayesian approach for haplotype frequency estimation is also implemented in \nPROC HAPLOTYPE. \n\nEstimation of haplotype frequencies is important for several applications in genetic data analysis. \nOne application is determining whether there is linkage disequilibrium (LD), or association, between \nloci. PROC HAPLOTYPE performs a likelihood ratio test to test the hypothesis of no LD between marker \nloci. Another application is association testing of disease susceptibility. Since sites that affect \ndisease status are embedded in haplotypes, it has been postulated that the power of case-control studies \nmight be increased by testing for haplotype rather than allele or genotype associations. One reason is \nthat haplotypes might include two or more causative sites whose combined effect is measurable, particularly \nif they show synergistic interaction. Another reason is that fewer tests need to be performed, although if \nthere are a large number of haplotypes, this advantage is offset by the increased degrees of freedom of each \ntest. PROC HAPLOTYPE can use case-control data to calculate test statistics for the hypothesis of no association \nbetween alleles composing the haplotypes and disease status; such tests are carried out across all haplotypes \nat the loci specified, or for individual haplotypes."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"ALPHA=","ProcedureOptionHelp":{"#cdata":"[Syntax: ALPHA=number] \n        \n  Specifies that a confidence level of 100(1-number)% is to be used in forming the \n  confidence intervals for estimates of haplotype frequencies. The value of number \n  must be between 0 and 1, inclusive, and 0.05 is used as the default value if it \n  is not specified."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"BURNIN=","ProcedureOptionHelp":{"#cdata":"[Syntax: BURNIN=number] \n      \nIndicates that number iterations are discarded as burn-in when EST=BAYESIAN is specified. \nThe value of number cannot be greater than the value specified in the TOTALRUN= option and \nmust be greater than 0. The default is min(5000, t/2), where t is the number of total runs."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"CONV=","ProcedureOptionHelp":{"#cdata":"[Syntax: CONV=number] \n      \nSpecifies the convergence criterion for iterations of the EM algorithm, where 0 < number ≤ 1. \nThe iteration process is stopped when the ratio of the change in the log likelihoods to the \nformer log likelihood is less than or equal to number for the number of consecutive iterations \nspecified in the NLAG= option (or 1 by default), or after the number of iterations specified in \nthe MAXITER= option has been performed. The default value is 0.00001."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"CUTOFF=","ProcedureOptionHelp":{"#cdata":"[Syntax: CUTOFF= number] \n      \nSpecifies a lower bound on a haplotype’s estimated frequency in order for that haplotype \nto be included in the \"Haplotype Frequencies\" table. The value of number must be between \n0 and 1, inclusive. By default, all possible haplotypes from the sample are included in \nthe table."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nNames the input SAS data set to be used by PROC HAPLOTYPE. The default is to use the \nmost recently created data set."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"DELIMITER=","ProcedureOptionHelp":{"#cdata":"[Syntax: DELIMITER=’string’] \n      \nIndicates the string that is used to separate the two alleles that compose the \ngenotypes contained in the variables specified in the VAR statement. This option \nis ignored if GENOCOL is not specified."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"EST=","ProcedureOptionHelp":{"#cdata":"Indicates the method to be used for estimating haplotype frequencies. \n      \nBy default or when EST=EM is specified, the EM algorithm is used."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"BAYESIAN","@Value2":"EM","@Value3":"STEPEM"},"ProcedureOptionToolTips":{"@ToolTip1":"A Bayesian method is used for estimating haplotype frequencies.","@ToolTip2":"The EM algorithm is used to calculate estimates of haplotype frequencies.","@ToolTip3":"The stepwise EM algorithm is used to calculate estimates of haplotype frequencies."}},{"ProcedureOptionName":"GENOCOL","ProcedureOptionHelp":{"#cdata":"Indicates that columns specified in the VAR statement contain genotypes instead \nof alleles. When this option is specified, there is one column per marker. The \ngenotypes must consist of the two alleles separated by a delimiter."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"INDIVIDUAL=|INDIV=","ProcedureOptionHelp":{"#cdata":"[Syntax: INDIVIDUAL=variable] \n      \nSpecifies the individual ID variable when using the TALL option. This variable \ncan be character or numeric."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"INIT=","ProcedureOptionHelp":{"#cdata":"Indicates the method of initializing haplotype frequencies to be used in the EM algorithm. \n      \nBy default, INIT=LINKEQ."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"LINKED","@Value2":"RANDOM","@Value3":"UNIFORM"},"ProcedureOptionToolTips":{"@ToolTip1":"Initializes haplotype frequencies assuming linkage equilibrium by calculating the  product of the frequencies of the alleles that compose the haplotype.","@ToolTip2":"Initializes haplotype frequencies with random values from a Uniform(0,1) distribution.","@ToolTip3":"Assigns equal frequency to all haplotypes."}},{"ProcedureOptionName":"INTERVAL=","ProcedureOptionHelp":{"#cdata":"[Syntax: INTERVAL=number] \n      \nIndicates that the non-burn-in iterations of the Bayesian estimation method when \nEST=BAYESIAN is specified are thinned by only recording the result from every number \niterations. The value of number must be greater than 0, and the default is 1 (every \niteration is used)."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"ITPRINT","ProcedureOptionHelp":{"#cdata":"Requests that the \"Iteration History\" table be displayed. This option is ignored \nif the NOPRINT option is specified."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"LD","ProcedureOptionHelp":{"#cdata":"Requests that haplotype frequencies be calculated under the assumption of no LD, \nin addition to being calculated using the EM algorithm. When this option is \nspecified, the \"Test for Allelic Associations\" table is displayed, which \ncontains statistics for the likelihood ratio test for allelic associations. \nThis option is ignored if the NOPRINT option is specified."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"MARKER=","ProcedureOptionHelp":{"#cdata":"[Syntax: MARKER=variable] \n      \nSpecifies the marker ID variable when using the TALL option. This variable contains \nthe names of the markers that are used in all output and can be character or numeric."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"MAXITER=","ProcedureOptionHelp":{"#cdata":"[Syntax: MAXITER=number] \n      \nSpecifies the maximum number of iterations to be used in the EM algorithm. The number \nmust be a nonnegative integer. Iterations are carried out until convergence is reached \naccording to the convergence criterion or until number iterations have been performed. \nThe default is MAXITER=100."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NDATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: NDATA=SAS-data-set] \n      \nNames the input SAS data set containing names, or identifiers, for the markers used \nin the output. There must be a NAME variable in this data set, which should contain \nthe same number of rows as there are markers in the input data set specified in the \nDATA= option. When there are fewer rows than there are markers, markers without a name \nare named using the PREFIX= option. Likewise, if there is no NDATA= data set specified, \nthe PREFIX= option is used. Note that this data set is ignored if the TALL option is \nspecified in the PROC HAPLOTYPE statement. In that case, the marker variable names are \ntaken from the marker ID variable specified in the MARKER= option."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NLAG=","ProcedureOptionHelp":{"#cdata":"[Syntax: NLAG=number] \n      \nSpecifies the number of consecutive iterations that must meet the convergence criterion \nspecified in the CONV= option (0.00001 by default) for the iteration process of the EM \nalgorithm to stop. The number must be a positive integer. If this option is omitted, one \niteration must satisfy the convergence criterion by default."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NOPRINT","ProcedureOptionHelp":{"#cdata":"Suppresses the display of the \"Analysis Information,\" \"Iteration History,\" \"Haplotype \nFrequencies,\" and \"Test for Allelic Associations\" tables. Either the OUT= option, the \nTRAIT statement, or both must be used with the NOPRINT option."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NSTART=","ProcedureOptionHelp":{"#cdata":"[Syntax: NSTART=number] \n      \nSpecifies the number of different starts used for the EM algorithm. When this option \nis specified, PROC HAPLOTYPE starts the iterations with different random initial values \nnumber - 2 times as well as once with uniform frequencies for all the haplotypes and once \nusing haplotype frequencies assuming linkage equilibrium (independence). Results on the \nanalysis, using the initial values that produce the best log likelihood, are then reported. \nThe number must be a positive integer. If this option is omitted or NSTART=1, only one start \nwith initial frequencies generated according to the INIT= option is used."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"OUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUT=SAS-data-set] \n      \nNames the output SAS data set containing the probabilities of each genotype being \nresolved into all of the possible haplotype pairs."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"OUTCUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUTCUT=number] \n      \nSpecifies a lower bound on a haplotype pair’s estimated probability given the individual’s \ngenotype in order for that haplotype pair to be included in the OUT= data set. The value of \nnumber must be between 0 and 1, inclusive. By default, number=0.00001. In order to be able \nto view all possible haplotype pairs for an individual’s genotype, OUTCUT=0 can be specified."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"OUTID","ProcedureOptionHelp":{"#cdata":"Indicates that the variable _ID_ created by PROC HAPLOTYPE should be included in the \nOUT= data set in addition to the variable(s) listed in the ID statement. When the ID \nstatement is omitted, this variable is automatically included. This option is ignored \nwhen the TALL option is used."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"PREFIX=","ProcedureOptionHelp":{"#cdata":"[Syntax: PREFIX=prefix] \n      \nSpecifies a prefix to use in constructing names for marker variables in all output. \nFor example, if PREFIX=VAR, the names of the variables are VAR1, VAR2, ..., VARn. \nNote that this option is ignored when the NDATA= option is specified, unless there \nare fewer names in the NDATA data set than there are markers. If this option is \nomitted, PREFIX=M is the default when variables contain alleles; if GENOCOL is \nspecified, then the names of the variables specified in the VAR statement are used \nas the marker names."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SE=","ProcedureOptionHelp":{"#cdata":"Specifies the standard error estimation method when the EM or stepwise EM algorithm \nis used for estimating haplotype frequencies."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"BINOMIAL","@Value2":"JACKKNIFE"},"ProcedureOptionToolTips":{"@ToolTip1":"Gives a standard error estimator from a binomial distribution and is the default method.","@ToolTip2":"Requests that the jackknife procedure be used to estimate the standard error."}},{"ProcedureOptionName":"SEED=","ProcedureOptionHelp":{"#cdata":"[Syntax: SEED=number] \n      \nSpecifies the initial seed for the random number generator used for creating the \ninitial haplotype frequencies when INIT=RANDOM and/or to permute the data when the \nPERMUTATION= option of the TRAIT statement is specified. The value for number must \nbe an integer; the computer clock time is used if the option is omitted or an integer \nless than or equal to 0 is specified."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"STEPTRIM=","ProcedureOptionHelp":{"#cdata":"[Syntax: STEPTRIM=number] \n      \nIndicates the cutoff to be used for the stepwise EM algorithm when trimming the haplotype \ntable, where 0 < number < 1. This option is implemented only when EST=STEPEM is specified. \nBy default, this number is set to min(0.001, 1/(2n), where n is the number of individuals \nin the data set."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"TALL","ProcedureOptionHelp":{"#cdata":"Indicates that the input data set is of an alternative format. This format contains \nthe following columns: two containing marker alleles (or one containing marker \ngenotypes if GENOCOL is specified), one for the marker identifier, and one for \nthe individual identifier. The MARKER= and INDIV= options must also be specified \nin order for this option to be in effect. Note that when this option is used, the \nDATA= data set must first be sorted by any BY variables, then sorted by the marker \nID variable, and then sorted by the individual ID variable."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"THETA=","ProcedureOptionHelp":{"#cdata":"[Syntax: THETA=number] \n      \nRequests that number be used as the scaled mutation rate θ when EST=BAYESIAN instead \nof the default."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"TOTALRUN=|TOT=","ProcedureOptionHelp":{"#cdata":"[Syntax: TOTALRUN=number] \n      \nIndicates the total number of iterations to use when EST=BAYESIAN, including the \nburn-in. The value of number must be greater than 0, and the default is 10,000."},"ProcedureOptionType":"V"}]},"ProcedureStatements":[{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nYou can specify a BY statement with PROC HAPLOTYPE to obtain separate analyses on \nobservations in groups defined by the BY variables. When a BY statement appears, \nthe procedure expects the input data set to be sorted in the order of the BY \nvariables. The variables are one or more variables in the input data set."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"ID","StatementHelp":{"#cdata":"Syntax: ID variables ; \n\nThe ID statement identifies the variable(s) from the DATA= data set to be included \nin the OUT= data set. When this statement is omitted, PROC HAPLOTYPE creates in the \nOUT= data set the variable _ID_ that contains a unique numeric identifier for each \nindividual. When the TALL option is used, this statement is ignored, and the INDIVIDUAL \nvariable is automatically included in the OUT= data set along with the trait variable \nif the TRAIT statement is specified."},"StatementOptions":null},{"StatementName":"TRAIT","StatementHelp":{"#cdata":"Syntax: TRAIT variable </ options> ; \n\nThe TRAIT statement identifies the binary variable that indicates which individuals \nare cases and which are controls, or that represents a dichotomous trait. This variable \ncan be character or numeric, but it must have only two nonmissing levels. When this \nstatement is used and the original or stepwise EM algorithm is implemented to estimate \nhaplotype frequencies, the \"Test for Marker-Trait Association\" table is included in the \noutput."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"PERMUTATION=|PERMS=","StatementOptionHelp":{"#cdata":"[Syntax: PERMUTATION=number] \n          \nSpecifies the number of permutations to be used to calculate the empirical p-value \nof the haplotype case-control tests. This number must be a positive integer. By default, \nno permutations are used and the -value is calculated using the chi-square test statistic. \nNote that this option can greatly increase the computation time."},"StatementOptionType":"V"},{"StatementOptionName":"TESTALL","StatementOptionHelp":{"#cdata":"Specifies that each individual haplotype should be tested for association with the \nTRAIT variable. When this option is included in the TRAIT statement, the \"Tests \nfor Haplotype-Trait Association\" table is included in the output."},"StatementOptionType":"S"}]}},{"StatementName":"VAR","StatementHelp":{"#cdata":"Syntax: VAR variables ; \n\nThe VAR statement identifies the variables containing either the marker alleles or, \nif GENOCOL is specified, the marker genotypes. The following number of variables \nshould be specified in this statement for a data set containing m markers according \nto whether the options GENOCOL and TALL are used: \n\n  o When both GENOCOL and TALL are specified, there should be one variable named \n    containing marker genotypes. \n\n  o When only TALL is specified, there should be two variables named containing \n    marker alleles. \n\n  o When only GENOCOL is specified, there should be m variables named, one for each \n    marker containing marker genotypes. \n\n  o When neither option is specified, there should be 2m variables named, two for \n    each marker containing marker alleles. \n\nAll variables specified must be of the same type, either character or numeric. \n\n"},"StatementOptions":null}]},null]}}