{"Procedure":{"#comment":{},"Name":"HPCANDISC","ProductGroup":"SAS/STAT","ProcedureHelp":{"#cdata":"Syntax: PROC HPCANDISC <options> ;     \n    BY variables ; \n    CLASS variable ; \n    FREQ variable ;\n    ID variables; \n    PERFORMANCE performance-options; \n    VAR variables ; \n    WEIGHT variable ; \n\nThe HPCANDISC procedure is a high-performance procedure that performs canonical discriminant analysis. \nIt is a high-performance version of the CANDISC procedure in SAS/STAT software. PROC HPCANDISC runs in \neither single-machine mode or distributed mode. \n\nNote: Distributed mode requires SAS High-Performance Statistics."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"ALL","ProcedureOptionHelp":{"#cdata":"Activates all of the display options."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"ANOVA","ProcedureOptionHelp":{"#cdata":"Displays univariate statistics for testing the hypothesis that the class means are \nequal in the population for each variable."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"BCORR","ProcedureOptionHelp":{"#cdata":"Displays between-class correlations."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"BCOV","ProcedureOptionHelp":{"#cdata":"Displays between-class covariances."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"BSSCP","ProcedureOptionHelp":{"#cdata":"Displays the between-class SSCP matrix."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nSpecifies the data set to be analyzed. The data set can be an ordinary SAS data \nset or one of several specially structured data sets created by SAS statistical \nprocedures."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"DISTANCE|MAHALANOBIS","ProcedureOptionHelp":{"#cdata":"Displays squared Mahalanobis distances between the group means, F statistics, and \nthe corresponding probabilities of greater squared Mahalanobis distances between \nthe group means."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NCAN=","ProcedureOptionHelp":{"#cdata":"[Syntax:NCAN=n] \n      \nSpecifies the number of canonical variables to be computed. The value of n must be less than or equal \nto the number of variables. If you specify NCAN=0, PROC HPCANDISC displays the canonical correlations \nbut not the canonical coefficients, structures, or means. A negative value suppresses the canonical\nanalysis entirely."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NOPRINT","ProcedureOptionHelp":{"#cdata":"Suppresses the normal display of results. This option temporarily \ndisables the Output Delivery System (ODS)."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"OUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUT=SAS-data-set] \n      \nCreates an output SAS data set to contain observationwise canonical variable scores. The variables \nin the input data set are not included in the output data set to avoid data duplication for large \ndata sets; however, variables that are specified in the ID statement are included."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"OUTSTAT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUTSTAT=SAS-data-set] \n      \nCreates a TYPE=CORR output SAS data set that contains various statistics, including \nclass means, standard deviations, correlations, canonical correlations, canonical \nstructures, canonical coefficients, and means of canonical variables for each class level."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"PCORR","ProcedureOptionHelp":{"#cdata":"Displays pooled within-class correlations (partial correlations based on the pooled \nwithin-class covariances)."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"PCOV","ProcedureOptionHelp":{"#cdata":"Displays pooled within-class covariances."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"PREFIX=","ProcedureOptionHelp":{"#cdata":"[Syntax: PREFIX=name] \n      \nSpecifies a prefix for naming the canonical variables. By default, the names are Can1, Can2, Can3, \nand so on. If you specify PREFIX=Abc, the components are named Abc1, Abc2, and so on. The number of \ncharacters in the prefix plus the number of digits required to designate the canonical variables \nshould not exceed 32. The prefix is truncated if the combined length exceeds 32."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"PSSCP","ProcedureOptionHelp":{"#cdata":"Displays the pooled within-class corrected SSCP matrix."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"SHORT","ProcedureOptionHelp":{"#cdata":"Suppresses the display of canonical structures, canonical coefficients, and class \nmeans on canonical variables; only tables of canonical correlations and multivariate \ntest statistics are displayed."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"SIMPLE","ProcedureOptionHelp":{"#cdata":"Displays simple descriptive statistics for the total sample and within each class."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"SINGULAR=","ProcedureOptionHelp":{"#cdata":"[Syntax: SINGULAR=p] \n      \nSpecifies the criterion for determining the singularity of the total-sample correlation\nmatrix and the pooled within-class covariance matrix, where 0 < p < 1. The default is \nSINGULAR=1E–8."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"STDMEAN","ProcedureOptionHelp":{"#cdata":"Displays total-sample and pooled within-class standardized class means."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"TCORR","ProcedureOptionHelp":{"#cdata":"Displays total-sample correlations."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"TCOV","ProcedureOptionHelp":{"#cdata":"Displays total-sample covariances."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"TSSCP","ProcedureOptionHelp":{"#cdata":"Displays the total-sample corrected SSCP matrix."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"WCORR","ProcedureOptionHelp":{"#cdata":"Displays within-class correlations for each class level."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"WCOV","ProcedureOptionHelp":{"#cdata":"Displays within-class covariances for each class level."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"WSSCP","ProcedureOptionHelp":{"#cdata":"Displays the within-class corrected SSCP matrix for each class level."},"ProcedureOptionType":"S"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY variables; \n\nYou can specify a BY statement with PROC HPCANDISC to obtain separate analyses of observations in groups that \nare defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be \nsorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used. \n\nIf your input data set is not sorted in ascending order, use one of the following alternatives: \n\n  • Sort the data by using the SORT procedure with a similar BY statement. \n  • Specify the NOTSORTED or DESCENDING option in the BY statement for the BCHOICE procedure. The NOTSORTED \n    option does not mean that the data are unsorted but rather that the data are arranged in groups (according to values \n    of the BY variables) and that these groups are not necessarily in alphabetical or increasing numeric order. \n  • Create an index on the BY variables by using the DATASETS procedure (in Base SAS software)."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"CLASS","StatementHelp":{"#cdata":"Syntax: CLASS variable ;\n      \nThe values of the CLASS variable define the groups for analysis. Class levels \nare determined by the formatted values of the CLASS variable. The CLASS variable \ncan be numeric or character. A CLASS statement is required."},"StatementOptions":null},{"StatementName":"FREQ","StatementHelp":{"#cdata":"Syntax: FREQ variable;\n      \nThe variable in the FREQ statement identifies a numeric variable in the data set that contains the \nfrequency of occurrence of each observation. SAS high-performance analytics procedures that support \nthe FREQ statement treat each observation as if it appeared f times, where f is the value of the FREQ \nvariable for the observation. If the frequency value is not an integer, it is truncated to an integer. \nIf the frequency value is less than 1 or missing, the observation is not used in the analysis. When the \nFREQ statement is not specified, each observation is assigned a frequency of 1."},"StatementOptions":null},{"StatementName":"ID","StatementHelp":{"#cdata":"Syntax: ID variables; \n\nThe ID statement lists one or more variables from the input data set that are transferred to output data \nsets created by SAS high-performance analytics procedures, provided that the output data set produces one \n(or more) records per input observation."},"StatementOptions":null},{"StatementName":"PERFORMANCE","StatementHelp":{"#cdata":"Syntax: PERFORMANCE < performance-options > ;\n      \nThe PERFORMANCE statement defines performance parameters for multithreaded and distributed \ncomputing, passes variables about the distributed computing environment, and requests detailed \nresults about the performance characteristics of a High-Performance Analytics procedure.\n\nYou can also use the PERFORMANCE statement to control whether a high-performance analytical \nprocedure executes in single-machine or distributed mode."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"COMMIT=","StatementOptionHelp":{"#cdata":"Syntax: COMMIT=n\n          \nRequests that the High-Performance Analytics procedure write periodic updates to the \nSAS Log when observations are sent from the client to the appliance for distributed \nprocessing.\n\nHigh-Performance Analytics procedures do not have to use input data that are stored \nin the appliance. You can perform distributed computations regardless of the origin \nor format of the input data, provided the data are in a format that can be read by \nthe SAS System (for example, because a SAS/ACCESS engine is available)."},"StatementOptionType":"V"},{"StatementOptionName":"DETAILS","StatementOptionHelp":{"#cdata":"Requests a table that shows a timing breakdown of the procedure steps."},"StatementOptionType":"S"},{"StatementOptionName":"GRIDHOST=|HOST=","StatementOptionHelp":{"#cdata":"Syntax: GRIDHOST=\"name\" \nHOST=\"name\"\n\nSpecifies the name of the appliance host in single or double quotation marks. If this option is specified, \nit overrides the value of the GRIDHOST environment variable."},"StatementOptionType":"V"},{"StatementOptionName":"GRIDMODE=|MODE=","StatementOptionHelp":{"#cdata":"Syntax: GRIDMODE=SYM | ASYM \nSyntax: MODE=SYM | ASYM\n\nIs a deprecated option that specifies whether to run the high-performance analytical procedure in \nsymmetric (SYM) mode or asymmetric (ASYM) mode. This option overrides the GRIDMODE environment variable."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"SYM","@Value2":"ASYM"},"StatementOptionToolTips":{"@ToolTip1":"Specifies to run the high-performance analytical procedure in symmetric (SYM) mode","@ToolTip2":"Specifies to run the high-performance analytical procedure in asymmetric (ASYM) mode."}},{"StatementOptionName":"GRIDTIMEOUT=|TIMEOUT=","StatementOptionHelp":{"#cdata":"Syntax: GRIDTIMEOUT=s \nSyntax: TIMEOUT=s\n\nSpecifies the time-out in seconds for a high-performance analytical procedure to wait for a connection \nto the appliance and establish a connection back to the client. The default is 120 seconds. If jobs are \nsubmitted to the appliance through workload management tools that might suspend access to the appliance \nfor a longer period, you might want to increase the time-out value."},"StatementOptionType":"V"},{"StatementOptionName":"INSTALL=|INSTALLLOC=","StatementOptionHelp":{"#cdata":"Syntax: INSTALL=\"name\" \nSyntax: INSTALLLOC=\"name\"\n\nSpecifies the directory in which the shared libraries for the high-performance analytical procedure are \ninstalled on the appliance. Specifying the INSTALL= option overrides the GRIDINSTALLLOC environment variable."},"StatementOptionType":"V"},{"StatementOptionName":"LASRSERVER=|LASR=","StatementOptionHelp":{"#cdata":"Syntax: LASRSERVER=\"path\" \nSyntax: LASR=\"path\"\n\nSpecifies the fully qualified path to the description file of a SAS LASR Analytic Server instance. \nIf the input data set is held in memory by this LASR Analytic Server instance, then the procedure \nruns alongside LASR. This option is not needed to run alongside LASR if the DATA= specification of \nthe input data uses a libref that is associated with a LASR Analytic Server instance."},"StatementOptionType":"V"},{"StatementOptionName":"NODES=|NNODES=","StatementOptionHelp":{"#cdata":"Syntax: NODES=ALL | n \nSyntax: NNODES=ALL | n\n\nSpecifies the number of nodes in the distributed computing environment, provided that the data are not \nprocessed alongside the database.\n\nSpecifying NODES=0 indicates that you want to process the data in single-machine mode on the client machine. \nIf the input data are not alongside the database, this is the default. The high-performance analytical \nprocedures then perform the analysis on the client."},"StatementOptionType":"V"},{"StatementOptionName":"NTHREADS=|THREADS=","StatementOptionHelp":{"#cdata":"Syntax: NTHREADS=n \nSyntax: THREADS=n\n\nSpecifies the number of threads for analytic computations and overrides the SAS system option THREADS | NOTHREADS. \nIf you do not specify the NTHREADS= option, the number of threads is determined based on the number of CPUs on the \nhost on which the analytic computations execute. The algorithm by which a CPU count is converted to a thread count \nis specific to the high-performance analytical procedure. Most procedures create one thread per CPU for the analytic \ncomputations.\n\nBy default, high-performance analytical procedures run in multiple concurrent threads unless multithreading has been \nturned off by the NOTHREADS system option or you force single-threaded execution by specifying NTHREADS=1. The largest \nnumber that can be specified for n is 256. Individual high-performance analytical procedures can impose more stringent \nlimits if called for by algorithmic considerations.\n\nNote: The SAS system options THREADS | NOTHREADS apply to the client machine on which the SAS high-performance analytical \nprocedures execute. They do not apply to the compute nodes in a distributed environment."},"StatementOptionType":"V"}]}},{"StatementName":"VAR","StatementHelp":{"#cdata":"Syntax: VAR variables;\n    \nYou specify the quantitative variables to include in the analysis by using a VAR \nstatement. If you do not use a VAR statement, the analysis includes all numeric \nvariables that are not listed in other statements."},"StatementOptions":null},{"StatementName":"WEIGHT","StatementHelp":{"#cdata":"Syntax: WEIGHT variable;\n      \nThe variable in the WEIGHT statement is used as a weight to perform a weighted analysis of the data.\nObservations that have nonpositive or missing weights are not included in the analysis. If a WEIGHT \nstatement is not included, all observations that are used in the analysis are assigned a weight of 1. \n\nThe WEIGHT statement does not alter the degrees of freedom."},"StatementOptions":null}]}}}