{"Procedure":{"Name":"HPCORR","ProductGroup":"HPA","#comment":{},"ProcedureHelp":{"#cdata":"Syntax: PROC HPCORR <options> ; \n    FREQ variable ; \n    VAR variables ; \n    WEIGHT variable ; \n    PERFORMANCE < performance-options > ;\n\nThe HPCORR procedure computes Pearson correlation coefficients and the probabilities \nassociated with these statistics. The correlation statistics include the following: \n\n  o Pearson product-moment correlation \n\nPearson product-moment correlation is a parametric measure of a linear relationship \nbetween two variables. \n\nPolyserial correlation measures the correlation between two continuous variables with \na bivariate normal distribution, where only one variable is observed directly. Information \nabout the unobserved variable is obtained through an observed ordinal variable that is \nderived from the unobserved variable by classifying its values into a finite set of \ndiscrete, ordered values. \n\nA related type of correlation, polychoric correlation, measures the correlation between \ntwo unobserved variables with a bivariate normal distribution. Information about these \nvariables is obtained through two corresponding observed ordinal variables that are derived \nfrom the unobserved variables by classifying their values into finite sets of discrete, \nordered values. Polychoric correlation is not available in the HPCORR procedure, but it \nis available in the FREQ procedure. \n\nWhen only one set of analysis variables is specified, the default correlation analysis \nincludes descriptive statistics for each analysis variable and pairwise Pearson correlation \nstatistics for these variables. \n\nWhen two sets of analysis variables are specified, the default correlation analysis includes \ndescriptive statistics for each analysis variable and pairwise Pearson correlation statistics \nbetween the two sets of variables. \n\nWhen the relationship between two variables is nonlinear or when outliers are present, the \ncorrelation coefficient might incorrectly estimate the strength of the relationship. Plotting \nthe data enables you to verify the linear relationship and to identify the potential outliers. \nIf ODS Graphics is enabled, scatter plots and a scatter plot matrix can be created via the \nOutput Delivery System (ODS). Confidence and prediction ellipses can also be added to the \nscatter plot. \n\nYou can save the correlation statistics in a SAS data set for use with other statistical \nand reporting procedures."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"BEST=","ProcedureOptionHelp":{"#cdata":"Syntax: BEST=n \n      \nPrints the n highest correlation coefficients for each variable, n ≥ 1. Correlations are ordered \nfrom highest to lowest in absolute value. Otherwise, PROC HPCORR prints correlations in a rectangular \ntable, using the variable names as row and column labels."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"COV","ProcedureOptionHelp":{"#cdata":"Displays the variance and covariance matrix. When you specify the COV option, the Pearson \ncorrelations will also be displayed. If you specify the OUTP= option, the output data set \nalso contains the covariance matrix with the corresponding _TYPE_ variable value 'COV.'"},"ProcedureOptionType":"S"},{"ProcedureOptionName":"CSSP","ProcedureOptionHelp":{"#cdata":"Displays a table of the corrected sums of squares and crossproducts. When you specify the \nCSSCP option, the Pearson correlations will also be displayed. If you specify the OUTP= \noption, the output data set also contains a CSSCP matrix with the corresponding _TYPE_ \nvariable value 'CSSCP.'"},"ProcedureOptionType":"S"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"Syntax: DATA=SAS-data-set \n      \nNames the SAS data set to be analyzed by PROC HPCORR. By default, the procedure uses the \nmost recently created SAS data set."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"EXCLNPWGT|EXCLNPWGTS","ProcedureOptionHelp":{"#cdata":"Syntax: NAMELEN=number\n      \nExcludes observations with nonpositive weight values from the analysis. By default, \nPROC HPCORR treats observations with negative weights like those with zero weights \nand counts them in the total number of observations."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOCORR","ProcedureOptionHelp":{"#cdata":"Suppresses displaying of Pearson correlations. If you specify the OUTP= option, the data \nset type remains HPCORR. To change the data set type to COV, CSSCP, or SSCP, use the TYPE= \ndata set option."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOMISS","ProcedureOptionHelp":{"#cdata":"Excludes observations with missing values from the analysis. Otherwise, PROC HPCORR computes \ncorrelation statistics by using all of the nonmissing pairs of variables. Using the NOMISS \noption is computationally more efficient."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOPRINT","ProcedureOptionHelp":{"#cdata":"Suppresses all displayed output, which also includes output produced with ODS Graphics. Use the \nNOPRINT option if you want to create an output data set only."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOPROB","ProcedureOptionHelp":{"#cdata":"Suppresses the display of the probabilities that are associated with each correlation coefficient."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOSIMPLE","ProcedureOptionHelp":{"#cdata":"Suppresses printing simple descriptive statistics for each variable. However, if you request an \noutput data set, the output data set still contains simple descriptive statistics for \nthe variables."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"OUTP=|OUT=","ProcedureOptionHelp":{"#cdata":"Syntax: OUTP=output-data-set | OUT=output-data-set \n      \nCreates an output data set that contains Pearson correlation statistics. This data set also \nincludes means, standard deviations, and the number of observations. The value of the _TYPE_ \nvariable is 'HPCORR.' When you specify the OUTP= option, the Pearson correlations will also \nbe displayed."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"PLOTS=","ProcedureOptionHelp":{"#cdata":"Syntax: PLOTS <( MAXPOINTS=NONE |  n )> = plot-request \nPLOTS <(MAXPOINTS=NONE | n  )> = ( plot-request < …plot-request ) \n\n\nRequests statistical graphics via the Output Delivery System (ODS). \n\nMISSING FILE odsenable1 \n\n  ods graphics on;\n  proc hpcorr data=Fitness plots=matrix(histogram);\n  run;\n  ods graphics off;\n\nMISSING FILE odsenable2 \n\nThe global plot option MAXPOINTS= specifies that plots with elements that require processing \nmore than  points be suppressed. The default is MAXPOINTS=5000. This limit is ignored if you \nspecify MAXPOINTS=NONE."},"ProcedureOptionType":"S|V","ProcedureOptionValues":{"@Value1":"ALL","@Value2":"MATRIX","@Value3":"SCATTER","@Value4":"NONE"},"ProcedureOptionToolTips":{"@ToolTip1":"Produces all appropriate plots.","@ToolTip2":"Syntax: MATRIX <( matrix-options )>                                 Requests a scatter plot matrix for variables. That is, the procedure displays a symmetric matrix plot with variables in the VAR list if a WITH statement is not specified. Otherwise,  the procedure displays a rectangular matrix plot with the WITH variables appearing down the  side and the VAR variables appearing across the top.   The available matrix-options are as follows:     HIST | HISTOGRAM      displays histograms of variables in the VAR list (specified in the VAR statement) in the      symmetric matrix plot.     NVAR=ALL | n      specifies the maximum number of variables in the VAR list to be displayed in the matrix plot,      where n > 0. The NVAR=ALL option uses all variables in the VAR list. By default, NVAR=5.","@ToolTip3":"Syntax: SCATTER <( scatter-options )>                                  Requests scatter plots for pairs of variables. That is, the procedure displays a scatter  plot for each applicable pair of distinct variables from the VAR list.   When a scatter plot or a scatter plot matrix is requested, the Pearson correlations will  also be displayed.   The available scatter-options are as follows:     ELLIPSE=PREDICTION | CONFIDENCE | NONE      requests prediction ellipses for new observations (ELLIPSE=PREDICTION), confidence ellipses      for the mean (ELLIPSE=CONFIDENCE), or no ellipses (ELLIPSE=NONE) to be created in the scatter      plots. By default, ELLIPSE=PREDICTION.     NOINSET      suppresses the default inset of summary information for the scatter plot. The inset table      contains the number of observations (Observations) and correlation.     NVAR=ALL | n      specifies the maximum number of variables in the VAR list (specified in the VAR statement)      to be displayed in the plots, where n > 0. The NVAR=ALL option uses all variables in the VAR list.      By default, NVAR=5.       If the resulting maximum number of variables in the VAR list is greater than 10, only the      first 10 variables in the list are displayed in the scatter plots.","@ToolTip4":"Suppresses all plots."},"SubOptionsKeywords":"MAXPOINTS=|ELLIPSE=|CONFIDENCE|NONE|NOINSET|NVAL=|HIST|HISTOGRAM"},{"ProcedureOptionName":"RANK","ProcedureOptionHelp":{"#cdata":"Displays the ordered correlation coefficients for each variable. Correlations are ordered \nfrom highest to lowest in absolute value."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"SSCP","ProcedureOptionHelp":{"#cdata":"Displays a table of the sums of squares and crossproducts. When you specify the SSCP option, \nthe Pearson correlations are also displayed. If you specify the OUTP= option, the output \ndata set contains a SSCP matrix and the corresponding _TYPE_ variable value is 'SSCP.'"},"ProcedureOptionType":"S"},{"ProcedureOptionName":"VARDEF=","ProcedureOptionHelp":"Specifies the variance divisor in the calculation of variances and covariances. The default is VARDEF=DF.<![CDATA[Syntax: VARDEF=DF | N | WDF | WEIGHT | WGT ]]>","ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"DF","@Value2":"N","@Value3":"WDF","@Value4":"WEIGHT|WGT"},"ProcedureOptionToolTips":{"@ToolTip1":"Degrees of freedom","@ToolTip2":"Number of observations","@ToolTip3":"Sum of weights minus one","@ToolTip4":"Sum of weights"}}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"FREQ","StatementHelp":{"#cdata":"Syntax: FREQ variable ; \n\nThe FREQ statement lists a numeric variable whose value represents the frequency of the \nobservation. If you use the FREQ statement, the procedure assumes that each observation \nrepresents n observations, where n is the value of the FREQ variable. If n is not an \ninteger, SAS truncates it. If n is less than 1 or is missing, the observation is excluded \nfrom the analysis. The sum of the frequency variable represents the total number of \nobservations. \n\nThe effects of the FREQ and WEIGHT statements are similar except when calculating degrees \nof freedom."},"StatementOptions":null},{"StatementName":"VAR","StatementHelp":{"#cdata":"Syntax: VAR variables ; \n\nThe VAR statement lists variables for which to compute correlation coefficients. If the \nVAR statement is not specified, PROC HPCORR computes correlations for all numeric variables \nnot listed in other statements."},"StatementOptions":null},{"StatementName":"WEIGHT","StatementHelp":{"#cdata":"Syntax: WEIGHT variable ; \n\nThe WEIGHT statement lists weights to use in the calculation of Pearson weighted product-moment \ncorrelation. \n\nThe observations with missing weights are excluded from the analysis. By default, for observations \nwith nonpositive weights, weights are set to zero and the observations are included in the analysis. \nYou can use the EXCLNPWGT option to exclude observations with negative or zero weights from the analysis."},"StatementOptions":null},{"StatementName":"PERFORMANCE","StatementHelp":{"#cdata":"Syntax: PERFORMANCE < performance-options > ;\n      \nThe PERFORMANCE statement defines performance parameters for multithreaded and distributed computing,\npasses variables about the distributed computing environment, and requests detailed results about the\nperformance characteristics of a SAS High-Performance Analytics procedure.\nWith the PERFORMANCE statement you can also control whether a SAS High-Performance Analytics\nprocedure executes in SMP or MPP mode."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"COMMIT=","StatementOptionHelp":{"#cdata":"Syntax: COMMIT=n\n          \nThis option specifies the minimum number of observations transferred from the client to the \nappliance necessary to update the SAS Log. For instance, if you specify COMMIT=5000, then \nevery time the number of observations sent exceeds an integer multiple of 5000 a log message \nis produced. This message indicates the actual number of observations distributed, not the \nCOMMIT= value that triggered the message. "},"StatementOptionType":"V"},{"StatementOptionName":"CPUCOUNT=","StatementOptionHelp":{"#cdata":"Syntax: CPUCOUNT=ACTUAL | num\n          \nThis argument specifies how many processors PROC HPBIN assumes are available on each host \nin the computing environment. Valid values for number are integers between 1 and 256, \ninclusive. Setting CPUCOUNT= to a value greater than the actual number of available CPUs \nmight results in reduced performance. Specify CPUCOUNT=ACTUAL to set CPUCOUNT= to the \nnumber of processors physically available. This number can be less than the physical \nnumber of CPUs if the SAS process has been restricted by system administration tools. \nThis option overrides the CPUCOUNT= SAS system option. If PROC HPBIN executes in SMP \nmode, then this option referes to the client machine of the SAS session. If PROC HPBIN \nexecutes in MPP mode, then this option applies the nodes on the appliance."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ACTUAL","@Value2":"<num>"},"StatementOptionToolTips":{"@ToolTip1":"Sets CPUCOUNT to the number of processors physically available. This number can be less than the physical number of CPUs if the SAS process has been restricted by system administration tools.","@ToolTip2":"Replace <num> with an actual number. Setting CPUCOUNT= to a number  greater than the actual number of available CPUs might result in reduced performance. This  option overrides the CPUCOUNT= SAS system option."}},{"StatementOptionName":"DATASERVER=","StatementOptionHelp":{"#cdata":"Syntax: DATASERVER=“name”\n          \nSpecifies the name of the server on Teradata systems as defined through the hosts file \nand as used in the LIBNAME statement for Teradata. For example, if the hosts file defines\n\n    myservercop1 33.44.55.66\n    \nas the server for Teradata, then a LIBNAME specification would be as follows:\n\n    libname TDLib teradata server=myserver user= password= database= ;\n    \nA PERFORMANCE statement to induce running alongside the Teradata server would specify the\nfollowing:\n\n    performance dataserver=\"myserver\";\n    \nIf the DATASERVER= option is specified, it overrides the GRIDDATASERVER environment \nvariable."},"StatementOptionType":"V"},{"StatementOptionName":"DETAILS","StatementOptionHelp":{"#cdata":"Specify this option to request a table that shows a timing breakdown of the procedure steps."},"StatementOptionType":"V"},{"StatementOptionName":"TIMEOUT=","StatementOptionHelp":{"#cdata":"Syntax: TIMEOUT=s\n          \nThis options specifies the length of time, in seconds, PROC HPBIN should wait for a connection \nto the appliance and to establish a connection back to the client. The default value for s is \n120 seconds. If jobs are submitted to the appliance through workload management tools that might \nsuspend access to the appliance for a longer period, you might want to increase the timeout value. "},"StatementOptionType":"V"},{"StatementOptionName":"HOST=|GRIDHOST=","StatementOptionHelp":{"#cdata":"Syntax: HOST=name | GRIDHOST=name\n          \nThis option specifies the name of the appliance host. The HOST= option overrides the value \nof the GRIDHOST environment variable."},"StatementOptionType":"V"},{"StatementOptionName":"INSTALL=|INSTALLLOC=","StatementOptionHelp":{"#cdata":"Syntax: INSTALL=“name” | INSTALLLOC=“name” \n          \nThis option specifies the directory where the High-Performance Analytics shared libraries \nare installed on the appliance. Specifying the INSTALL= option overrides the GRIDINSTALLLOC \nenvironment variable."},"StatementOptionType":"V"},{"StatementOptionName":"NODES=|NNODES=","StatementOptionHelp":{"#cdata":"Syntax: NODES=n | NNODES=n\n          \nThis option specifies the number of nodes in the distributed computing environment, \nprovided that the data are not processed alongside the database. \n\nSpecify NODES=0 to indicate that you want to process the data in SMP mode on the client \nmachine. If the input data are not alongside the database, this is the default setting. \nThe HPBIN procedure then performs multithreaded analysis on the client. If the data are \nnot read alongside the database, the NODES= option specifies the number of nodes on the \nappliance that are involved in the analysis. If the number of nodes can be modified by \nthe application, you can specify a NODES= option where n exceeds the number of physical \nnodes on the appliance. The High-Performance Analytics software then oversubscribes the \nnodes and associates nodes with multiple units of work. For example, on a system with \n16 appliance nodes, the following statement would oversubscribe the system by a factor \nof 3: \n\n  performance nodes=48 host=\"hpa.sas.com\"; \n  \nGenerally, it is not advisable to oversubscribe the system because the analytic code \nis optimized for a certain level of multithreading on the nodes that depend on the CPU \ncount. If the data are read alongside the distributed database on the appliance, specifying \na nonzero value for the NODES= option has no effect. The number of units of work in the \ndistributed computing environment is then determined by the distribution of the data and \ncannot be altered."},"StatementOptionType":"V"},{"StatementOptionName":"NTHREADS=","StatementOptionHelp":{"#cdata":"Syntax: NTHREADS=n \n          \nThis option specifies the number of threads used for analytic computations and overrides the \nSAS system option THREADS | NOTHREADS. If you do not specify the NTHREADS= option, then the \nnumber of threads is determined based on the number of CPUs on the host machine where the \nanalytic computations execute. By default, High-Performance Analytics procedures execute in \nmultiple concurrent threads, unless you disable this behavior with the NOTHREADS system option \nor you specify NTHREADS=1 to force single-threaded execution. The value specified here must \nnot exceed 256.\n\nNote:The SAS system option THREADS | NOTHREADS applies to the current machine where the SAS \nHigh-Performance Analytics procedures execute. This option does not apply to the compute nodes \nin a distributed environment."},"StatementOptionType":"V"}]}}]}}}