{"Procedure":{"Name":"HPNEURAL","ProductGroup":"Enterprise Miner/HPA","#comment":{},"ProcedureHelp":{"#cdata":"Syntax: PROC HPNEURAL <DATA=SAS-data-set > < DISTR=ALL | SPLIT > < NOPRINT > ;\n    PERFORMANCE performance-options ;\n    ARCHITECTURE architecture-option ;\n    ID variables ;\n    INPUT variables < / LEVEL=INT | LEVEL=NOM < MISSING=MAP > > ;\n    WEIGHT variable | _INVERSE_PRIORS_ ;\n    HIDDEN number ;\n    TARGET variables < / LEVEL=INT | LEVEL=NOM > ;\n    PARTITION ROLEVAR=variable( TRAIN=value | VALIDATE=value ) ;\n    PARTITION FRACTION( TRAIN=number | VALIDATE=number ) ;\n    TRAIN < NUMTRIES=number > < MAXITER=number >\n      <VALID=_NONE_ > <OUTMODEL=SAS-data-set > ;\n    SCORE OUT=SAS-data-set <MODEL=SAS-data-set > ;\n    CODE FILE=’external-file’ | fileref ;\n\nThe HPNEURAL procedure is a high-performance procedure that trains a multilayer perceptron \nneural network. For more information about multilayer perceptron neural networks, see Bishop \n(1995). PROC HPNEURAL can also use the trained network to score the input data set. \n\nPROC HPNEURAL reads and writes data in distributed form and makes full use of multicore \ncomputers and distributed computing environments to perform training and scoring. \n\nTraining a multilayer perceptron neural network requires the unconstrained minimization of a nonlinear\nobjective function. Because there are currently no practical methods to guarantee finding a global minimum\nof that objective function, one way to be reasonably sure of finding a good solution is to train the network\nmultiple times using different sets of initial values for the weights. Thus, even problems with smaller numbers\nof variables and training observations can benefit from the use of multicore computers and distributed\ncomputing environments."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"Syntax: DATA=SAS-data-set\n      \nNames the SAS data set that contains the training and validation observations to be used by PROC\nHPNEURAL to train the neural network or that contains the observations to be scored when you are\nperforming stand-alone scoring. The default input data set is the most recently created data set. \n\nWhen you use PROC HPNEURAL to train a neural network, each observation must contain the input,\nweight, validation, ID, and target variables that are specified in the associated INPUT, WEIGHT,\nPARTITION, ID, and TARGET statements."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"DISTR=","ProcedureOptionHelp":{"#cdata":"Syntax: DISTR=ALL | SPLIT\n      \nSpecifies whether the input data set is to be replicated in the memory of each node in a distributed\ncomputing environment. If this option is not specified, PROC HPNEURAL makes this decision\nautomatically based on the size of the input data set. This option is ignored if PROC HPNEURAL is\nnot running in a distributed computing environment. \n\nWhen PROC HPNEURAL runs in a distributed computing environment, PROC HPNEURAL usually\ndivides the input data set among all the nodes to minimize the time it takes to optimize each try.\nHowever, if the input data set is small, dividing the data in this way might be inefficient because of the\ninterconnect delay (the time it takes to send partial results between nodes). It might be more efficient\nto have each node have a complete copy of the data and run each try in parallel on separate nodes.\nEach try might take longer because it uses only a single node, but it could take less time to finish all\nthe tries because the tries are running in parallel. \n\nYou can force the data to be redistributed so that each node has a complete in-memory copy by specifying\nDISTR=ALL. You can prevent the data from being redistributed by specifying DISTR=SPLIT."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"ALL","@Value2":"SPLIT"},"ProcedureOptionToolTips":{"@ToolTip1":"Forces the data to be redistributed so that each node has a complete in-memory copy.","@ToolTip2":"Prevents the data from being redistributed."}},{"ProcedureOptionName":"NOPRINT","ProcedureOptionHelp":{"#cdata":"Syntax: NOPRINT\nspecifies that no ODS tables be created."},"ProcedureOptionType":"S"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"ARCHITECTURE","StatementHelp":{"#cdata":"Syntax: ARCHITECTURE architecture-option ; \n      \nThe ARCHITECTURE statement specifies the architecture of the neural network to be trained."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"LOGISTIC","StatementOptionHelp":{"#cdata":"Specifies a multilayer perceptron with no hidden units (which is equivalent to a logistic regression). If\nyou specify this architecture, the HIDDEN statement is not allowed."},"StatementOptionType":"S"},{"StatementOptionName":"LAYER1","StatementOptionHelp":{"#cdata":"Specifies a multilayer perceptron with a single hidden layer."},"StatementOptionType":"S"},{"StatementOptionName":"LAYER1SKIP","StatementOptionHelp":{"#cdata":"Specifies a multilayer perceptron with a single hidden layer and additional connections between each\ninput and each target neuron. Logistic regression is used to initialize the network for the first try."},"StatementOptionType":"S"},{"StatementOptionName":"LAYER2","StatementOptionHelp":{"#cdata":"Specifies a multilayer perceptron with two hidden layers. The number of hidden neurons is split equally\nbetween the first and second layer. If the number of hidden neurons is odd, the first hidden layer has\nthe extra neuron."},"StatementOptionType":"S"},{"StatementOptionName":"LAYER2SKIP","StatementOptionHelp":{"#cdata":"Specifies a multilayer perceptron with two hidden layers and additional connections between each input\nand each target neuron. The number of hidden neurons is split equally between the first and second\nlayer. If the number of hidden neurons is odd, the first hidden layer has the extra neuron. Logistic\nregression is used to initialize the network for the first try."},"StatementOptionType":"S"}]}},{"StatementName":"CODE","StatementHelp":{"#cdata":"Syntax: CODE FILE=’external-file’ | fileref ; \n      \nThe CODE statement uses the current neural network model to generate SAS DATA step statements and save\nthem in an external text file that can later be used to score a data set. The file does not contain the surrounding\nPROC and RUN statements. The DATA step statements can be used with the standard DATA step, PROC\nDS2, or PROC HPDS2. \n\nThe CODE statement is optional."},"StatementOptions":{"StatementOption":{"StatementOptionName":"FILE=","StatementOptionHelp":{"#cdata":"Syntax: FILE=’external-file’ | fileref ;  \n          \nFILE=’external-file’\n  specifies an external text file where the generated statements are saved.\n\nFILE=fileref\n  specifies a fileref that refers to an external text file where the generated statements are saved."},"StatementOptionType":"V"}}},{"StatementName":"HIDDEN","StatementHelp":{"#cdata":"Syntax: HIDDEN number ;\n      \nThe HIDDEN statement specifies the number of hidden neurons in the network. The number must be an\ninteger greater than or equal to 1 (2 for two-layer architectures). For two-layer architectures (LAYER2 and\nLAYER2SKIP in the ARCHITECTURE statement), the hidden neurons are split between the first and second\nlayer. In this case, if the number of hidden neurons is odd, the first hidden layer has the extra neuron. \n\nAll hidden neurons use a hyperbolic-tangent activation function. \n\nWhen training, you must include exactly one HIDDEN statement, unless you specify ARCHITECTURE\nLOGISTIC (in which case the HIDDEN statement is not allowed). The HIDDEN statement is not allowed\nwhen you do stand-alone scoring."},"StatementOptions":null},{"StatementName":"ID","StatementHelp":{"#cdata":"Syntax: ID variables ; \n      \nThe ID statement lists one or more variables from the input data set that are transferred \nto the output data set that is specified in the SCORE statement.\n\nThe ID statement is optional."},"StatementOptions":null,"ProcedureStatement":{"StatementName":"WEIGHT","StatementHelp":{"#cdata":"Syntax: WEIGHT variable;\n      \nThe WEIGHT statement identifies a numeric variable in the input data set that contains the weight to be\nplaced on the prediction error (the difference between the output of the network and the target value \nspecified in the input data set) for each observation during training. \n\nIf variable is less than or equal to 0 or is missing, the observation is not used for training or for \ncomputing validation error. When validation error is computed during training, the weights on the \nvalidation observations are used even though weights are not used when scoring. \n\nThe WEIGHT statement is optional. If a WEIGHT statement is not included, all observations are assigned\na weight of 1."}}},{"StatementName":"INPUT","StatementHelp":{"#cdata":"Syntax: INPUT variables < / LEVEL= INT | NOM> ;\n\nThe INPUT statement identifies the variables in the input data set that are inputs to the neural network.\n\nWhen training, you must include one or more INPUT statements. You need more than one INPUT statement\nwhen you have both interval and nominal input variables. The INPUT statement is not allowed when you do\nstand-alone scoring.\n\nAll interval input variables are automatically standardized to the range [–1, 1].\n\nIf an observation has missing values for any of the specified input variables, the observation is not used for\ntraining or for computing validation error."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"LEVEL=","StatementOptionHelp":{"#cdata":"Syntax: LEVEL= INT | NOM\n          \nSpecifies whether the variables are interval variables (INT), which must be numeric, or\nnominal variables (NOM), also known as classification variables, which can be numeric or \ncharacter. The default for the LEVEL option is INT."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"INT","@Value2":"NOM"},"StatementOptionToolTips":{"@ToolTip1":"Specifies that the variables are interval variables (INT), which must be numeric.","@ToolTip2":"Specifies that the variables are nominal variables (NOM), also known as classification  variables, which can be numeric or character."}},{"StatementOptionName":"MISSING=","StatementOptionHelp":{"#cdata":"Syntax: MISSING=MAP \n          \nSpecifies that the missing value for nominal variables should be treated as a valid level (mapped to\nlevel 0). This option is not allowed for interval variables."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"MAP"},"StatementOptionToolTips":{"@ToolTip1":"Specifies that the missing value for nominal variables should be treated as a valid level (mapped to level 0)."}}]}},{"StatementName":"PARTITION","StatementHelp":{"#cdata":"Syntax: PARTITION ROLEVAR=variable( TRAIN=value | VALIDATE=value ) ;\n  PARTITION FRACTION( TRAIN=number | VALIDATE=number ) ; \n\nThe PARTITION statement specifies how to divide the input data set into a training subset and a validation\nsubset. \n\nThe statement implements two alternate methods of specifying the split between the training and validation\ndata. Either you can explicitly specify training observations and validation observations by specifying\nROLEVAR=variable, where variable is a variable in the input data set, or you can specify that an approximate\nfraction of the input data set be used for training observations or validation observations by specifying\nFRACTION( TRAIN=number ) or FRACTION( VALIDATE=number )."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ROLEVAR=","StatementOptionHelp":{"#cdata":"Syntax: ROLEVAR=variable( TRAIN=value | VALIDATE=value ) \n          \nSpecifies that the variable in the input data set be used to decide whether an observation is used for\ntraining or for validation. You can specify either the value used to identify training observations or the\nvalue used to identify validation observations. If you specify TRAIN=value, then an observation is\nused for training if the value of variable equals value; otherwise the observation is used for validation.\nIf you specify VALIDATE=value, then an observation is used for validation if the value of variable\nequals value; otherwise the observation is used for training."},"StatementOptionType":"V","SubOptionsKeywords":"TRAIN=|VALIDATE="},{"StatementOptionName":"FRACTION","StatementOptionHelp":{"#cdata":"Syntax: FRACTION( TRAIN=number | VALIDATE=number ) \n          \nSpecifies the approximate fraction (between 0 and 1) of the input data set to be used for training or\nvalidation. If you specify TRAIN=number, then approximately the fraction of the data set specified\nby number is used as training observations, and the rest are used for validation observations. If you\nspecify VALIDATE=number, then approximately the fraction of the data set specified by number\nis used as validation observations. The split between training and validation observations can only\napproximate the requested fraction because that fraction is used as a cutoff value for a pseudorandom\nnumber generator to determine the actual split. If you require a more accurate split or a split that\nis guaranteed to be identical across different distributed computing environments, you must use the\nROLEVAR option to specify the split explicitly."},"StatementOptionType":"S","SubOptionsKeywords":"TRAIN=|VALIDATE="}]}},{"StatementName":"PERFORMANCE","StatementHelp":{"#cdata":"Syntax: PERFORMANCE < performance-options > ;\n      \nThe PERFORMANCE statement defines performance parameters for multithreaded and distributed \ncomputing."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"COMMIT=","StatementOptionHelp":{"#cdata":"Syntax: COMMIT=n\n          \nRequests that the High-Performance Analytics procedure write periodic updates to the \nSAS Log when observations are sent from the client to the appliance for distributed \nprocessing.\n\nHigh-Performance Analytics procedures do not have to use input data that are stored \nin the appliance. You can perform distributed computations regardless of the origin \nor format of the input data, provided the data are in a format that can be read by \nthe SAS System (for example, because a SAS/ACCESS engine is available)."},"StatementOptionType":"V"},{"StatementOptionName":"CPUCOUNT=","StatementOptionHelp":{"#cdata":"Syntax: CPUCOUNT=ACTUAL | num\n          \nSpecifies how many processors the procedure assumes are available on each host in the \ncomputing environment. num can be any integer from 1 to 256.\n\nCPUCOUNT=ACTUAL sets CPUCOUNT to the number of physical processors available. This number\ncan be less than the physical number of CPUs if the SAS process has been restricted by system\nadministration tools. Setting CPUCOUNT= to a number greater than the actual number of available\nCPUs might result in reduced performance. This option overrides the CPUCOUNT= SAS system\noption.\n\nIf a High-Performance Analytics procedure executes in SMP mode, this option refers to the client\nmachine of the SAS session. In MPP mode, this option applies to the nodes on the appliance."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ACTUAL","@Value2":"<num>"},"StatementOptionToolTips":{"@ToolTip1":"Sets CPUCOUNT to the number of physical processors available. This number can be less than the physical number of CPUs if the SAS process has been restricted by system administration tools.","@ToolTip2":"Replace <num> with an actual number. Setting CPUCOUNT= to a number  greater than the actual number of available CPUs might result in reduced performance. This  option overrides the CPUCOUNT= SAS system option."}},{"StatementOptionName":"DATASERVER=","StatementOptionHelp":{"#cdata":"Syntax: DATASERVER=“name”\n          \nSpecifies the name of the server on Teradata systems as defined through the hosts file \nand as used in the LIBNAME statement for Teradata. For example, if the hosts file defines\n\n    myservercop1 33.44.55.66\n    \nas the server for Teradata, then a LIBNAME specification would be as follows:\n\n    libname TDLib teradata server=myserver user= password= database= ;\n    \nA PERFORMANCE statement to induce running alongside the Teradata server would specify the\nfollowing:\n\n    performance dataserver=\"myserver\";\n    \nIf the DATASERVER= option is specified, it overrides the GRIDDATASERVER environment \nvariable."},"StatementOptionType":"V"},{"StatementOptionName":"DETAILS","StatementOptionHelp":{"#cdata":"Requests a table that shows a timing breakdown of the procedure steps."},"StatementOptionType":"V"},{"StatementOptionName":"TIMEOUT=","StatementOptionHelp":{"#cdata":"Syntax: TIMEOUT=s\n          \nSpecifies the timeout in seconds for a High-Performance Analytics procedure to wait for a connection\nto the appliance and establish a connection back to the client. The default is s=120 seconds. If jobs\nare submitted to the appliance through workload management tools that might suspend access to the\nappliance for a longer period, you might want to increase the timeout value."},"StatementOptionType":"V"},{"StatementOptionName":"HOST=|GRIDHOST=","StatementOptionHelp":{"#cdata":"Syntax: HOST=“name” | GRIDHOST=“name” \n          \nSpecifies the name of the appliance host in single or double quotes. If the HOST= option \nis specified, it overrides the value of the GRIDHOST environment variable."},"StatementOptionType":"V"},{"StatementOptionName":"INSTALL=|INSTALLLOC=","StatementOptionHelp":{"#cdata":"Syntax: INSTALL=“name” | INSTALLLOC=“name” \n          \nSpecifies the directory in which the High-Performance Analytics shared libraries are \ninstalled on the appliance. Specifying the INSTALL= option overrides the GRIDINSTALLLOC \nenvironment variable."},"StatementOptionType":"V"},{"StatementOptionName":"NODES=|NNODES=","StatementOptionHelp":{"#cdata":"Syntax: NODES=n | NNODES=n\n          \nSpecifies the number of nodes in the distributed computing environment, provided that \nthe data are not processed alongside the database.\n\nIf you specify NODES=0, you indicate that you want to process the data in SMP mode on \nthe client machine. If the input data are not alongside the database, this is the default. \nThe High-Performance Analytics procedures then perform the analysis mutlithreaded on the client."},"StatementOptionType":"V"},{"StatementOptionName":"NTHREADS=","StatementOptionHelp":{"#cdata":"Syntax: NTHREADS=n \n          \nSpecifies the number of threads for analytic computations and overrides the SAS system option\nTHREADS | NOTHREADS. If you do not specify the NTHREADS= option, the number of threads\nare determined based on the number of CPUs on the host on which the analytic computations execute.\nThe algorithm by which a CPU count is converted to a thread count is specific to the High-\nPerformance Analytics procedure. Most procedures create one thread per CPU for the analytic computations.\nBy default, High-Performance Analytics procedures execute in multiple concurrent threads unless\nturned off by the NOTHREADS system option or you force single-threaded execution with\nNTHREADS=1. The largest number that can be specified for n is 256. Individual High-Performance\nAnalytics procedures can impose more stringent limits if called for by algorithmic considerations.\nYou can affect the determination of the CPU count with the CPUCOUNT= option in the PERFORMANCE\nstatement.\n\nNOTE: The SAS system options THREADS | NOTHREADS apply to the client machine on which\nthe SAS High-Performance Analytics procedures execute. They do not apply to the compute nodes\nin a distributed environment."},"StatementOptionType":"V"}]}},{"StatementName":"SCORE","StatementHelp":{"#cdata":"Syntax: SCORE OUT=SAS-data-set <MODEL=SAS-data-set > ; \n      \nThe SCORE statement causes the HPNEURAL procedure to write the network’s target and predicted output\nfor each observation in the input data set to the output data set that is specified by the OUT option, along\nwith any variables from the input data set that are specified in the ID statement. \n\nWhen you are training, the SCORE statement is optional but the MODEL= keyword is not allowed. When\nyou are doing stand-alone scoring, the SCORE statement is required and the MODEL= keyword must be\nused."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"OUT=","StatementOptionHelp":{"#cdata":"Syntax: OUT=SAS-data-set ; \n      \nSpecifies the data set to contain the predicted values of the target variables. For nominal variables, each\nobservation also contains the computed probabilities of each class level. This keyword is required."},"StatementOptionType":"V"},{"StatementOptionName":"MODEL=","StatementOptionHelp":{"#cdata":"Syntax: MODEL=SAS-data-set \n          \nSpecifies the data set that contains the model parameters for a previously trained network. You can\nspecify this keyword only when you are doing stand-alone scoring."},"StatementOptionType":"V"}]}},{"StatementName":"TARGET","StatementHelp":{"#cdata":"Syntax: TARGET variables < / LEVEL= INT | NOM> ; \n      \nThe TARGET statement identifies the variables in the input data set that the network is to be trained to\npredict. The default for the LEVEL= option is INT.\n\nWhen training, you must include one or more TARGET statements. You need more than one TARGET\nstatement when you have both interval and nominal target variables. The TARGET statement is not allowed\nwhen you do stand-alone scoring. \n\nAll interval target variables are automatically standardized to the range [0.1, 0.9]. The HPNEURAL procedure\nautomatically converts them back to their original scale before it computes fit statistics and writes predictions\nto the scoring data set. \n\nFor interval variables, all target neurons use a sigmoid activation function."},"StatementOptions":{"StatementOption":{"StatementOptionName":"LEVEL=","StatementOptionHelp":{"#cdata":"Syntax: LEVEL= INT | NOM\n          \nSpecifies whether the variables are interval variables (INT), which must be numeric, or\nnominal variables (NOM), also known as classification variables, which can be numeric or \ncharacter. The default for the LEVEL option is INT."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"INT","@Value2":"NOM"},"StatementOptionToolTips":{"@ToolTip1":"Specifies that the variables are interval variables (INT), which must be numeric.","@ToolTip2":"Specifies that the variables are nominal variables (NOM), also known as classification  variables, which can be numeric or character."}}}},{"StatementName":"TRAIN","StatementHelp":{"#cdata":"Syntax: TRAIN < NUMTRIES=number > < MAXITER=number >\n  <VALID=_NONE_ > <OUTMODEL=SAS-data-set > ; \n\nThe TRAIN statement causes the HPNEURAL procedure to use the training data that are specified in\nthe PROC HPNEURAL statement to train a neural network model whose structure is specified in the\nARCHITECTURE, INPUT, TARGET, and HIDDEN statements. The goal of training is to determine a set of\nnetwork weights that best predicts the targets in the training data while still doing a good job \nof predicting targets of unseen data (that is, generalizing well and not overfitting)."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"NUMTRIES=","StatementOptionHelp":{"#cdata":"Syntax: NUMTRIES=number \n      \nSpecifies the number of times the network is to be trained using a different starting points. Specifying\nthis option helps ensure that the optimizer finds the set of weights that truly minimizes the objective\nfunction and does not return a local minimum. The value of number must be an integer between 1 and\n99,999. The default is 5."},"StatementOptionType":"V"},{"StatementOptionName":"MAXITER=","StatementOptionHelp":{"#cdata":"Syntax: MAXITER=number\nspecifies the maximum number of iterations (weight adjustments) for the optimizer to make before\nterminating. \n\nSetting number to a large value does not mean that the optimizer actually iterates that many times.\nOften, training or validation error stops improving much sooner, usually after a few hundred iterations.\n\nWhen you are training using large data sets, you can do a training run with MAXITER=1 to determine\napproximately how long each iteration will take.\nThe default is 50."},"StatementOptionType":"V"},{"StatementOptionName":"VALID=","StatementOptionHelp":{"#cdata":"Syntax: VALID=_NONE_ \n          \nSpecifies that a validation subset not be used to help determine when to stop training.\nIf you specify VALID=_NONE_ in the TRAIN statement, you cannot have a PARTITION statement."},"StatementOptionType":"V"},{"StatementOptionName":"OUTMODEL=","StatementOptionHelp":{"#cdata":"Syntax: OUTMODEL=SAS-data-set \n          \nSpecifies the data set to which to save the model parameters for the trained network. These parameters\ninclude the network architecture, input and target variable names and types, and trained weights.\n\nYou can use the model data set later to score a different input data set as long as the variable names and\ntypes of the variables in the new input data set match those of the training data set."},"StatementOptionType":"V"}]}},{"StatementName":"WEIGHT","StatementHelp":{"#cdata":"Syntax: WEIGHT variable | _INVERSE_PRIORS_ ; \n      \nIf you specify a WEIGHT statement, variable identifies a numeric variable in the input data set that contains\nthe weight to be placed on the prediction error (the difference between the output of the network and the\ntarget value specified in the input data set) for each observation during training. \n\nIf, instead of specifying a variable, you specify the keyword _INVERSE_PRIORS_, the HPNEURAL\nprocedure calculates the weight applied to the prediction error of each nominal target variable as the total\nnumber of observations divided by the number of observations whose target class is the same as the current\nobservation (in other words, the inverse of the fraction of the number of times that the target class occurs in\nthe input data set)."},"StatementOptions":{"StatementOption":{"StatementOptionName":"_INVERSE_PRIORS_","StatementOptionHelp":{"#cdata":"If, instead of specifying a variable, you specify the keyword _INVERSE_PRIORS_, the HPNEURAL\nprocedure calculates the weight applied to the prediction error of each nominal target variable as the total\nnumber of observations divided by the number of observations whose target class is the same as the current\nobservation (in other words, the inverse of the fraction of the number of times that the target class occurs in\nthe input data set)."},"StatementOptionType":"S"}}}]}}}