{"Procedure":{"Name":"HTSNP","ProductGroup":"SAS/GENETICS","ProcedureHelp":{"#cdata":"Syntax: PROC HTSNP <options> ; \n    BY variables ; \n    FREQ variable ; \n    VAR variables ; \n  \nSingle nucleotide polymorphism (SNP) is the most abundant form of genetic variation \nand accounts for about 90% of human DNA polymorphism. There is roughly one SNP per 1 \nkilobase in the human genome. Studies of human haplotype variations that use SNPs over \nlarge genomic regions suggest the presence of discrete blocks with limited haplotype \ndiversity punctuated by recombination hot spots. The intrablock linkage disequilibrium \n(LD) decreases only gradually with distance, while the interblock LD decays much more \nrapidly. Within each block, because of high LD, some allele(s) might always be coexistent \nwith a particular allele at another locus such that (1) little haplotype diversity exists \nin the block, and (2) not all SNPs will be essential in characterizing the haplotype \nstructure in the block. Therefore, the most common haplotypes could usually be captured \nby a small subset of SNPs, termed haplotype tagging SNPs (htSNPs) by Johnson et al. (2001)."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"CONV=","ProcedureOptionHelp":{"#cdata":"[Syntax: CONV=number] \n        \nSpecifies the convergence criterion for search of htSNPs, where 0 < number ≤ 1. The search \nprocess is stopped when the haplotype criterion is greater than or equal to number specified \nin the CONV= option. The default value is 0.90. When METHOD=SA or METHOD=EX is specified, the \nCONV= option is ignored and the searching continues until the annealing schedule is finished \nor the whole search space is traversed."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"CRITERION=","ProcedureOptionHelp":{"#cdata":"Indicates the criterion to use for evaluating candidate sets of htSNPs. \n        \nBy default, CRITERION=PDE."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"PDE","@Value2":"RSQH"},"ProcedureOptionToolTips":{"@ToolTip1":"The proportion of diversity explained (PDE) is used (Clayton 2002).","@ToolTip2":"Stram et al.’s R²h is used to measure haplotype richness (2003)."}},{"ProcedureOptionName":"CUTOFF=","ProcedureOptionHelp":{"#cdata":"[Syntax: CUTOFF=number] \n        \nSpecifies a lower bound on a haplotype’s frequency in order for that haplotype \nto be included in the search process for sets of htSNPs. The value of number must \nbe between 0 and 1. By default, all haplotypes from the sample are included in the \nsearch process."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n        \nNames the input SAS data set to be used by PROC HTSNP. The default is to use the \nmost recently created data set."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"MAXSIZE=","ProcedureOptionHelp":{"#cdata":"[Syntax: MAXSIZE=number] \n        \nSpecifies the maximum number of markers to be included in the subset for incremental \nsearch by default or when METHOD=INCR is specified. The number must be a positive \ninteger that is less than or equal to the number of markers specified in the VAR \nstatement. Searching is carried out until convergence is reached according to the \nconvergence criterion, or until number of markers have been included in the subset."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"METHOD=","ProcedureOptionHelp":{"#cdata":"Indicates the method used for core marker set selection. By default, METHOD=INCR."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"INCREMENTAL|INCR","@Value2":"DECREMENTAL|DECR","@Value3":"EXHAUSTIVE|EX","@Value4":"ITERMAX|IM","@Value5":"SIMANNEAL|SA"},"ProcedureOptionToolTips":{"@ToolTip1":"The incremental search algorithm is used.","@ToolTip2":"The decremental algorithm is used.","@ToolTip3":"The exhaustive search algorithm is used.","@ToolTip4":"The iterative maximization algorithm is used.","@ToolTip5":"The simulated annealing search algorithm is used."}},{"ProcedureOptionName":"NOSUMMARY|NOSUMM","ProcedureOptionHelp":{"#cdata":"Suppresses the display of the \"Marker Summary\" table."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"SCHEDULE=","ProcedureOptionHelp":{"#cdata":"[Syntax: SCHEDULE=number] \n        \nSpecifies the number of reconfigurations used in each annealing step when METHOD=SA. \nThe value for number must be a positive integer. The default value is 100x(number of \nvariables specified in the VAR statement)."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SEED=","ProcedureOptionHelp":{"#cdata":"[Syntax: SEED=number] \n        \nSpecifies the initial seed for the random number generator used for the sampling \nof markers. The value for number must be an integer; the computer clock time is \nused if the option is omitted or an integer less than or equal to 0 is specified."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SIZE=","ProcedureOptionHelp":{"#cdata":"[Syntax: SIZE=number] \n        \nSpecifies the size of the subset of markers to select. The value for number must \nbe a positive integer that is less than or equal to the number of markers specified \nin the VAR statement. The SIZE= option must be specified for an exhaustive search, \niterative maximization search, and simulated annealing search."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"STEP=","ProcedureOptionHelp":{"#cdata":"[Syntax: STEP=number] \n        \nSpecifies the steps used for simulated annealing search when METHOD=SA. The value \nfor number must be a positive integer. The default value is 1."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"TEMPERATURE=|T=","ProcedureOptionHelp":{"#cdata":"[Syntax: TEMPERATURE=number] \n        \nSpecifies the temperature used for the simulated annealing search when METHOD=SA \nis specified. The value for number must be a positive number. The default value \nis 1."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"TFACTOR=","ProcedureOptionHelp":{"#cdata":"[Syntax: TFACTOR=number] \n        \nSpecifies the factor by which the temperature is reduced for each annealing step \nduring simulated annealing search when METHOD=SA. The value for number must satisfy  \n0 < number < 1. The default value is 0.90."},"ProcedureOptionType":"V"}]},"ProcedureStatements":[{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nYou can specify a BY statement with PROC HTSNP to obtain separate analyses on \nobservations in groups defined by the BY variables. When a BY statement appears, \nthe procedure expects the input data set to be sorted in the order of the BY \nvariables. The variables are one or more variables in the input data set."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"FREQ","StatementHelp":{"#cdata":"Syntax: FREQ variable ; \n\nThe FREQ statement identifies the variable that indicates the frequency for each \nhaplotype. If there is no FREQ statement, the frequency of each distinct haplotype \nis calculated by dividing its count by the total haplotype count. When a frequency \nvalue is missing or negative, the corresponding haplotype is ignored."},"StatementOptions":null},{"StatementName":"VAR","StatementHelp":{"#cdata":"Syntax: VAR variables ; \n\nThe VAR statement identifies the variables, one for each marker, containing the marker \nalleles that construct the haplotypes. Two or more variables must be specified."},"StatementOptions":null}]},null]}}