{"Procedure":{"Name":"ICPHREG","#comment":{},"ProductGroup":"SAS/STAT","ProcedureHelp":{"#cdata":"Syntax: PROC ICPHREG <options>; \n    BASELINE <OUT=SAS-data-set> <COVARIATES=SAS-data-set><TIMELIST=list><keyword=name …keyword=name> </ options>; \n    BY variables; \n    CLASS variable <(options)> …<variable <(options)>> </ global-options>; \n    FREQ variable </ option>; \n    HAZARDRATIO <'label'> variable </ options>; \n    MODEL (t1, t2)= effects </ options>; \n    OUTPUT <OUT=SAS-data-set> <keyword=name …keyword=name>; \n    TEST  <model-effects> </ options>; \n    STRATA variable; \n\nThe ICPHREG procedure is designed to fit proportional hazards regression models to interval-censored data. \nIt can also fit proportional hazards regression models to failure time data that are uncensored, right \ncensored, or left censored. \n\nThe ICPHREG procedure enables you to use a variety of configurations with respect to the baseline function \nto fit a proportional hazards model; these configurations include a piecewise constant model (Friedman 1982) \nand a cubic spline model (Royston and Parmar 2002). To estimate the regression coefficients and the baseline \nparameters, the ICPHREG procedure maximizes the full likelihood instead of the Cox partial likelihood. Standard\nerrors of the estimates are obtained by inverting the observed information matrix, which is derived from the \nfull likelihood. \n\nThe ICPHREG procedure also enables you to do the following: include an offset variable in the model, weight\nthe observations in the input data, test linear hypotheses about the regression coefficients, compute \ncustomized hazard ratios, and estimate and plot the survival function and the cumulative hazard function \nfor a new set of covariates. \n\nThe ICPHREG procedure uses ODS Graphics to create graphs as part of its output."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"ALPHA=","ProcedureOptionHelp":{"#cdata":"[Syntax: ALPHA=number] \n      \nSpecifies the α level for 100(1 - α)% confidence limits. The number must be between 0 and 1; \nthe default value is 0.05, which results in 95% intervals. "},"ProcedureOptionType":"V"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nNames the SAS data set that contains the data to be analyzed. If you omit this option, the procedure \nuses the most recently created SAS data set. "},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"ITHISTORY","ProcedureOptionHelp":{"#cdata":"Displays the iteration history for computing maximum likelihood estimates, the final evaluation of \nthe gradient, and the final evaluation of the negative of the second derivative matrix (that is, \nthe negative of the Hessian)."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NAMELEN=","ProcedureOptionHelp":{"#cdata":"[Syntax: NAMELEN=n] \n      \nSpecifies the maximum length of effect names in tables and output data sets to be n characters, \nwhere n is a value between 20 and 200. By default, NAMELEN=20."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NLOPTIONS","ProcedureOptionHelp":{"#cdata":"Syntax: NLOPTIONS(options) \n      \nSpecifies options for the nonlinear optimization methods if you are applying the multivariate adaptive \nregression splines algorithm to generalized linear models. You can specify the following options: \n\nABSCONV=r | ABSTOL=r -- specifies an absolute function convergence criterion by which minimization stops. \nABSFCONV=r | ABSFTOL=r -- specifies an absolute function difference convergence criterion. The default value is r=0. \nABSGCONV=r | ABSGTOL=r -- specifies an absolute gradient convergence criterion. This criterion is not used by the NMSIMP \n  technique. The default value is r = 1E–5. \nFCONV=r | FTOL=r --  specifies a relative function convergence criterion. \nGCONV=r | GTOL=r --  specifies a relative gradient convergence criterion. This criterion is not used by the NMSIMP \n  technique. The default value is r = 1E–8. \nHESSIAN=hessian-options\n  specifies the Hessian matrix type used in the optimization of likelihood functions, if the Newton-Raphson technique \n  is used. You can specify the following hessian-options: \n\n  EXPECTED -- requests that the Hessian matrix in optimization be computed as the negative of the expected information matrix. \n  OBSERVED -- requests that the Hessian matrix in optimization be computed as the negative of the observed information matrix. \n  For many specified distribution families and link functions, the observed information matrix is equal to the expected information matrix. \n\nThe default is HESSIAN=EXPECTED. \nMAXFUNC=n | MAXFU=n \n  specifies the maximum number of function calls in the optimization process. The default values are as follows, \n  depending on the optimization technique: \n    • TRUREG, NRRIDG, and NEWRAP: 125 \n    • QUANEW and DBLDOG: 500 \n    • CONGRA: 1000 \n    • NMSIMP: 3000 \n\nMAXITER=n | MAXIT=n \n  specifies the maximum number of iterations in the optimization process. The default values are as follows, \n  depending on the optimization technique: \n    • TRUREG, NRRIDG, and NEWRAP: 50 \n    • QUANEW and DBLDOG: 200 \n    • CONGRA: 400 \n    • NMSIMP: 1000 \n    \nYou can select the optimization technique by specifying the TECHNIQUE= option. \n\nMAXTIME=r\n  specifies an upper limit of r seconds of CPU time for the optimization process. T\nMINITER=n | MINIT=n \n  specifies the minimum number of iterations. The default value is 0. \nTECHNIQUE=keyword\n  specifies the optimization technique to obtain maximum likelihood estimates for nonnormal \n  distributions. You can choose from the following techniques by specifying the appropriate keyword: \n    CONGRA -- performs a conjugate-gradient optimization. \n    DBLDOG -- performs a version of double-dogleg optimization. \n    NEWRAP -- performs a Newton-Raphson optimization that combines a line-search algorithm with ridging. \n    NMSIMP -- performs a Nelder-Mead simplex optimization. \n    NONE --   performs no optimization. \n    NRRIDG -- performs a Newton-Raphson optimization with ridging. \n    QUANEW -- performs a dual quasi-Newton optimization. \n    TRUREG -- performs a trust-region optimization. \n\nThe default is TECHNIQUE=NEWRAP."},"ProcedureOptionType":"S","SubOptionsKeywords":"ABSCONV=|ABSTOL=|ABSFCONV=|ABSFTOL=|ABSGCONV=|ABSGTOL=|FCONV=|FTOL=|GCONV=|GTOL=|MAXFUNC=|MAXFU=|MAXITER=|MAXIT=|MAXTIME=|MINITER=|MINIT=|TECHNIQUE="},{"ProcedureOptionName":"NOPRINT","ProcedureOptionHelp":{"#cdata":"Suppresses all displayed output. Note that this option temporarily disables the \nOutput Delivery System (ODS)."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOTHREADS","ProcedureOptionHelp":{"#cdata":"Forces single-threaded execution of the analytic computations. This option overrides the SAS system \noption THREADS | NOTHREADS. Specifying this option is equivalent to specifying the THREADS=1 option."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"PLOTS=","ProcedureOptionHelp":{"#cdata":"Specifies plots to be created using ODS Graphics. You can request plots of survival functions and \ncumulative hazard functions. Also, many of the observation statistics in the output data set can \nbe plotted using this option. \n      \nSyntax: \n(1) PLOTS<(global-plot-options)> = plot-request \n(2) PLOTS<(global-plot-options)> = (plot-request <...<plot-request>>) \n\nThe following global-plot-options are available: \n\n  CL\n  displays the pointwise confidence limits for the plot.\n\n  OVERLAY <=BYGROUP|INDIVIDUAL> \n  specifies how to overlay the functions that are plotted for the covariate sets.\n  \n  UNPACK \n  displays multiple plots individually. \n   \n  TIMERANGE=(<min> <,max>) | RANGE=(<min> <,max>)\n  specifies the range of values on the time axis to clip the display."},"ProcedureOptionType":"S|V","ProcedureOptionValues":{"@Value1":"CUMHAZ","@Value2":"HAZARD","@Value3":"INTERVAL","@Value4":"RESDEV","@Value5":"RESLAG","@Value6":"SURVIVAL","@Value7":"NONE"},"ProcedureOptionToolTips":{"@ToolTip1":"Plots the estimated cumulative hazard function for each set of covariates in the data set that you  specify in the COVARIATES= option in the BASELINE statement. ","@ToolTip2":"Plots plots the estimated hazard function for each set of covariates in the data set that you specify  in the COVARIATES= option in the BASELINE statement.","@ToolTip3":"Plots the observed interval length as a function of observation number. ","@ToolTip4":"Syntax: RESDEV<(options)>                                 Plots deviance residuals. You can specify the following options:    INDEX    plots deviance residuals as a function of the observation number.   XBETA    plots deviance residuals as a function of the linear predictor.","@ToolTip5":"Syntax: RESLAG<(options)>                                 Plots Lagakos residuals. You can specify the following options:    INDEX    plots Lagakos residuals as a function of the observation number.   XBETA    plots Lagakos residuals as a function of the linear predictor.","@ToolTip6":"Syntax: SURVIVAL | S | SURV | SUR                                   Plots the estimated survival function for each set of covariates in the data set that is specified  in the COVARIATES= option in the BASELINE statement.","@ToolTip7":""},"SubOptionsKeywords":"CL|OVERLAY|OVERLAY=|TIMERANGE=|UNPACK|INDEX|XBETA"},{"ProcedureOptionName":"SINGULAR=|EPSILON=","ProcedureOptionHelp":{"#cdata":"[Syntax: SINGULAR=number | EPSILON=number ]\n      \nSpecifies the tolerance for testing the singularity of the Z'Z matrix that is formed from the design \nmatrix Z and for testing the singularity of the Hessian matrix upon convergence of the optimization algorithm."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"THREADS=|NTHREADS=","ProcedureOptionHelp":{"#cdata":"[Syntax: THREADS=n | NTHREADS=n]\n      \nSpecifies the number of threads for analytic computations and overrides the SAS system option THREADS | NOTHREADS. \nIf you do not specify the THREADS= option or if you specify THREADS=0, the number of threads is determined based \non the data size and the number of CPUs on the host on which the analytic computations execute."},"ProcedureOptionType":"V"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BASELINE","StatementHelp":{"#cdata":"Syntax: BASELINE  <OUT=SAS-data-set> <COVARIATES=SAS-data-set> <TIMELIST=list> <keyword=name …keyword=name> </ options>; \n         \nThe BASELINE statement creates a SAS data set (named by the OUT= option) that contains the predicted \nvalues at specified times that partition the time axis for every set of covariates in the COVARIATES= \ndata set. If the COVARIATES= data set is not specified, PROC ICPHREG uses a reference set of covariates \nthat consists of the reference levels for the CLASS variables and the average values for the continuous \nvariables."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"OUT=","StatementOptionHelp":{"#cdata":"[Syntax: OUT=SAS-data-set] \n          \nNames the output data set. If you omit the OUT= option, the data set is created and given a \ndefault name by using the DATAn convention."},"StatementOptionType":"RV|DV"},{"StatementOptionName":"COVARIATES=","StatementOptionHelp":{"#cdata":"[Syntax: COVARIATES=SAS-data-set] \n          \nNames the SAS data set that contains the sets of explanatory variable values for which the \nquantities of interest are estimated."},"StatementOptionType":"RV|DV"},{"StatementOptionName":"TIMELIST=","StatementOptionHelp":{"#cdata":"[Syntax: TIMELIST=list] \n          \nSpecifies a list of time points at which the predicted values are computed. The following specifications \nare equivalent: \n\n   timelist=5,20 to 50 by 10\n   timelist=5 20 30 40 50\n\nIf you do not specify this option, predicted values are computed at all the times that partition the time axis."},"StatementOptionType":"RV"},{"StatementOptionName":"CUMHAZ=","StatementOptionHelp":{"#cdata":"Syntax: CUMHAZ=name\n          \nSpecifies the cumulative hazard function estimate. Specifying CUMHAZ=_ALL_ is equivalent to specifying \nCUMHAZ=CumHaz, STDCUMHAZ=StdErrCumHaz, LOWERCUMHAZ=LowerCumHaz, and UPPERCUMHAZ=UpperCumHaz."},"StatementOptionType":"RV"},{"StatementOptionName":"HAZARD=","StatementOptionHelp":{"#cdata":"[Syntax: HAZARD=name}\n          \nSpecifies the hazard function estimate."},"StatementOptionType":"RV"},{"StatementOptionName":"LOGLOGS=|CLOGLOGS=","StatementOptionHelp":{"#cdata":"[Syntax: LOGLOGS=name | CLOGLOGS=name] \n          \nSpecifies the log of the negative log of the estimated survival function."},"StatementOptionType":"RV"},{"StatementOptionName":"LOGSURV=","StatementOptionHelp":{"#cdata":"[Syntax: LOGSURV=name] \n          \nSpecifies the log of SURVIVAL."},"StatementOptionType":"RV"},{"StatementOptionName":"LOWER=|L=|LOWERSDF=","StatementOptionHelp":{"#cdata":"[Syntax: LOWER=name | L=name | LOWERSDF=name] \n          \nSpecifies the lower pointwise confidence limit for the survivor function. For a Bayesian \nanalysis, this is the lower limit of the equal-tail credible interval for the survivor \nfunction. The confidence level is determined by the ALPHA= option."},"StatementOptionType":"RV"},{"StatementOptionName":"LOWERCUMHAZ=","StatementOptionHelp":{"#cdata":"[Syntax: LOWERCUMHAZ=name] \n          \nSpecifies the lower pointwise confidence limit for the cumulative hazard function. \nThe confidence level is determined by the ALPHA= option."},"StatementOptionType":"RV"},{"StatementOptionName":"STDERR=","StatementOptionHelp":{"#cdata":"[Syntax: STDERR=name] \n          \nSpecifies the standard error of the survivor function estimator."},"StatementOptionType":"RV"},{"StatementOptionName":"STDCUMHAZ=","StatementOptionHelp":{"#cdata":"[Syntax: STDCUMHAZ=name] \n          \nSpecifies the estimated standard error of the cumulative hazard function estimator."},"StatementOptionType":"RV"},{"StatementOptionName":"STDXBETA=","StatementOptionHelp":{"#cdata":"[Syntax: STDXBETA=name] \n          \nSpecifies the estimated standard error of the linear predictor estimator."},"StatementOptionType":"RV"},{"StatementOptionName":"SURVIVAL=|SDF=","StatementOptionHelp":{"#cdata":"[Syntax: SURVIVAL=name] \n          \nSpecifies a survival function estimate. Specifying SURVIVAL=_ALL_ is equivalent to specifying SURVIVAL=Survival, \nSTDERR=StdErrSurvival, LOWER=LowerSurvival, and UPPER=UpperSurvival. "},"StatementOptionType":"RV","StatementOptionValues":{"@Value1":"<name>","@Value2":"_ALL_"},"StatementOptionToolTips":{"@ToolTip1":"Replace <name> with the name of the variable for the statistic.","@ToolTip2":"Equivalent to specifying SURVIVAL=Survival, STDERR=StdErrSurvival, LOWER=LowerSurvival, and  UPPER=UpperSurvival."}},{"StatementOptionName":"UPPER=|U=|UPPERSDF=","StatementOptionHelp":{"#cdata":"[Syntax: UPPER=name | U=name | UPPERSDF=name] \n          \nSpecifies the upper pointwise confidence limit for the survival function. The confidence level is determined \nby the ALPHA= option."},"StatementOptionType":"RV"},{"StatementOptionName":"UPPERCUMHAZ=","StatementOptionHelp":{"#cdata":"[Syntax: UPPERCUMHAZ=name] \n          \nSpecifies the upper pointwise confidence limit for the cumulative hazard function. The confidence level \nis determined by the ALPHA= option. "},"StatementOptionType":"RV"},{"StatementOptionName":"XBETA=","StatementOptionHelp":{"#cdata":"[Syntax: XBETA=name] \n          \nSpecifies the estimate of the linear predictor z'β. If there is an offset, it is added to the predictor."},"StatementOptionType":"RV"},{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=value] \n          \nSpecifies the level of the confidence interval for the survival function. The value must be between 0 \nand 1. The default is the value of the ALPHA= option in the PROC ICPHREG statement, or 0.05 if that \noption is not specified."},"StatementOptionType":"V"},{"StatementOptionName":"CLTYPE=|CITYPE=|TYPE=|CLTRANSFORM=|TRANSFORM=","StatementOptionHelp":{"#cdata":"Specifies the method used to compute the confidence limits for S(t,z), the survivor \nfunction for a subject with a fixed covariate vector z at event time t."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"LOG","@Value2":"LOGLOG","@Value3":"NORMAL"},"StatementOptionToolTips":{"@ToolTip1":"Uses normal theory approximation to compute the confidence limits for log(S(t,z)).","@ToolTip2":"Uses normal theory approximation to compute the confidence limits for the log(-log(S(t,z))).","@ToolTip3":"Uses normal theory approximation to compute the confidence limits for S(t,z)."}},{"StatementOptionName":"GROUP=","StatementOptionHelp":{"#cdata":"[Syntax: GROUP=variable] \n          \nNames a variable whose values identify or group the predicted curves. The variable must be a numeric \nvariable in the COVARIATES= data set. Survival curves for observations that have the same value of the \nvariable are overlaid in the same plot."},"StatementOptionType":"V"},{"StatementOptionName":"ROWID=|ID=|ROW=","StatementOptionHelp":{"#cdata":"[Syntax: ROWID=variable | ID=variable | ROW=variable] \n          \nNames a variable in the COVARIATES= data set for identifying the baseline function \ncurves in the plots."},"StatementOptionType":"V"}],"#comment":[{},{},{}]}},{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY variables; \n\nYou can specify a BY statement with PROC ICPHREG to obtain separate analyses of observations in groups that \nare defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be \nsorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used. \n\nIf your input data set is not sorted in ascending order, use one of the following alternatives: \n\n  • Sort the data by using the SORT procedure with a similar BY statement. \n  • Specify the NOTSORTED or DESCENDING option in the BY statement for the BCHOICE procedure. The NOTSORTED \n    option does not mean that the data are unsorted but rather that the data are arranged in groups (according to values \n    of the BY variables) and that these groups are not necessarily in alphabetical or increasing numeric order. \n  • Create an index on the BY variables by using the DATASETS procedure (in Base SAS software)."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"CLASS","StatementHelp":{"#cdata":"Syntax: CLASS variable <(options)> …<variable <(options)>> </ global-options>;   \n\nThe CLASS statement names the classification variables to be used as explanatory variables in the analysis. \nResponse variables do not need to be specified in the CLASS statement."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"CPREFIX=","StatementOptionHelp":{"#cdata":"[Syntax: CPREFIX=n] \n          \nSpecifies that, at most, the first n characters of a CLASS variable name be used in creating names \nfor the corresponding design variables."},"StatementOptionType":"V"},{"StatementOptionName":"DESCENDING|DESC","StatementOptionHelp":{"#cdata":"Reverses the sort order of the classification variable. If both the DESCENDING and ORDER= options \nare specified, PROC ICPHREG orders the categories according to the ORDER= option and then reverses \nthat order."},"StatementOptionType":"S"},{"StatementOptionName":"LPREFIX=","StatementOptionHelp":{"#cdata":"[Syntax: LPREFIX=n] \n          \nSpecifies that, at most, the first n characters of a CLASS variable name be used in creating labels \nfor the corresponding design variables."},"StatementOptionType":"V"},{"StatementOptionName":"MISSING","StatementOptionHelp":{"#cdata":"Treats missing value (\".\", \".A\", ..., \".Z\" for numeric variables and blanks for \ncharacter variables) as valid values for the CLASS variable."},"StatementOptionType":"S"},{"StatementOptionName":"ORDER=","StatementOptionHelp":{"#cdata":"Specifies the sort order for the levels of classification variables."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"DATA","@Value2":"FORMATTED","@Value3":"FREQ","@Value4":"INTERNAL"},"StatementOptionToolTips":{"@ToolTip1":"Levels sorted by the order of appearance in the input data set.","@ToolTip2":"Levels sorted by the external formatted values, except for numeric variables with  no explicit format, which are sorted by their unformatted (internal) values.","@ToolTip3":"Levels sorted by the descending frequency count; levels with more observations  come earlier in the order.","@ToolTip4":"Levels sorted by the unformatted value."}},{"StatementOptionName":"PARAM=","StatementOptionHelp":{"#cdata":"Specifies the parameterization method for the classification variable or variables."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"EFFECT","@Value2":"GLM","@Value3":"ORDINAL|THERMOMETER","@Value4":"POLYNOMIAL|POLY","@Value5":"REFERENCE|REF","@Value6":"ORTHEFFECT","@Value7":"ORTHORDINAL","@Value8":"ORTHPOLY","@Value9":"ORTHREF"},"StatementOptionToolTips":{"@ToolTip1":"Specifies effect coding.","@ToolTip2":"Specifies less-than-full-rank, reference-cell coding; this option can be used only as a global option.","@ToolTip3":"Specifies the cumulative parameterization for an ordinal CLASS variable.","@ToolTip4":"Specifies polynomial coding.","@ToolTip5":"Specifies reference cell coding.","@ToolTip6":"Orthogonalizes PARAM=EFFECT.","@ToolTip7":"Orthogonalizes PARAM=ORDINAL.","@ToolTip8":"Orthogonalizes PARAM=POLYNOMIAL.","@ToolTip9":"Orthogonalizes PARAM=REFERENCE."}},{"StatementOptionName":"REF=","StatementOptionHelp":{"#cdata":"Specifies the reference level for PARAM=EFFECT, PARAM=REFERENCE, and their orthogonalizations."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"<level>","@Value2":"FIRST","@Value3":"LAST"},"StatementOptionToolTips":{"@ToolTip1":"Specifies the level of the variable to use as the reference level. Replace <level> with an actual value.","@ToolTip2":"Designates the first ordered level as reference.","@ToolTip3":"Designates the last ordered level as reference."}},{"StatementOptionName":"TRUNCATE","StatementOptionHelp":{"#cdata":"Syntax: TRUNCATE<=n> \n          \nSpecifies that length n of CLASS variable values to use in determining CLASS variable levels. \nThe default is to use the full formatted length of the CLASS variable. If you specify TRUNCATE \nwithout the length n, the first 16 characters of the formatted values are used."},"StatementOptionType":"S|V"}]}},{"StatementName":"FREQ","StatementHelp":{"#cdata":"Syntax: FREQ variable </ option>; \n      \nThe FREQ statement identifies the variable (in the input data set) that contains the frequency of \noccurrence of each observation. PROC ICPHREG treats each observation as if it appears n times, \nwhere n is the value of the FREQ variable for the observation. If the frequency value is not an \ninteger, it is truncated to an integer.  If the frequency value is missing, the observation is \nnot used in the estimation of the regression coefficients."},"StatementOptions":{"StatementOption":{"StatementOptionName":"NOTRUNCATE|NOTRUNC","StatementOptionHelp":{"#cdata":"Specifies that frequency values are not truncated to integers."},"StatementOptionType":"S"}}},{"StatementName":"HAZARDRATIO","StatementHelp":{"#cdata":"Syntax: HAZARDRATIO <'label'> variable </ options> ; \n      \nThe HAZARDRATIO statement enables you to request hazard ratios for any variable in the model \nat customized settings."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=number] \n          \nSpecifies the alpha level of the interval estimates for the hazard ratios. The value must be \nbetween 0 and 1. The default is the value of the ALPHA= option in the PROC ICPHREG statement, \nor 0.05 if that option is not specified."},"StatementOptionType":"V"},{"StatementOptionName":"AT","StatementOptionHelp":{"#cdata":"Syntax: AT (variable=ALL | REF | list <...variable=ALL | REF| list> ) \n          \nSpecifies the variables that interact with the variable of interest and the corresponding values \nof the interacting variables. If the interacting variable is continuous and a numeric list is specified \nafter the equal sign, hazard ratios are computed for each value in the list. If the interacting variable \nis a CLASS variable, you can specify, after the equal sign, a list of quoted strings corresponding to \nvarious levels of the CLASS variable, or you can specify the keyword ALL or REF. Hazard ratios are \ncomputed at each value of the list if the list is specified, or at each level of the interacting \nvariable if you specify ALL, or at the reference level of the interacting variable if you specify REF."},"StatementOptionType":"S"},{"StatementOptionName":"DIFF=","StatementOptionHelp":{"#cdata":"Specifies which differences to consider for the level comparisons of a CLASS variable. The default is DIFF=ALL."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"DISTINCT","@Value2":"PAIRWISE ","@Value3":"REFERENCE"},"StatementOptionToolTips":{"@ToolTip1":"Requests all comparisons of only the distinct combinations of pairs. ","@ToolTip2":"Requestsall possible pairwise comparisons of levels.","@ToolTip3":"Requests comparisons between the reference level and all other levels of the CLASS variable."}},{"StatementOptionName":"E","StatementOptionHelp":{"#cdata":"Displays the vector h of linear coefficients such that h'β is the log-hazard ratio, with β being the \nvector of regression coefficients."},"StatementOptionType":"S"},{"StatementOptionName":"UNITS=","StatementOptionHelp":{"#cdata":"[Syntax: UNITS=value] \n          \nSpecifies the units of change in the continuous explanatory variable for which the customized hazard \nratio is estimated. By default, UNITS=1. This option is ignored in the computation of the hazard ratios \nfor a CLASS variable."},"StatementOptionType":"V"}]}},{"StatementName":"MODEL","StatementHelp":{"#cdata":"Syntax: MODEL (t1, t2)= effects </ options>;    \n\nThe MODEL statement identifies the variables to be used as the failure-time variables and the explanatory \neffects, including covariates, main effects, interactions, nested effects."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=value] \n          \nSpecifies the level for the confidence intervals for   parameters. The value must be between 0 and 1. \nBy default, ALPHA=0.05."},"StatementOptionType":"V"},{"StatementOptionName":"CORRB","StatementOptionHelp":{"#cdata":"Displays the estimated correlation matrix of the parameter estimates."},"StatementOptionType":"S"},{"StatementOptionName":"COVB","StatementOptionHelp":{"#cdata":"Displays the estimated covariance matrix of the parameter estimates."},"StatementOptionType":"S"},{"StatementOptionName":"BASEHAZ=|BASE=|B=","StatementOptionHelp":{"#cdata":"Syntax: BASE=baseline-type | BASEHAZ=baseline-type | B=baseline-type  \n          \nSpecifies a functional form for the baseline function."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"PCH","@Value2":"SPLINES"},"StatementOptionToolTips":{"@ToolTip1":"Syntax: PCH|PIECEWISE|PIECEWISEEXPONENTIAL|PCBH (<NINTERVAL=number>, <INTERVALS=(numeric-list)>)    Partitions the time scale into disjoint intervals and assumes the baseline hazard function is piecewise  constant within intervals. You can specify one of the following two options to control how to partition  the time axis into intervals of constant baseline hazards:     NINTERVAL=number |  N=number       specifies the number of intervals that have a constant hazard rate in each interval.   INTERVALS=(numeric-list) | INTERVAL=(numeric-list)       specifies a list of numbers that partition the time axis into disjoint intervals that have constant      hazard rate in each interval.","@ToolTip2":"Syntax: SPLINES (<DF=number>) |CUBICSPLINES (<DF=number>)                                       Models the baseline cumulative hazard function by cubic splines (Royston and Parmar 2002). The parameters  are the spline coefficients and are named Coef1, Coef2, ..., and so on.   You can specify the degrees of freedom in the DF=number option, where number must be an integer."},"SubOptionsKeywords":"NINTERVAL=|N=|INTERVALS=|INTERVAL=|DF="},{"StatementOptionName":"ENTRYTIME=|ENTRY=","StatementOptionHelp":{"#cdata":"[Syntax: ENTRYTIME=variable] \n          \nSpecifies the name of the variable that represents the left truncation time."},"StatementOptionType":"V"},{"StatementOptionName":"NOPOLISH","StatementOptionHelp":{"#cdata":"Suppresses polishing of parameter estimates of the baseline function. Occasionally, the parameter \nestimates of the baseline function can reach the default optimization lower bounds. This might \nindicate that the model is overparameterized. By default, the ICPHREG procedure \"polishes\" the \nhazard estimates by fixing these parameters at the lower bound value and refitting the model."},"StatementOptionType":"S"},{"StatementOptionName":"OFFSET=","StatementOptionHelp":{"#cdata":"[Syntax: OFFSET=name] \n    \nSpecifies the name of an offset variable, which is an explanatory variable with a regression \ncoefficient fixed as one."},"StatementOptionType":"V"},{"StatementOptionName":"HAZSCALE=","StatementOptionHelp":{"#cdata":"Syntax: HAZSCALE=hazard-type \n          \nSpecifies a transformation to be applied to the baseline parameters for fitting the piecewise constant model.\n\nThis option does not apply to the cubic spline model."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"LOGHAZARD","@Value2":"HAZARD"},"StatementOptionToolTips":{"@ToolTip1":"Syntax: LOGHAZARD | LOGHAZ | LOG                                     Uses the log transformed baseline parameters.","@ToolTip2":"Syntax: HAZARD | HAZ                                     Does not transform the baseline parameters. A lower bound of 0 is used for fitting the models."}}]}},{"StatementName":"OUTPUT","StatementHelp":{"#cdata":"Syntax: OUTPUT <OUT=SAS-data-set> <keyword=name …keyword=name>; \n\nThe OUTPUT statement creates a new SAS data set that contains all the variables in the input data set and, \noptionally, contains the estimated linear predictors (XBETA) and their standard error estimates, residuals, \nand diagnostic statistics.\n\nThe OUTPUT statement is not available when you specify the STRATA statement or the ENTRY= option in the \nMODEL statement."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"OUT=","StatementOptionHelp":{"#cdata":"[Syntax: OUT=SAS-data-set] \n          \nSpecifies the output data set. If you omit the OUT= option, the output data set is created and given \na default name by using the DATAn convention."},"StatementOptionType":"RV"},{"StatementOptionName":"INTERVAL=","StatementOptionHelp":{"#cdata":"Represents the interval length for the input observation. The value is missing if the observation \nis right-censored or missing."},"StatementOptionType":"RV"},{"StatementOptionName":"RESDEV=","StatementOptionHelp":{"#cdata":"Represents the deviance residual for identifying poorly fitted observations."},"StatementOptionType":"RV"},{"StatementOptionName":"RESLAG=","StatementOptionHelp":{"#cdata":"Represents the Lagakos residual for identifying poorly fitted observations."},"StatementOptionType":"RV"},{"StatementOptionName":"STDXBETA=","StatementOptionHelp":{"#cdata":"Represents the standard error estimate of XBETA (see the XBETA keyword). "},"StatementOptionType":"RV"},{"StatementOptionName":"XBETA=","StatementOptionHelp":{"#cdata":"Represents the estimate of the linear, x_i'β, for observation i."},"StatementOptionType":"RV"}]}},{"StatementName":"STRATA","StatementHelp":{"#cdata":"Syntax: STRATA variable </ option>;\n      \nThe proportional hazards assumption might not be realistic for all data. However, it might still be \nreasonable to perform a stratified analysis. The STRATA statement names the variables that determine \nthe stratification. Strata are formed according to the nonmissing values of the STRATA variables \nunless the MISSING option is specified. In the STRATA statement, variable is a variable whose values \nare used to determine the strata levels. Multiple variables can appear in the STRATA statement."},"StatementOptions":{"StatementOption":{"StatementOptionName":"MISSING","StatementOptionHelp":{"#cdata":"Allows missing values ('.','.A',...,'.Z' for numeric variables and blanks for character variables) \nas valid STRATA variable values. Otherwise, observations that have missing STRATA variable values \nare deleted from the analysis. "},"StatementOptionType":"S"}}},{"StatementName":"TEST","StatementHelp":{"#cdata":"Syntax: TEST <model-effects> </ options>; \n\nThe TEST statement enables you to perform Wald tests for model effects that test Type I, Type II, \nor Type III hypotheses."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"E","StatementOptionHelp":{"#cdata":"Requests that Type I, Type II, and Type III L matrix coefficients be displayed for all relevant effects "},"StatementOptionType":"S"},{"StatementOptionName":"E1|EI","StatementOptionHelp":{"#cdata":"Requests that Type I L matrix coefficients be displayed for all relevant effects. "},"StatementOptionType":"S"},{"StatementOptionName":"E2|EII","StatementOptionHelp":{"#cdata":"Requests that Type II L matrix coefficients be displayed for all relevant effects."},"StatementOptionType":"S"},{"StatementOptionName":"E3|EIII","StatementOptionHelp":{"#cdata":"Requests that Type III L matrix coefficients be displayed for all relevant effects."},"StatementOptionType":"S"},{"StatementOptionName":"HTYPE=","StatementOptionHelp":{"#cdata":"Syntax: HTYPE=value-list \n          \nIndicates the type of hypothesis test to perform on the fixed effects. Valid entries for values in the \nvalue-list are 1, 2, and 3, which correspond to Type I, Type II, and Type III tests, respectively. The \ndefault value is 3."},"StatementOptionType":"V"},{"StatementOptionName":"INTERCEPT|INT","StatementOptionHelp":{"#cdata":"Adds a row to the tables for Type I, II, and III tests that correspond to the overall intercept."},"StatementOptionType":"S"}]}}]}}}