{"Procedure":{"Name":"INBREED","ProductGroup":"SAS/GENETICS","ProcedureHelp":{"#cdata":"Syntax: PROC INBREED <options> ; \n    BY variables ; \n    CLASS variable ; \n    GENDER variable ; \n    MATINGS individual-list1 / mate-list1 <,..., individual-listn / mate-listn> ; \n    VAR variables ; \n\n\nThe INBREED procedure calculates the covariance or inbreeding coefficients for a pedigree. \nPROC INBREED is unique in that it handles very large populations. \n\nThe INBREED procedure has two modes of operation. One mode carries out analysis on the \nassumption that all the individuals belong to the same generation. The other mode divides \nthe population into nonoverlapping generations and analyzes each generation separately, \nassuming that the parents of individuals in the current generation are defined in the \nprevious generation. \n\nPROC INBREED also computes averages of the covariance or inbreeding coefficients within \nsex categories if the sex of individuals is known."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"AVERAGE|A","ProcedureOptionHelp":{"#cdata":"Produces a table of averages of coefficients for each pedigree of offspring. The AVERAGE option is used \ntogether with the GENDER statement to average the inbreeding/covariance coefficients within sex \ncategories."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"COVAR|C","ProcedureOptionHelp":{"#cdata":"Specifies that all coefficients output consist of covariance coefficients rather than inbreeding coefficients."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA= SAS-data-set] \n      \nNames the SAS data set to be used by PROC INBREED. If you omit the DATA= option,\nthe most recently created SAS data set is used."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"IND|I","ProcedureOptionHelp":{"#cdata":"Displays the individuals’ inbreeding coefficients (diagonal of the inbreeding coefficients matrix) for \neach pedigree of offspring. If you also specify the COVAR option, the individuals’ covariance \ncoefficients (diagonal of the covariance coefficients matrix) are displayed."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"INDL","ProcedureOptionHelp":{"#cdata":"Displays individuals’ coefficients for only the last generation of a multiparous population."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"INIT=","ProcedureOptionHelp":{"#cdata":"[Syntax: INIT= cov] \n      \nSpecifies the covariance value cov if any of the parents are unknown; a value of 0 \nis assumed if you do not specify the INIT= option."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"MATRIX|M","ProcedureOptionHelp":{"#cdata":"Displays the inbreeding coefficient matrix for each pedigree of offspring. If you also specify the COVAR \noption, the covariance matrices are displayed instead of inbreeding coefficients matrices."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"MATRIXL","ProcedureOptionHelp":{"#cdata":"Displays coefficients for only the last generation of a multiparous population."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOPRINT","ProcedureOptionHelp":{"#cdata":"Suppresses the display of all output."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"OUTCOV=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUTCOV= SAS-data-set] \n      \nNames an output data set to contain the inbreeding coefficients."},"ProcedureOptionType":"DV"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nYou can specify a BY statement with PROC INBREED to obtain separate analyses on \nobservations in groups defined by the BY variables. When a BY statement appears, \nthe procedure expects the input data set to be sorted in order of the BY variables."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"CLASS","StatementHelp":{"#cdata":"Syntax: CLASS variable ; \n      \nTo analyze the population within nonoverlapping generations, you must specify the \nvariable that identifies generations in a CLASS statement."},"StatementOptions":null},{"StatementName":"GENDER","StatementHelp":{"#cdata":"Syntax: GENDER variable ;\n      \nThe GENDER statement specifies a variable that indicates the sex of the individuals. \nValues of the sex variable must be character beginning with ‘M’ or ‘F’, for male or \nfemale."},"StatementOptions":null},{"StatementName":"MATINGS","StatementHelp":{"#cdata":"Syntax: MATINGS individual-list1 / mate-list1 <,..., individual-listn / mate-listn> ; \n      \nYou can specify the MATINGS statement with PROC INBREED to specify selected matings \nof individuals."},"StatementOptions":null},{"StatementName":"VAR|VARIABLES","StatementHelp":{"#cdata":"Syntax: VAR individual parent1 parent2 <covariance> ; \n      \nThe VAR statement specifies three or four variables: the first variable contains an \nindividual’s name, the second variable contains the name of the individual’s first \nparent, and the third variable contains the name of the individual’s second parent."},"StatementOptions":null}]}}}