{"Procedure":{"Name":"ISHIKAWA","ProductGroup":"SAS/QC","ProcedureHelp":{"#cdata":"Syntax: PROC ISHIKAWA options ;\n  \nThe Ishikawa diagram, also known as a cause-and-effect diagram or fishbone diagram, \nis one of the seven basic tools for quality improvement in Japanese industry. It is \nused to display the factors that affect a particular quality characteristic or problem. \n\nAn Ishikawa diagram is typically the result of a brainstorming session to improve a \nproduct, process, or service. The main goal is represented by a main arrow or trunk, \nand primary factors are represented as sub-arrows or branches. Secondary factors are \nthen added as stems, tertiary factors as leaves, and so on."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nIdentifies the name of a SAS data set that specifies an existing Ishikawa diagram. \nBy default, the procedure will prompt you to edit an existing Ishikawa diagram or \nstart a new one. When you specify the DATA= option, the procedure bypasses this \ninitial menu."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NEW","ProcedureOptionHelp":{"#cdata":"Starts a new Ishikawa diagram. By default, the procedure will prompt you to edit an existing \nIshikawa diagram or start a new one. When you specify the NEW option, the procedure bypasses \nthis initial menu and starts with a new diagram. Do not specify any other options when using \nthe NEW option."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOFS","ProcedureOptionHelp":{"#cdata":"Allows you to create hard copies of Ishikawa diagrams saved as SAS data sets without invoking \nthe interactive features of the procedure. You must specify the DATA= option when you use the \nNOFS option."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NAME=","ProcedureOptionHelp":{"#cdata":"[Syntax: NAME='name'] \n      \n(No description available)"},"ProcedureOptionType":"V"},{"ProcedureOptionName":"DESCRIPTION=","ProcedureOptionHelp":{"#cdata":"[Syntax: DESCRIPTION='description'] \n      \n(No description available)"},"ProcedureOptionType":"V"}]},"ProcedureStatements":null}}