{"Procedure":{"Name":"LATTICE","ProductGroup":"SAS/STAT","ProcedureHelp":{"#cdata":"Syntax: PROC LATTICE <options> ; \n    BY variables ; \n    VAR variables \n\nThe LATTICE procedure computes the analysis of variance and analysis of simple covariance \nfor data from an experiment with a lattice design. PROC LATTICE analyzes balanced square \nlattices, partially balanced square lattices, and some rectangular lattices. \n\nIn balanced square lattices, the number of treatments is equal to the square of the number \nof units per block. Incomplete blocks are grouped to form mutually orthogonal replications. \nThe number of replicates in the basic plan is always 1 plus the number of units per block. \n\nPartially balanced square lattices are similar to balanced lattices, although the number of \nreplicates can vary. Partially balanced designs are constructed of the replicates in the basic \nplan, but not all replicates are included the same number of times, and some might not be \nincluded at all. \n\nIn rectangular lattices, there are k units per block and k (k +1) treatments. As in square \nlattices, blocks are grouped to form mutually orthogonal replicates in the basic plan. PROC \nLATTICE can analyze simple rectangular lattices (two orthogonal replications) and triple \nrectangular lattices (three orthogonal replications). The experiment can include several \nrepetitions of the basic plan. \n\nThe LATTICE procedure determines from the data set which type of design has been used. It \nalso checks to see whether the design is valid and displays an appropriate message if it \nis not."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nNames the SAS data set to be used by PROC LATTICE. If you omit the DATA= option, \nthe most recently created SAS data set is used."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"COVARIANCE|COV","ProcedureOptionHelp":{"#cdata":"Calculates sums of products for every possible pair of response variables."},"ProcedureOptionType":"S"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nObtains separate analyses on observations in groups defined by the BY variables."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that immediately \nfollows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"VAR","StatementHelp":{"#cdata":"Syntax: VAR variables ; \n      \nThe VAR statement specifies the response variables. If you do not include a VAR statement, \nall numeric variables in the data set are considered response variables (except Group, Block, \nTreatmnt, and Rep)."},"StatementOptions":null}]}}}