{"Procedure":{"Name":"LIFETEST","#comment":{},"ProductGroup":"SAS/STAT","ProcedureHelp":{"#cdata":"Syntax: PROC LIFETEST <options> ; \n    BY variables ; \n    FREQ variable ; \n    ID variables ; \n    STRATA variable <(list)> <...variable <(list)>> </options> ; \n    TEST variables ; \n    TIME variable <*censor(list)> ; \n    WEIGHT variable ;\n\nThe LIFETEST procedure deals with lifetime or survival data analysis. \n\nA common feature of lifetime or survival data is the presence of right-censored observations \ndue either to withdrawal of experimental units or to termination of the experiment. For such \nobservations, you know only that the lifetime exceeded a given value; the exact lifetime remains\nunknown. Such data cannot be analyzed by ignoring the censored observations because, among other \nconsiderations, the longer-lived units are generally more likely to be censored. The analysis \nmethodology must correctly use the censored observations as well as the uncensored observations."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"ALPHA=","ProcedureOptionHelp":{"#cdata":"[Syntax: ALPHA=α] \n      \nSpecifies the level of significance, α, for the 100(1 - α)% confidence intervals \nfor the survivor, hazard, and density functions. For example, the option ALPHA=0.05 \nrequests the 95% confidence limits for the survivor function. The default value \nis 0.05."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"ALPHAQT=","ProcedureOptionHelp":{"#cdata":"[Syntax: ALPHA=α] \n      \nSpecifies the significance level, α, for the 100(1 - α)% confidence intervals for \nthe quartiles of the survival time. For example, the option ALPHAQT=0.05 requests \na 95% confidence interval for the quartiles of the survival time. The default value \nis 0.05."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"ATRISK","ProcedureOptionHelp":{"#cdata":"Adds a column that represents the number of subjects at risk to the survival estimate table. Also added \nis a column that represents the number of events at each observed time. This option has no effect for \nthe life-table method."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"BANDMAXTIME=|BANDMAX=","ProcedureOptionHelp":{"#cdata":"[Syntax: BANDMAXTIME=value] \n      \nSpecifies the maximum time for the confidence bands. The default is the largest \nobserved event time. If the specified BANDMAX= time exceeds the largest observed \nevent time, it is truncated to the largest observed event time."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"BANDMINTIME=|BANDMIN=","ProcedureOptionHelp":{"#cdata":"[Syntax: BANDMAXTIME=value] \n      \nSpecifies the minimum time for the confidence bands. The default is the smallest \nobserved event time. For the equal-precision band, if the BANDMIN= value is less \nthan the smallest observed event time, it is defaulted to the smallest observed \nevent time."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"CIFVAR","ProcedureOptionHelp":{"#cdata":"Displays the variance of the cumulative incidence function (CIF) estimator for competing-risks data. \nBy default, PROC LIFETEST displays the standard error of the CIF estimator."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"CONFBAND=","ProcedureOptionHelp":{"#cdata":"Specifies the confidence bands to be output to the OUTSURV= data set. Confidence bands are \navailable only for the product-limit method."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"ALL","@Value2":"EP","@Value3":"HW"},"ProcedureOptionToolTips":{"@ToolTip1":"Outputs both the Hall-Wellner and the equal-precision confidence bands.","@ToolTip2":"Outputs the equal-precision confidence bands.","@ToolTip3":"Outputs the Hall-Wellner confidence bands."}},{"ProcedureOptionName":"CONFTYPE=","ProcedureOptionHelp":{"#cdata":"Specifies the transformation applied to S(t) to obtain the pointwise confidence \nintervals and the confidence bands for the survivor function as well as the \nconfidence intervals for the quartiles of the survival times."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"ASINSQRT","@Value2":"LOGLOG","@Value3":"LINEAR","@Value4":"LOG","@Value5":"LOGIT"},"ProcedureOptionToolTips":{"@ToolTip1":"The arcsine-square root transformation","@ToolTip2":"The log-log transformation","@ToolTip3":"The identity transformation","@ToolTip4":"The logarithmic transformation","@ToolTip5":"The logit transformation"}},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nNames the SAS data set used by PROC LIFETEST. By default, the most recently \ncreated SAS data set is used."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"ERROR=","ProcedureOptionHelp":{"#cdata":"[Syntax: ERROR=AALEN | DELTA ]\n      \nSpecifies the method of calculating the variance of the CIF estimator. By default, ERROR=AALEN."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"AALEN","@Value2":"DELTA"},"ProcedureOptionToolTips":{"@ToolTip1":"When ERROR=AALEN, the variance estimator is based on the theory of counting process (Aalen 1978).","@ToolTip2":"When ERROR=DELTA, the delta method is used to compute the variance."}},{"ProcedureOptionName":"INTERVALS=","ProcedureOptionHelp":{"#cdata":"[Syntax: INTERVALS=values] \n      \nSpecifies a list of interval endpoints for the life-table method. These endpoints \nmust all be nonnegative numbers. The initial interval is assumed to start at zero \nwhether or not zero is specified in the list. Examples:\n\nlist separated by blanks:   intervals=1 3 5 7 \nlist separated by commas:   intervals=1,3,5,7 \nx to y:   intervals=1 to 7 \nx to y by z:   intervals=1 to 7 by 1 \ncombination of the above:   intervals=1,3 to 5,7"},"ProcedureOptionType":"V"},{"ProcedureOptionName":"MAXTIME=","ProcedureOptionHelp":{"#cdata":"[Syntax: MAXTIME=value] \n      \nSpecifies the maximum value of the time variable allowed on the plots so that \noutlying points do not determine the scale of the time axis of the plots."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"METHOD=","ProcedureOptionHelp":{"#cdata":"Specifies the method used to compute the survival function estimates."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"BRESLOW","@Value2":"FH","@Value3":"KM|PL","@Value4":"ACT|LIFE|LT"},"ProcedureOptionToolTips":{"@ToolTip1":"Specifies that the Breslow estimates be computed. The Breslow estimator is the  exponentiation of the negative Nelson-Aalen estimator of the cumulative hazard  function.","@ToolTip2":"Specifies that the Fleming-Harrington (FH) estimates be computed. The FH estimator  is a tie-breaking modification of the Breslow estimator. If there are no tied event  times, this estimator is the same as the Breslow estimator.","@ToolTip3":"Specifies that Kaplan-Meier estimates (also known as the product-limit estimates) be computed.","@ToolTip4":"Specifies that life-table estimates (also known as actuarial estimates) be computed."}},{"ProcedureOptionName":"MISSING","ProcedureOptionHelp":{"#cdata":"Allows missing values for numeric variables and blank values for character variables as valid \nstratum levels."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NELSON|AALEN","ProcedureOptionHelp":{"#cdata":"Produces the Nelson-Aalen estimates of the cumulative hazards and the corresponding standard errors. \nThis option is ignored unless METHOD=PL."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NINTERVAL=","ProcedureOptionHelp":{"#cdata":"[Syntax: NINTERVAL=value] \n      \nSpecifies the number of intervals used to compute the life-table estimates \nof the survivor function."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NOLEFT","ProcedureOptionHelp":{"#cdata":"Suppresses the Number Left and Number Event columns in the survival estimate table. This option has \nno effect for the life-table estimate."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOPRINT","ProcedureOptionHelp":{"#cdata":"Suppresses the display of output. This option is useful when only an output data set is needed."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOTABLE","ProcedureOptionHelp":{"#cdata":"Suppresses the display of survival function estimates. Only the number of censored and event times, \nplots, and test results is displayed."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"OUTCIF=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUTCIF=SAS-data-set] \n      \nCreates an output SAS data set to contain the point and interval estimates for the cumulative incidence \nfunction (CIF). The data set also contains the number of subjects at risk, the number of events of interest, \nand the number of events of all types."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"OUTSURV=|OUTS=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUTSURV=SAS-data-set] \n      \nCreates an output SAS data set to contain the estimates of the survival function \nand corresponding confidence limits for all strata."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"OUTTEST=|OUTT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUTTEST=SAS-data-set] \n      \nCreates an output SAS data set to contain the overall chi-square test statistic \nfor association with failure time for the variables in the TEST statement, the \nvalues of the univariate rank test statistics for each variable in the TEST statement, \nand the estimated covariance matrix of the univariate rank test statistics."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"PLOTS=","ProcedureOptionHelp":{"#cdata":"[Syntax: PLOTS<(global-plot-options)>=plot-request <(options)> ] \n      \nControls the line printer plots produced. You must also specify the LINEPRINTER option \nto obtain line printer plots.\n\nYou can specify the following global-plot-option: \n\n ONLY \n  specifies that only the specified plots in the list be produced; otherwise, the default survivor function \n  plot is also displayed. This option has no effect if you use the FAILCODE option in the TIME statement to \n  stipulate a competing-risks analysis. \n"},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"ALL","@Value2":"CIF","@Value3":"HAZARD","@Value4":"LOGSURV","@Value5":"LOGLOGS","@Value6":"PDF","@Value7":"SURVIVAL","@Value8":"NONE"},"ProcedureOptionToolTips":{"@ToolTip1":"Produces all appropriate plots.","@ToolTip2":"Syntax: CIF<(cif-options)>                                 Plots the cumulative incidence function (CIF) estimates.   You can specify the following cif-options:   CL - displays pointwise confidence limits for CIF.   TEST - displays the p-value of Gray’s test (Gray 1988) for testing the homogeneity of CIFs.","@ToolTip3":"Syntax: HAZARD <(hazard-options)>                                  Plots the estimated hazard functions. Kernel-smoothed estimates are produced for the product-limit  method. The following hazard-options can be specified for the product-limit method, but only the  CL option can be used for the life-table method.  BANDWIDTH=bandwidth-option | BW=bandwidth-option  specifies what bandwidth is chosen for the kernel-smoothing and how it is chosen.  You can specify one of the following bandwidth-options.       value -- sets the bandwidth to the given value.       numeric-list --  selects the bandwidth from the given numeric-list that minimizes the mean integrated squared error.       RANGE(lower,upper) -- selects the bandwidth from the interval (lower, upper) that minimizes the mean integrated squared error.      GRIDL=number -- specifies the lower grid limit for the kernel-smoothed estimate. The default value is the time origin.   GRIDU=number -- specifies the upper grid limit for the kernel-smoothed estimate. The default value equals the maximum event time   KERNEL=kernel-option -- specifies the kernel used. The choices are as follows:       BIWEIGHT | BW      EPANECHNIKOV | E      UNIFORM | U       NMINGRID=number  specifies the number of grid points in determining the mean integrated square error (MISE). The default value is 51.   NGRID=number -- specifies the number of grid points. The default is 101.   CL -- displays the pointwise confidence limits for the smoothed hazard.","@ToolTip4":"Plots the negative log of estimated survivor functions versus time.","@ToolTip5":"Plots the log of negative log of estimated survivor functions versus the log of time. ","@ToolTip6":"Syntax: PDF <(CL)>                                  Plots the estimated probability density functions (life-table method only). Pointwise confidence  limits are displayed optionally by specifying the CL option.","@ToolTip7":"Syntax: SURVIVAL <(survival-options)>                                  Plots the estimated survivor functions. You can customized the display by using the following survival-options.   ATRISK <(options)> <= number-list>  displays the numbers of subjects at risk at the given times.   The following options can be specified:     ATRISKTICK | ATRISKLABEL      shows the time values at which the numbers of subjects at risk are displayed.    MAXLEN=n     specifies the number of characters n that are allowed for displaying the stratum labels.    OUTSIDE<(p)>     specifies that the at-risk table be drawn outside the plot area.  The number-list identifies the times at which the numbers at risk are displayed.  CB <=keyword> displays the confidence bands (that is, simulataneous confidence intervals) for the survivor functions.  You can specify one of the following keywords. The default is CB=HW.       ALL -- displays both the equal-precision and the Hall-Wellner bands.      EP -- displays the equal-precision band.     HW -- displays the Hall-Wellner confidence band.   CL -- displays the pointwise confidence limits for the survivor functions.   FAILURE | F -- changes all the displays for survivor functions to those for the failure functions.  NOCENSOR -- suppresses plotting the censored times on the product-limit survival curves (product-limit method only).   STRATA=strata-option  specifies how to display the survival/failure curves for multiple strata. You can choose one of the following strata options:       INDIVIDUAL UNPACK -- specifies that a separate plot be displayed for each stratum.       OVERLAY -- specifies that the survival/failure curves for the strata be overlaid in one plot.       PANEL -- specifies that separate plots for the strata be organized into panels of two or four plots,      depending on the number of strata. The default is STRATA=OVERLAY.   TEST -- displays the p-value of a homogeneity test specified in the STRATA statement.","@ToolTip8":"Suppresses all plots."},"SubOptionsKeywords":"\n        |INDIVIDUAL|UNPACK|OVERLAY|PANEL|NOCENSOR|FAILURE|F|CL|ALL|EP|HW|CB|ATRISK|NGRID=|NMINGRID=|\n        |BIWEIGHT|BW|EPANECHNIKOV|E|UNIFORM|U|KERNEL=|GRIDU=|GRIDL=|RANGE|BANDWIDTH=|BW=|TEST|\n        |ATRISKTICK|ATRISKLABEL|MAXLEN=|OUTSIDE|\n      "},{"ProcedureOptionName":"REDUCEOUT","ProcedureOptionHelp":{"#cdata":"Specifies that the OUTSURV= data set contain only those observations that are included in the\nINTERVALS= or TIMELIST= option."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"SINGULAR=","ProcedureOptionHelp":{"#cdata":"[Syntax: SINGULAR=value] \n      \nSpecifies the tolerance for testing singularity of the covariance matrix for the \nrank test statistics."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"STDERR","ProcedureOptionHelp":{"#cdata":"Specifies that the standard error of the survivor function (SDF_STDERR) be output to the OUTSURV= \ndata set."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"TIMELIM=","ProcedureOptionHelp":{"#cdata":"Specifies the time limit used in the estimation of the mean survival time and its standard error."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"EVENT","@Value2":"OBSERVED","@Value3":"<number>"},"ProcedureOptionToolTips":{"@ToolTip1":"Specifies that the time limit L be the largest event time in the data. TIMELIM=EVENT is the default.","@ToolTip2":"Specifies that the time limit L be the largest observed time in the data.","@ToolTip3":"Specifies that the time limit L be the given number. The number must be positive and at least as large  as the largest event time in the data."}},{"ProcedureOptionName":"TIMELIST=","ProcedureOptionHelp":{"#cdata":"[Syntax: TIMELIST=number-list] \n      \nSpecifies a list of time points at which the Kaplan-Meier estimates are displayed."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"WIDTH=","ProcedureOptionHelp":{"#cdata":"[Syntax: WIDTH=value] \n      \nSets the width of the intervals used in the life-table calculation of the \nsurvival function. This parameter is overridden by the INTERVALS= option."},"ProcedureOptionType":"V"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY variables; \n\nYou can specify a BY statement with PROC BCHOICE to obtain separate analyses of observations in groups that \nare defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be \nsorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used. \n\nIf your input data set is not sorted in ascending order, use one of the following alternatives: \n\n  • Sort the data by using the SORT procedure with a similar BY statement. \n  • Specify the NOTSORTED or DESCENDING option in the BY statement for the BCHOICE procedure. The NOTSORTED \n    option does not mean that the data are unsorted but rather that the data are arranged in groups (according to values \n    of the BY variables) and that these groups are not necessarily in alphabetical or increasing numeric order. \n  • Create an index on the BY variables by using the DATASETS procedure (in Base SAS software)."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"FREQ","StatementHelp":{"#cdata":"Syntax: FREQ variable </ option>; \n\nThe FREQ statement identifies a variable that contains the frequency of occurrence of each observation. \nPROC LIFETEST treats each observation as if it appeared n times, where n is the value of the FREQ variable \nfor the observation. The FREQ statement is useful for producing life tables when the data are already in the \nform of a summary data set. If it is not an integer, it is truncated to an integer unless the NOTRUNCATE option \nis specified. If it is missing or less than or equal zero, the observation is not used."},"StatementOptions":{"StatementOption":{"StatementOptionName":"NOTRUNCATE|NOTRUNC","StatementOptionHelp":{"#cdata":"Specifies that the frequency values are not truncated to integers. This option does not apply to the \nFleming-Harrington estimator (METHOD=FH)."},"StatementOptionType":"S"}}},{"StatementName":"ID","StatementHelp":{"#cdata":"Syntax: ID variables; \n\nThe ID statement identifies variables whose values are used to label the observations of the Kaplan-Meier, \nBreslow, or Fleming-Harrington survivor function estimates. SAS format statements can be used to format the \nvalues of the ID variables."},"StatementOptions":null},{"StatementName":"STRATA","StatementHelp":{"#cdata":"Syntax: STRATA variable <(list)> <...variable < (list)> > </options> ; \n      \nThe STRATA statement identifies the variables that determine the strata levels. \nStrata are formed according to the nonmissing values of these variables. "},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ADJUST=","StatementOptionHelp":{"#cdata":"[Syntax: ADJUST=method] \n          \nSpecifies the multiple-comparison method for adjusting the p-values of the \npaired tests."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BONFERRONI","@Value2":"DUNNETT","@Value3":"SCHEFFE","@Value4":"SIDAK","@Value5":"SMM","@Value6":"TUKEY","@Value7":"SIMULATE"},"StatementOptionToolTips":{"@ToolTip1":"Applies the Bonferroni correction to the raw p-values.","@ToolTip2":"Performs Dunnett's two-tailed comparisons of the control group with all other groups.","@ToolTip3":"Performs Scheffé's multiple-comparison adjustment.","@ToolTip4":"Applies the Sidák correction to the raw p-values.","@ToolTip5":"Performs the paired comparisons based on the studentized maximum modulus test.","@ToolTip6":"Performs the paired comparisons based on Tukey's studentized range test.","@ToolTip7":"Syntax: SIMULATE <(simulate-options)>                                      Computes the adjusted p-values from the simulated distribution of the maximum or maximum absolute  value of a multivariate normal random vector. The simulate-options include the following:     ACC=value   specifies the target accuracy radius, γ, of a 100(1 - ε)% confidence interval for the true    probability content of the estimated (1- α)th quantile.    ALPHA=value    specifies the value, α, for estimating the (1 - α)th quantile.    EPS=value    specifies the value, ε, for a 100(1 - ε)% confidence interval for the true probability content    of the estimated (1 - α)th quantile.    NSAMP=n    specifies the sample size for the simulation.    REPORT    specifies that a report on the simulation should be displayed    SEED=number    specifies an integer used to start the pseudo-random number generator for the simulation."},"SubOptionsKeywords":"ACC=|ALPHA=|EPS=|NSAMP=|REPORT|SEED="},{"StatementOptionName":"DIFF=","StatementOptionHelp":{"#cdata":"[Syntax: DIFF=CONTROL <('string' <...'string'>)>] \n          \nSpecifies which pairs of survival curves are considered for the multiple comparisons."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ALL","@Value2":"CONTROL"},"StatementOptionToolTips":{"@ToolTip1":"Requests all paired comparisons.","@ToolTip2":"Syntax: DIFF=CONTROL <('string' <...'string'>)>                                      Requests comparisons of the control curve with all other curves. To specify the control curve,  you specify the quotes strings of formatted values that represent the curve in parentheses."}},{"StatementOptionName":"GROUP=","StatementOptionHelp":{"#cdata":"[Syntax: GROUP=variable] \n          \nSpecifies the variable whose formatted values identify the various samples \nwhose underlying survival curves are to be compared."},"StatementOptionType":"V"},{"StatementOptionName":"MISSING","StatementOptionHelp":{"#cdata":"Allows missing values to be a stratum level or a valid value of the GROUP= variable."},"StatementOptionType":"S"},{"StatementOptionName":"NODETAIL","StatementOptionHelp":{"#cdata":"Suppresses the display of the rank statistics and the corresponding covariance matrices for \nvarious strata."},"StatementOptionType":"S"},{"StatementOptionName":"NOTEST","StatementOptionHelp":{"#cdata":"Suppresses the k-sample tests, stratified tests, and trend tests."},"StatementOptionType":"S"},{"StatementOptionName":"ORDER=","StatementOptionHelp":{"#cdata":"[Syntax: ORDER=FORMATTED | INTERNAL] \n          \nSpecifies the sorting order of the values of the STRATA variables. The strata are presented in the specified \norder in the analysis results."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FORMATTED","@Value2":"INTERNAL"},"StatementOptionToolTips":{"@ToolTip1":"Sorts the strata according to their external formatted values, except for numeric variable with no  explicit format, which are sorted by the unformatted (internal) values.","@ToolTip2":"Sorts the strata by their internal values."}},{"StatementOptionName":"TREND","StatementOptionHelp":{"#cdata":"Computes the trend tests for testing the null hypothesis that the k population hazards \nrate are the same versus an ordered alternatives."},"StatementOptionType":"S"},{"StatementOptionName":"TEST=","StatementOptionHelp":{"#cdata":"Controls the tests produced. Each test corresponds to a different weight function."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ALL","@Value2":"FLEMING","@Value3":"LOGRANK","@Value4":"NONE","@Value5":"LR","@Value6":"MODPETO","@Value7":"PETO","@Value8":"WILCOXON","@Value9":"TARONE"},"StatementOptionToolTips":{"@ToolTip1":"Specifies all the nonparametric tests with ρ1=1 and ρ2=0 for the Fleming and  Harrington test—FLEMING(1,0).","@ToolTip2":"Syntax: FLEMING(ρ1, ρ2)                                      Specifies the family of tests in Harrington and Fleming (1982), where ρ1 and ρ2 are nonnegative  numbers. FLEMING(ρ1,ρ2) reduces to the Fleming-Harrington G^ρ family (Fleming and Harrington; 1981)  when ρ2=0, which you can specify as FLEMING(ρ) with one argument. When ρ=0, the test becomes the  log-rank test. When ρ=1, the test should be very close to the Peto-Peto test.","@ToolTip3":"Specifies the log-rank test.","@ToolTip4":"Suppresses all comparison tests. Specifying TEST=NONE is equivalent to specify NOTEST","@ToolTip5":"Specifies the likelihood ratio test based on the exponential model.","@ToolTip6":"Specifies the modified Peto-Peto test.","@ToolTip7":"Specifies the Peto-Peto test. The test is also referred to as the Peto-Peto-Prentice test.","@ToolTip8":"Specifies the Wilcoxon test. The test is also referred to as the Gehan test  or the Breslow test.","@ToolTip9":"Specifies the Tarone-Ware test."}}]}},{"StatementName":"TEST","StatementHelp":{"#cdata":"Syntax: TEST variables ; \n      \nThe TEST statement specifies a list of numeric covariates (prognostic variables) that \nyou want tested for association with the failure time. \n\nTwo sets of rank statistics are computed. These rank statistics and their variances are \npooled over all strata. Univariate (marginal) test statistics are displayed for each of \nthe covariates. \n\nAdditionally, a sequence of test statistics for joint effects of covariates is displayed. \nThe first element of the sequence is the largest univariate test statistic. Other variables \nare then added on the basis of the largest increase in the joint test statistic. The process \ncontinues until all the variables have been added or until the remaining variables are linearly \ndependent on the previously added variables."},"StatementOptions":null},{"StatementName":"TIME","StatementHelp":{"#cdata":"Syntax: TIME variable <*censor(list)> ;\n      \nThe TIME statement is required. It is used to indicate the failure time variable, where variable \nis the name of the failure time variable that can be optionally followed by an asterisk, the name \nof the censoring variable, and a parenthetical list of values that correspond to right censoring. \nThe censoring values should be numeric, nonmissing values. For example, the following statement \nidentifies the variable T as containing the observed failure times (event or censored): \n\n  time T*Status(0,2);\n\nIf the variable Status has the value 0 or 2, the corresponding value of T is a right-censored value."},"StatementOptions":null},{"StatementName":"WEIGHT","StatementHelp":{"#cdata":"Syntax: WEIGHT variable ; \n\nThe variable in the WEIGHT statement identifies the variable in the input data set that contains \nthe weights of the subjects. Values of the WEIGHT variable can be nonintegral and are not truncated. \nObservations with negative, zero, or missing values for the WEIGHT variable are not used in the computation. \n\nThe implementation of weights in PROC LIFETEST is based on Xie and Liu (2005, 2011), who use inverse \nprobability of treatment weights to reduce confounding effects. A weight is assigned to each subject \nas the inverse probability of being in a certain group. If a subject has a higher probability of being \nin a group, it is considered as overrepresented and is therefore assigned a lower weight; on the other \nhand, if the subject has a smaller probability of being in a group, it is considered as underrepresented \nand is assigned a higher weight."},"StatementOptions":null}]}}}