{"Procedure":{"Name":"LOESS","ProductGroup":"SAS/STAT","#comment":{},"ProcedureHelp":{"#cdata":"Syntax: PROC LOESS <DATA=SAS-data-set> ; \n    MODEL dependents=regressors </ options> ; \n    OUTPUT <OUT=SAS-data-set> <keyword <=name>> <…keyword <=name>> </ options> ; \n    ID variables ; \n    BY variables ; \n    WEIGHT variable ; \n    SCORE DATA=SAS-data-set <ID=(variable list)> </ options> ; \n\nThe LOESS procedure implements a nonparametric method for estimating regression surfaces pioneered by \nCleveland, Devlin, and Grosse (1988), Cleveland and Grosse (1991), and Cleveland, Grosse, and Shyu (1992)."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nNames the SAS data set to be used by PROC LOESS. If the DATA= option is not specified, \nPROC LOESS uses the most recently created SAS data set."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"PLOTS=","ProcedureOptionHelp":{"#cdata":"Controls the plots produced through ODS Graphics.\n      \nSyntax: \n(1) PLOTS <(global-plot-options)> <= plot-request <(options)>> \n(2) PLOTS <(global-plot-options)> <= (plot-request <(options)> <... plot-request <(options)>>)> \n\nThe global-plot-options supported by the LOESS procedure follow:\n\n  MAXPOINTS=NONE | number \n  specifies that plots with elements that require processing more than number points are suppressed. \n  The default is MAXPOINTS=5000. This cutoff is ignored if you specify MAXPOINTS=NONE. \n\n  ONLY \n  suppresses the default plots. Only the plots specifically requested are produced. \n\n  UNPACK \n  suppresses paneling. By default, multiple plots can appear in some output panels. Specify UNPACK \n  to get each plot individually. You can specify PLOTS(UNPACK) to unpack the default plots. You can \n  also specify UNPACK as a suboption with CONTOURFITPANEL, DIAGNOSTICS, FITPANEL, RESIDUALS and \n  RESIDUALSBYSMOOTH."},"ProcedureOptionType":"S|V","ProcedureOptionValues":{"@Value1":"ALL","@Value2":"CONTOURFIT","@Value3":"CONTOURFITPANEL","@Value4":"CRITERIONPLOT|CRITERION","@Value5":"DIAGNOSTICSPANEL|DIAGNOSTICS","@Value6":"FITPANEL","@Value7":"FITPLOT|FIT","@Value8":"NONE","@Value9":"OBSERVEDBYPREDICTED","@Value10":"QQPLOT|QQ","@Value11":"RESIDUALSBYSMOOTH","@Value12":"RESIDUALBYPREDICTED","@Value13":"RESIDUALHISTOGRAM","@Value14":"RESIDUALPANEL|RESIDUALS","@Value15":"RFPLOT|RF","@Value16":"SCOREPLOT|SCORE"},"ProcedureOptionToolTips":{"@ToolTip1":"Requests that all plots appropriate for the particular analysis be produced.","@ToolTip2":"Syntax: CONTOURFIT <(contour-options)>                                  Produces a contour plot of the fitted surface overlaid with a scatter plot of the data for models  with two regressors. You can use the following contour-options to control how the observations are displayed:                                   OBS=GRADIENT    specifies that observations be displayed as circles colored by the observed response.    OBS=NONE    suppresses the observations.    OBS=OUTLINE    specifies that observations be displayed as circles with a border but with a completely transparent fill.     OBS=OUTLINEGRADIENT    is the same as OBS=GRADIENT except that a border is shown around each observation.","@ToolTip3":"Syntax: CONTOURFITPANEL <(<UNPACK> <contour-options> )>                                  Produces panels of contour plots overlaid with a scatter plot of the data for each smoothing  parameter specified in the SMOOTH= option in the MODEL statement, for models with two regressors. The UNPACK option suppresses paneling, and the contour-options are the same as for the CONTOURFIT option.","@ToolTip4":"Displays a scatter plot of the value of the SELECTION= criterion versus the smoothing parameter value for all smoothing parameter values examined in the selection process.","@ToolTip5":"Syntax: DIAGNOSTICS <(UNPACK)>                                  Produces a summary panel of fit diagnostics. You can request the five plots in this panel  as individual plots by specifying the UNPACK option.","@ToolTip6":"Syntax: FITPANEL <(UNPACK)>                                  Produces panels of plots showing the fitted LOESS curve overlaid on a scatter plot of the input  data for each smoothing parameter specified in the SMOOTH= option in the MODEL statement. If you specify the UNPACK option, then all fit panels are unpacked.","@ToolTip7":"Produces a scatter plot of the input data with the fitted LOESS curve overlaid for models with a single regressor.","@ToolTip8":"Suppresses all plots","@ToolTip9":"Produces a scatter plot of the dependent variable values by the predicted values.","@ToolTip10":"Produces a normal quantile plot of the residuals.","@ToolTip11":"Syntax: RESIDUALSBYSMOOTH <(<UNPACK> <SMOOTH> )>                                  Produces for each regressor panels of plots showing the residuals of the LOESS fit versus the  regressor for each smoothing parameter specified in the SMOOTH= option in the MODEL statement.","@ToolTip12":"Produces a scatter plot of the residuals by the predicted values.","@ToolTip13":"Produces a histogram of the residuals.","@ToolTip14":"Syntax: RESIDUALPANEL | RESIDUALS  <(residual-options )>                                    Produces panels of the residuals versus the regressors in the model.  The following residual-options are available:                                    SMOOTH    requests that a nonparametric fit line be shown in each plot in the panel.    UNPACK    suppresses paneling.","@ToolTip15":"Produces a 'Residual-Fit' (or RF) plot consisting of side-by-side quantile plots of the centered  fit and the residuals.","@ToolTip16":"Produces a scatter plot of the scored values at the score points for each SCORE statement."},"SubOptionsKeywords":"MAXPOINTS=|ONLY|UNPACK|OBS=|SMOOTH"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nObtains separate analyses on observations in groups defined by the BY variables."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that immediately \nfollows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"ID","StatementHelp":{"#cdata":"Syntax: ID variables ;\n      \nThe ID statement is optional, and more than one ID statement can be used. The variables listed in \nany of the ID statements are displayed in the \"Output Statistics\" table beside each observation."},"StatementOptions":null},{"StatementName":"WEIGHT","StatementHelp":{"#cdata":"Syntax: WEIGHT variable ;\n      \nThe WEIGHT statement specifies a variable in the input data set that contains values to be used \nas a priori weights for a loess fit. The values of the weight variable must be nonnegative. If an \nobservation’s weight is zero, negative, or missing, the observation is deleted from the analysis."},"StatementOptions":null},{"StatementName":"SCORE","StatementHelp":{"#cdata":"Syntax: SCORE <DATA=SAS-data-set> <ID=(variable list)> </ options> ;\n      \nThe fitted loess model is used to score the data in the specified SAS data set. A SCORE statement \nis optional, and more than one SCORE statement can be used."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DATA=","StatementOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n                   \nThe fitted loess model is used to score the data in the specified SAS data set. This data set must \ncontain all the regressor variables specified in the MODEL statement. Furthermore, when a BY statement \nis used, the score data set must also contain all the BY variables sorted in the order of the BY variables."},"StatementOptionType":"DV"},{"StatementOptionName":"ID=","StatementOptionHelp":{"#cdata":"[Syntax: ID=(variable list)>] \n          \nThe optional ID=(variable list) specifies ID variables to be included in the \"Score Results\" table."},"StatementOptionType":"V"},{"StatementOptionName":"CLM","StatementOptionHelp":{"#cdata":"Requests that 100(1 - α)% confidence limits on the mean predicted value be added to the \n\"Score Results\" table."},"StatementOptionType":"S"},{"StatementOptionName":"PRINT","StatementOptionHelp":{"#cdata":"[Syntax: PRINT <(variables )>] \n          \nSpecifies that the \"Score Results\" table be displayed."},"StatementOptionType":"S"},{"StatementOptionName":"SCALEDINDEP","StatementOptionHelp":{"#cdata":"Specifies that scaled regressor coordinates be included in the SCORE results table. This option \nis ignored if the SCALE= model option is not used or if SCALE=NONE is specified."},"StatementOptionType":"S"},{"StatementOptionName":"STEPS","StatementOptionHelp":{"#cdata":"Requests that all models evaluated during smoothing parameter value selection be scored, provided \nthat the SELECT= option together with the STEPS modifier is specified in the MODEL statement. By \ndefault only the selected model is scored."},"StatementOptionType":"S"}]}},{"StatementName":"MODEL","StatementHelp":{"#cdata":"Syntax: MODEL dependents=regressors </ options> ;\n      \nThe MODEL statement names the dependent variables and the independent variables. Variables \nspecified in the MODEL statement must be numeric variables in the data set being analyzed."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ALL","StatementOptionHelp":{"#cdata":"Requests all these options: CLM, RESIDUAL, SCALEDINDEP, STD, and T."},"StatementOptionType":"S"},{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=number] \n          \nSets the significance level used for the construction of confidence intervals \nfor the current MODEL statement. The value must be between 0 and 1; the default \nvalue of 0.05 results in 95% intervals."},"StatementOptionType":"V"},{"StatementOptionName":"BUCKET=","StatementOptionHelp":{"#cdata":"[Syntax: BUCKET=number] \n          \nSpecifies the maximum number of points in the leaf nodes of the kd tree. The default \nvalue used is s*n/5, where s is a smoothing parameter value specified using the SMOOTH=\noption and n is the number of observations being used in the current BY group."},"StatementOptionType":"V"},{"StatementOptionName":"CLM","StatementOptionHelp":{"#cdata":"Requests that 100(1 - α)% confidence limits on the mean predicted value be added to the \n\"Output Statistics\" table."},"StatementOptionType":"S"},{"StatementOptionName":"DEGREE=","StatementOptionHelp":{"#cdata":"Sets the degree of the local polynomials to use for each local regression."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2"},"StatementOptionToolTips":{"@ToolTip1":"For local linear fitting","@ToolTip2":"For local quadratic fitting"}},{"StatementOptionName":"DETAILS","StatementOptionHelp":{"#cdata":"[Syntax: DETAILS <( tables )>] \n          \nSelects which tables to display, where tables is one or more of the specifications \nKDTREE, MODELSUMMARY, OUTPUTSTATISTICS, and PREDATVERTICES."},"StatementOptionType":"S"},{"StatementOptionName":"DFMETHOD=","StatementOptionHelp":{"#cdata":"Specifies the method used to calculate the lookup degrees of freedom used in performing \nstatistical inference."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"NONE","@Value2":"EXACT","@Value3":"APPROX"},"StatementOptionToolTips":{"@ToolTip1":"This is the default, unless you specify any of the MODEL statement options ALL, CLM, STD, and T, or  any SCORE statement CLM option.","@ToolTip2":"This is the default when you specify any of the MODEL statement options ALL, CLM, STD, and T, or any  SCORE statement CLM option.","@ToolTip3":"Syntax: APPROX <(approx-options)>                                      You can specify the following approx-options in parentheses after the DFMETHOD=APPROX option:                                       QUANTILE=number   specifies that the smallest 100(number)% of the nonzero coefficients in the smoothing matrix    be set to zero in computing the approximate lookup degrees of freedom.    CUTOFF=number    specifies that coefficients in the smoothing matrix whose magnitude is less than the specified    value be set to zero in computing the approximate lookup degrees of freedom."}},{"StatementOptionName":"DIRECT","StatementOptionHelp":{"#cdata":"Specifies that local least squares fits are to be done at every point in the input data set."},"StatementOptionType":"S"},{"StatementOptionName":"DROPSQUARE=","StatementOptionHelp":{"#cdata":"[Syntax: DROPSQUARE=(variables)] \n          \nSpecifies the quadratic monomials to exclude from the local quadratic fits."},"StatementOptionType":"V"},{"StatementOptionName":"INTERP=","StatementOptionHelp":{"#cdata":"Specifies the degree of the interpolating polynomials used for blending local polynomial fits \nat the kd tree vertices. This option is ignored if the DIRECT option is specified in the model statement."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"LINEAR","@Value2":"CUBIC"},"StatementOptionToolTips":{"@ToolTip1":"This is the default.","@ToolTip2":"Not supported for models with more than one regressor."}},{"StatementOptionName":"ITERATIONS=","StatementOptionHelp":{"#cdata":"[Syntax: ITERATIONS=number] \n          \nSpecifies the total number of iterations to be done. The first iteration performs \nan initial LOESS fit. Subsequent iterations perform iterative reweighting."},"StatementOptionType":"V"},{"StatementOptionName":"RESIDUAL|R","StatementOptionHelp":{"#cdata":"Specifies that residuals be included in the \"Output Statistics\" table."},"StatementOptionType":"S"},{"StatementOptionName":"SCALE=","StatementOptionHelp":{"#cdata":"Specifies the scaling method to be applied to scale the regressors. The default is NONE."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"NONE","@Value2":"SD"},"StatementOptionToolTips":{"@ToolTip1":"No scaling is applied.","@ToolTip2":"Syntax: SD <(number)>                                      A specification of SD(number) indicates that a trimmed standard deviation is to be used as a measure  of scale, where number is the trimming fraction. A specification of SD with no qualification defaults  to 10% trimmed standard deviation."}},{"StatementOptionName":"SCALEDINDEP","StatementOptionHelp":{"#cdata":"[Specifies that scaled regressor coordinates be included in the output tables. \nThis option is ignored if the SCALE= model option is not used or if SCALE=NONE is specified."},"StatementOptionType":"S"},{"StatementOptionName":"SELECT=","StatementOptionHelp":{"#cdata":"Specifies that automatic smoothing parameter selection be done using the named criterion or DFCriterion.\n          \nSyntax: \n(1) SELECT=criterion <( <GLOBAL> <PRESEARCH> <STEPS> <RANGE(lower,upper)> )> |\n(2) SELECT=DFCriterion <( target <GLOBAL> <PRESEARCH> <STEPS> <RANGE(lower,upper)> )>        \n\nYou can specify the following suboptions in parentheses after the specified criterion to \nalter the behavior of the SELECT= option: \n\n  GLOBAL \n  specifies that a global minimum be found within the range of smoothing parameter values examined. \n  This suboption has no effect if you also specify the SMOOTH= option in the MODEL statement. \n\n  PRESEARCH \n  requests an initial grid search to find a smoothing parameter range within which the subsequent\n  golden section search is done.\n\n  RANGE(lower,upper) \n  specifies that only smoothing parameter values greater than or equal to lower and less than \n  or equal to upper be examined. \n\n  STEPS \n  specifies that all models evaluated in the selection process be displayed."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"AICC","@Value2":"AICC1","@Value3":"GCV","@Value4":"DF1","@Value5":"DF2","@Value6":"DF3"},"StatementOptionToolTips":{"@ToolTip1":"[criterion] Specifies the AICc criterion (Hurvich, Simonoff, and Tsai; 1998).","@ToolTip2":"[criterion] Specifies the AICc1 criterion (Hurvich, Simonoff, and Tsai; 1998).","@ToolTip3":"[criterion] Specifies the generalized cross validation criterion (Craven and Wahba; 1979).","@ToolTip4":"[DFCriterion] Specifies Trace(L).","@ToolTip5":"[DFCriterion] Specifies Trace((L^T)L).","@ToolTip6":"[DFCriterion] Specifies 2Trace(L)-Trace((L^T)L)."},"SubOptionsKeywords":"GLOBAL|PRESEARCH|RANGE|STEPS"},{"StatementOptionName":"SMOOTH=","StatementOptionHelp":{"#cdata":"[Syntax: SMOOTH=value-list] \n          \nSpecifies a list of positive smoothing parameter values."},"StatementOptionType":"V"},{"StatementOptionName":"STD","StatementOptionHelp":{"#cdata":"Specifies that standard errors of the mean predicted values be included in the \"Output Statistics\" \ntable. The use of this option implicitly selects the model option DFMETHOD=EXACT if the DFMETHOD= \noption has not been explicitly used."},"StatementOptionType":"S"},{"StatementOptionName":"T","StatementOptionHelp":{"#cdata":"Specifies that t statistics are to be included in the \"Output Statistics\" table. The use of this option\nimplicitly selects the model option DFMETHOD=EXACT if the DFMETHOD= option has not been explicitly used."},"StatementOptionType":"S"},{"StatementOptionName":"TRACEL","StatementOptionHelp":{"#cdata":"Specifies that the trace of the prediction matrix as well as the GCV and AICC statistics be included \nin the \"Fit Summary\" table."},"StatementOptionType":"S"}]}},{"StatementName":"OUTPUT","StatementHelp":{"#cdata":"Syntax: OUTPUT <OUT= SAS-data-set> <keyword <= name>> <…keyword <=name>> </ options> ; \n\nThe OUTPUT statement creates a new SAS data set that saves the predicted values and other requested \nstatistics that are calculated after models for all smoothing parameter values that are specified in \nthe SMOOTH= option in the MODEL statement have been fit. If you do not specify a keyword, then only \nthe predicted response is included. \n\nAll the variables in the original data set are included in the new data set, along with variables \ncreated by the OUTPUT statement. These new variables contain the predicted values and a variety of \nother statistics that are calculated for each observation in the data set."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"OUT=","StatementOptionHelp":{"#cdata":"[Syntax: OUT=SAS-data-set] \n          \nSpecifies the name of the new data set. By default, the procedure uses the DATAn convention \nto name the new data set. "},"StatementOptionType":"RV"},{"StatementOptionName":"PREDICTED=|P=","StatementOptionHelp":{"#cdata":"[keyword] \n          \nCreates a new variable that contains predicted values. The default name is Predicted."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"RESIDUAL=|R=","StatementOptionHelp":{"#cdata":"[keyword] \n          \nCreates a new variable that contains residual values, which are calculated as ACTUAL – PREDICTED. \nThe default name is Residual."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"STD=","StatementOptionHelp":{"#cdata":"[keyword] \n          \nCreates a new variable that contains standard errors of the mean predicted values. The use of this \noption implicitly selects the model option DFMETHOD=EXACT even if the DFMETHOD= option has not been \nexplicitly used. The default name is StdErr."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"T=","StatementOptionHelp":{"#cdata":"[keyword] \n          \nCreates a new variable that contains t statistics. The use of this option implicitly selects \nthe model option DFMETHOD=EXACT even if the DFMETHOD= option has not been explicitly used. \n\nThe default name is tValue."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"LCLM=","StatementOptionHelp":{"#cdata":"[keyword] \n          \nCreates a new variable that contains the lower part of 100(1 - α)% confidence limits on the mean predicted \nvalue. By default, the 95% limits are computed; the ALPHA= option in the MODEL statement can be \nused to change the significance level. The use of this option implicitly selects the model option \nDFMETHOD=EXACT even if the DFMETHOD= option has not been explicitly used. The default name is LowerCL."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"UCLM=","StatementOptionHelp":{"#cdata":"[keyword] \n          \nCreates a new variable that contains the upper part of 100(1 - α)% confidence limits on the mean \npredicted value. By default, the 95% limits are computed; the ALPHA= option in the MODEL statement \ncan be used to change the significance level. The use of this option implicitly selects the model \noption DFMETHOD=EXACT even if the DFMETHOD= option has not been explicitly used. The default name \nis UpperCL."},"StatementOptionType":"RS|RV"},{"StatementOptionName":"ALL","StatementOptionHelp":{"#cdata":"Requests all these keywords: PREDICTED, RESIDUAL, STD, T, LCLM, and UCLM."},"StatementOptionType":"S"},{"StatementOptionName":"ROWWISE|ROW","StatementOptionHelp":{"#cdata":"Arranges the created OUTPUT data set in rowwise format."},"StatementOptionType":"S"}]}}]}}}