{"Procedure":{"Name":"MAPIMPORT","ProductGroup":"SAS/GRAPH","ProcedureHelp":{"#cdata":"Syntax: PROC MAPIMPORT OUT= map-data-set DATAFILE= 'path-to-shapefile' <CONTENTS> <CREATE_ID_>;  \n      EXCLUDE 'field-identifier(s)';  \n      ID 'field-identifier(s)';  \n      RENAME 'field-identifier-1' = variable-name-1 < ... 'field-identifier-n' = variable-name-n>;  \n      SELECT 'field-identifier(s)';  \n\nThe MAPIMPORT procedure enables you to import ESRI shapefiles (spatial data formats) and \nprocess the SHP files into SAS/GRAPH traditional map data sets. \n\nThe MAPIMPORT procedure does not produce any graphics output. Instead, it produces an output \nmap data set, which can be used with the GMAP procedure."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"OUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUT= map-data-set] \n      \nSpecifies the name of the output map data set that is created."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"DATAFILE=|INFILE=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATAFILE= 'path-to-shapefile'] \n      \nSpecifies the path and filename of the shapefile that is read and processed. \n\nNote: By default, all of the fields in a shapefile are included in the output map data set. \nTo include only specific fields in the output map data set, use the SELECT statement. To exclude \nspecific fields from the output map data set, use the EXCLUDE statement."},"ProcedureOptionType":"RV"},{"ProcedureOptionName":"CONTENTS","ProcedureOptionHelp":{"#cdata":"Displays information about the shapefile, including field identifier names and types."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"CREATE_ID_","ProcedureOptionHelp":{"#cdata":"Creates a map ID variable named _ID_ with a unique value for each polygon in the map. \n      \nInteraction: This statement has no effect if you also specify the ID statement."},"ProcedureOptionType":"V"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"EXCLUDE","StatementHelp":{"#cdata":"Syntax: EXCLUDE 'field-identifier(s)'; \n      \nSpecifies one or more field-identifiers from the shapefile that are excluded from the output \nmap data set. \n\nRequired Arguments:\n\n'field-identifier(s)' \n  specifies one or more fields from the shapefile that are excluded from the output map data set. \n  All of the fields that you do not specify are included in the output map data set.\n\n  If you do not specify the EXCLUDE statement or the SELECT statement, then all of the fields from \n  the shapefile are included in the output map data set."},"StatementOptions":null},{"StatementName":"ID","StatementHelp":{"#cdata":"Syntax: ID 'field-identifier(s)';\n\nReorders the map polygons by one or more identifier fields. \n\nRequired Arguments: \n\n'field-identifier(s)' \n  specifies one or more fields in the shape file that identify the polygons in the map. The values \n  of the fields that you specify are used to reorder the map polygons and assign segment numbers in \n  the output map data set.\n\n  When you do not specify the ID statement, the MAPIMPORT procedure uses the existing polygon order \n  for the output map data set.\n\n  You might want to use the ID statement when the default output map data set does not draw properly \n  in the GMAP procedure. If the ID variable that you specify in the GMAP procedure is not unique for \n  each polygon, then extraneous lines might appear in your GMAP output. To ensure that the ID variable \n  is unique for each polygon, specify the same ID statement in both the MAPIMPORT and GMAP procedures."},"StatementOptions":null},{"StatementName":"RENAME","StatementHelp":{"#cdata":"Syntax: RENAME 'field-identifier-1' = variable-name-1 <... 'field-identifier-n' = SAS-variable-n>\n      \nRenames variables in the output map data set that correspond to specific fields in the shapefile. \n\nRequired Arguments: \n\n'field-identifier' = variable-name \n  assigns a variable name in the output map data set for a field in the shapefile. You can specify \n  multiple field identifier and variable name pairs, separated by a space.\n\n  For example, the following code renames the STNAME field to STATE, and the FIPSTATE field to STATE_FIPS: \n\n    rename \"stname\" = state \"fipstate\" = state_fips;\n\n  By default, when you do not specify the RENAME statement, the MAPIMPORT procedure uses the field \n  name in the shapefile as the variable name in the output map data set. However, if the field name \n  is not a valid SAS variable name, then the variable name is modified in the output map data set."},"StatementOptions":null},{"StatementName":"SELECT","StatementHelp":{"#cdata":"Syntax: SELECT 'field-identifier(s)';\n      \nSelects the fields from the shapefile that are included in the output map data set. \n\nRequired Arguments:\n\n'field-identifier(s)' \n  specifies one or more fields from the shapefile that are included in the output map data set. \n  If you do not use the SELECT statement or the EXCLUDE statement, then all of the fields from \n  the shapefile are included in the output map data set.\n\n  For field identifiers that are not valid SAS variable names, the MAPIMPORT procedure changes \n  the name of the variable in the output map data set automatically."},"StatementOptions":null}]}}}