{"Procedure":{"Name":"MIGRATE","ProductGroup":"BASE","ProcedureHelp":{"#cdata":"Syntax: PROC MIGRATE IN=libref-2 OUT=libref-1 <BUFSIZE=n> <MOVE> <SLIBREF=libref> <KEEPNODUPKEY>;\n  \nThe MIGRATE procedure migrates members in a SAS library to the current SAS version. \n\nThe procedure migrates a library from most SAS 6, SAS 7, SAS 8, and SAS 9 operating \nenvironments to the current release of SAS. The migration must occur within the same \nengine family; for example, V6, V7, or V8 can migrate to V9, but V6TAPE must migrate \nto V9TAPE. \n\nThe procedure migrates the following library members:\n\ndata sets with alternate collating sequence, audit trails, compression, created and \nmodified datetimes, deleted observations, encryption, generations, indexes, integrity \nconstraints, and passwords\n\nin many cases, views, catalogs, item stores, and MDDBs (see What Are the Specific \nConsiderations for Each Member Type?)\n\nThe procedure does not support stored compiled DATA step programs or stored compiled macros. \nInstead, move the source code to the target, where you can compile and store it.\n\nThe procedure does not support SPD engine (Scalable Performance Data engine) data sets. If \nyou are staying on the same operating environment, the SPD engine data sets are compatible. \nIf you are changing to a different operating environment where the data sets are not compatible, \nuse PROC CPORT and PROC CIMPORT to convert them."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"IN=","ProcedureOptionHelp":{"#cdata":"[Syntax: IN=libref-1] \n      Names the source SAS library from which to migrate members."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"OUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUT=libref-2] \n      \nNames the target SAS library to contain the migrated members."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"BUFSIZE=","ProcedureOptionHelp":{"#cdata":"Specifies the buffer page size of the members that are written to the target library."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG"},"ProcedureOptionToolTips":{"@ToolTip1":"Specifies the number of bytes. Replace n with an integer value.","@ToolTip2":"Specifies the number of kilobytes (1,024 bytes). Replace n with an integer value.","@ToolTip3":"Specifies the number of megabytes (1,048,576 bytes). Replace n with an integer value.","@ToolTip4":"Specifies the number of gigabytes (1,073,741,824 bytes). Replace n with an integer value."}},{"ProcedureOptionName":"MOVE","ProcedureOptionHelp":{"#cdata":"Deletes the original members from the source library."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"SLIBREF=","ProcedureOptionHelp":{"#cdata":"[Syntax: SLIBREF=libref] \n      \nSpecifies a libref that is assigned through a SAS/CONNECT or SAS/SHARE server."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"KEEPNODUPKEY","ProcedureOptionHelp":{"#cdata":"Specifies to retain the NODUPKEY sort order."},"ProcedureOptionType":"S"}]},"ProcedureStatements":null}}