{"Procedure":{"Name":"PRESENV","ProductGroup":"BASE","#comment":{},"ProcedureHelp":{"#cdata":"Syntax: PROC PRESENV PERMDIR=libref SASCODE=fileref <SHOW_COMMENTS>; \n  \nThe PRESENV procedure preserves all global statements and macro variables in your SAS code \nfrom one SAS session to another. When this procedure is invoked at the end of a SAS session, \nall of the global statements and macro variables are written to a file. The Work data sets \nand the macro catalog are written to an auxiliary directory. You can then terminate the SAS \nsession. You can restart the session at a later time, and the saved global statements and \nmacro variable settings can be re-executed. The Work data sets can be copied back to the \ncurrent Work directory, thereby allowing the session to resume. \n\nThe PRESENV procedure works with the PRESENV system option to preserve your SAS program and \ndata sets. You can turn the option on or off at any time. When the PRESENV system option is \nturned off, the global statements collection is suspended. When turned back on, the collection \nresumes. At no point is the collection discarded. However, the collection does not begin until \nthe first time the option is turned on. \n\nThis functionality is very useful in a grid environment where an Enterprise Guide (EG) session \nneeds to be terminated and started again on another node at a later time. \n\nRequirement:\nYou must set the PRESENV system option to PRESENV (the default is NOPRESENV) to preserve the \nglobal statements. PROC PRESENV then saves a copy of those global statements to a file that \nyou specify. Global statements are preserved from the time that the PRESENV system option is \nin effect."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"PERMDIR=","ProcedureOptionHelp":{"#cdata":"[Syntax: PERMDIR=libref] \n      \nSpecifies a libref where all of the Work data sets, catalogs, and macros are written."},"ProcedureOptionType":"RV"},{"ProcedureOptionName":"SASCODE=","ProcedureOptionHelp":{"#cdata":"[Syntax: SASCODE=fileref] \n      \nSpecifies a fileref where a SAS program is written. The SAS program contains all of the code \nthat is necessary to restore the environment."},"ProcedureOptionType":"RV"},{"ProcedureOptionName":"SHOW_COMMENTS","ProcedureOptionHelp":{"#cdata":"Displays all global statements. Redundant global statements are commented out. \n      \nIf this option is not used, then the global statements are suppressed. \n\nTip: Use this option only for debugging your program, because this option can greatly increase \nthe amount of text that is being generated."},"ProcedureOptionType":"S"}]},"ProcedureStatements":null}}