{"Procedure":{"Name":"PRINTTO","ProductGroup":"BASE","ProcedureHelp":{"#cdata":"Syntax: PROC PRINTTO <option(s)>; \n\nThe PRINTTO procedure defines destinations, other than ODS destinations, for SAS procedure \noutput and for the SAS log. By default, SAS procedure output and the SAS log are routed to \nthe default procedure output file and the default SAS log file for your method of operation. \nThe PRINTTO procedure does not define ODS destinations.  \n\nYou can store the SAS log or procedure output in an external file or in a SAS catalog entry. \nWith additional programming, you can use SAS output as input data within the same job.\n\nBeginning in SAS 9.3, the following enhancements have been made to the PRINTTO procedure: \n\no If you use the PRINTTO procedure to write to a file or a catalog entry, you must open \n  the LISTING destination. \n  \no If SAS is started in objectserver mode, the PRINTTO procedure does not route log messages \n  to the log specified by the ALTLOG= system option."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"LABEL=","ProcedureOptionHelp":{"#cdata":"[Syntax: LABEL='description'] \n      \nProvides a description for a catalog entry that contains a SAS log or procedure output."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"LOG=","ProcedureOptionHelp":{"#cdata":"Syntax: LOG=LOG | file-specification | \n      \nRoutes the SAS log to one of three locations: (1) the SAS lOG, (2) an external file, \nor (3) a SAS catalog entry."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"LOG","@Value2":"<file-specification>","@Value3":"<SAS-catalog-entry>"},"ProcedureOptionToolTips":{"@ToolTip1":"Routes the SAS log to its default destination.","@ToolTip2":"Routes the SAS log to an external file. file-specification can be one of the following:   'external-file'  the name of an external file specified in quotation marks.  log-filename  is an unquoted alphanumeric text string. SAS creates a log that uses log-filename.log as the log filename.  fileref  a fileref previously assigned to an external file.","@ToolTip3":"Routes the SAS log to a SAS catalog entry. By default, libref is SASUSER, catalog is  PROFILE, and type is LOG. Express SAS-catalog-entry in one of the following ways:   libref.catalog.entry<.LOG>  a SAS catalog entry stored in the SAS library and SAS catalog specified.  catalog.entry<.LOG> a SAS catalog entry stored in the specified SAS catalog in the default SAS library SASUSER.  entry.LOG  a SAS catalog entry stored in the default SAS library and catalog: SASUSER.PROFILE.  fileref  a fileref previously assigned to a SAS catalog entry. Search for \"FILENAME, CATALOG  Access Method\" in the SAS online documentation."}},{"ProcedureOptionName":"PRINT=|FILE=|NAME=","ProcedureOptionHelp":{"#cdata":"Syntax: PRINT=PRINT | file-specification | SAS-catalog-entry\n      \nRoutes procedure output to one of three locations: (1) the default destination, \n(2) an external file, or (3) a SAS catalog entry."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"PRINT","@Value2":"<file-specification>","@Value3":"<SAS-catalog-entry>"},"ProcedureOptionToolTips":{"@ToolTip1":"Routes the procedure output to its default destination.","@ToolTip2":"Routes the procedure output to an external file. file-specification can be one of the following:   'external-file'  the name of an external file specified in quotation marks.  print-filename  is an unquoted alphanumeric text string. SAS creates a print file that uses print-filename as the print filename.   fileref  a fileref previously assigned to an external file.","@ToolTip3":"Routes the procedure output to a SAS catalog entry. By default, libref is SASUSER,  catalog is PROFILE, and type is OUTPUT. Express SAS-catalog-entry in one of the  following ways:   libref.catalog.entry<.OUTPUT>  a SAS catalog entry stored in the SAS library and SAS catalog specified.  catalog.entry<.OUTPUT> a SAS catalog entry stored in the specified SAS catalog in the default SAS library SASUSER.  entry.OUTPUT  a SAS catalog entry stored in the default SAS library and catalog: SASUSER.PROFILE.  fileref  a fileref previously assigned to a SAS catalog entry. Search for \"FILENAME, CATALOG  Access Method\" in the SAS online documentation."}},{"ProcedureOptionName":"NEW","ProcedureOptionHelp":{"#cdata":"Clears any information that exists in a file and prepares the file to receive the \nSAS log or procedure output."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"UNIT=","ProcedureOptionHelp":{"#cdata":"[Syntax: UNIT=nn] \n      \nRoutes the output to the file identified by the fileref FTnnF001, where nn \nis an integer between 1 and 99."},"ProcedureOptionType":"V"}]},"ProcedureStatements":null}}