{"Procedure":{"Name":"PROBIT","#comment":{},"ProductGroup":"SAS/STAT","ProcedureHelp":{"#cdata":"Syntax: PROC PROBIT < options > ;\n    BY variables ;\n    CDFPLOT <VAR=variable > < options > ;\n    CLASS variables ;\n    ESTIMATE < ‘label’ > estimate-specification < (divisor=n) >\n      < , . . . < ‘label’ > estimate-specification < (divisor=n) > > < / options > ;\n    EFFECTPLOT < plot-type < (plot-definition-options) > > < / options > ;\n    INSET < keyword-list > < / options > ;\n    IPPPLOT <VAR=variable > < options > ;\n    LPREDPLOT < VAR=variable > < options > ;\n    LSMEANS < model-effects > < / options > ;\n    LSMESTIMATE model-effect < ‘label’ > values < (divisor=n) >\n      < , . . . < ‘label’ > values < (divisor=n) > > < / options > ;\n    MODEL response = independents < / options > ;\n    OUTPUT <OUT=SAS-data-set > < options > ;\n    PREDPPLOT < VAR=variable > < options > ;\n    SLICE model-effect < / options > ;\n    STORE <OUT=>item-store-name < / LABEL=‘label’ > ;\n    TEST < model-effects > < / options > ;\n    WEIGHT variable ;\n\nThe PROBIT procedure calculates maximum likelihood estimates of regression parameters \nand the natural (or threshold) response rate for quantal response data from biological \nassays or other discrete event data. This includes probit, logit, ordinal logistic, and \nextreme value (or gompit) regression models. \n\nProbit analysis developed from the need to analyze qualitative (dichotomous or polytomous) \ndependent variables within the regression framework. Many response variables are binary by \nnature (yes/no), while others are measured ordinally rather than continuously (degree of \nseverity). Collett (2003) and Agresti (2002), for example, have shown ordinary least squares \n(OLS) regression to be inadequate when the dependent variable is discrete. Probit or logit \nanalyses are more appropriate in this case."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"CVOUT","ProcedureOptionHelp":{"#cdata":"Writes the parameter estimate covariance matrix to the OUTEST= data set."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"C=","ProcedureOptionHelp":{"#cdata":"[Syntax: C=rate] \n      \nSets the natural response rate or to provide the initial estimate of the natural response rate. \nThe natural response rate value must be a number between 0 and 1."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"OPTC","ProcedureOptionHelp":{"#cdata":"Requests that the natural response rate C be estimated."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nSpecifies the SAS data set to be used by PROC PROBIT."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"GOUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: GOUT=graphics-catalog] \n      \nSpecifies a graphics catalog in which to save graphics output."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"HPROB=","ProcedureOptionHelp":{"#cdata":"[Syntax: HPROB=p] \n      \nSpecifies a minimum probability level for the Pearson chi-square to indicate a good fit. \nThe default value is 0.10."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"INEST=","ProcedureOptionHelp":{"#cdata":"[Syntax: INEST=SAS-data-set] \n      \nSpecifies an input SAS data set that contains initial estimates for all the parameters in the model."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"INVERSECL","ProcedureOptionHelp":{"#cdata":"Computes confidence limits for the values of the first continuous independent variable (such as dose)\nthat yield selected response rates."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"LACKFIT","ProcedureOptionHelp":{"#cdata":"Performs two goodness-of-fit tests (a Pearson chi-square test and a log-likelihood ratio chi-square \ntest) for the fitted model."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"LOG","ProcedureOptionHelp":{"#cdata":"Analyzes the data by replacing the first continuous independent variable with its natural logarithm."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"LOG10","ProcedureOptionHelp":{"#cdata":"Specifies an analysis like that of the LN or LOG option, except that the common logarithm (log to \nthe base 10) of the dose value is used rather than the natural logarithm."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NAMELEN=","ProcedureOptionHelp":{"#cdata":"[Syntax: NAMELEN=n] \n      \nSpecifies the length of effect names in tables and output data sets to be n-characters, where n \nis a value between 20 and 200. The default length is 20 characters."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NOPRINT","ProcedureOptionHelp":{"#cdata":"Suppresses the display of all output including graphics."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"ORDER=","ProcedureOptionHelp":{"#cdata":"Specifies the sorting order for the levels of the classification variables specified in the CLASS \nstatement, including the levels of the response variable."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"DATA","@Value2":"FORMATTED","@Value3":"FREQ","@Value4":"INTERNAL"},"ProcedureOptionToolTips":{"@ToolTip1":"Orders values according to their order in the input data set.","@ToolTip2":"Orders values by their ascending formatted values. This order depends on your operating environment.","@ToolTip3":"Orders values by descending frequency count so that levels with the most observations are listed first.","@ToolTip4":"Orders values by their unformatted values, which yields the same order as PROC SORT. This order  depends on your operating environment."}},{"ProcedureOptionName":"OUTEST=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUTEST=SAS-data-set] \n      \nSpecifies a SAS data set to contain the parameter estimates and, if the COVOUT option \nis specified, their estimated covariances."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"PLOTS=|PLOT=","ProcedureOptionHelp":{"#cdata":"Specifies options that control details of the plots created by ODS Graphics.\n      \nSyntax: \n(1) PLOT | PLOTS <=plot-request>       \n(2) PLOT | PLOTS <=(plot-request < ...plot-request > )> "},"ProcedureOptionType":"S|V","ProcedureOptionValues":{"@Value1":"ALL","@Value2":"CDFPLOT","@Value3":"IPPPLOT","@Value4":"LPREDPLOT","@Value5":"NONE","@Value6":"PREDPPLOT"},"ProcedureOptionToolTips":{"@ToolTip1":"Creates all appropriate plots.","@ToolTip2":"Syntax: CDFPLOT<(LEVEL=(character-list))>                                  Requests the plot of predicted cumulative distribution function (CDF) of the multinomial response  variable as a function of a single continuous independent variable (dose variable).","@ToolTip3":"Requests the inverse plot of the predicted probability against the first single continuous variable  (dose variable) in the MODEL statement for the binomial model.","@ToolTip4":"Syntax: LPREDPLOT<(LEVEL=(character-list))>                                  Requests the plot of the linear predictor x'b against the first single continuous variable (dose variable) in the MODEL statement for either the binomial model or the multinomial model.","@ToolTip5":"Suppresses all plots.","@ToolTip6":"Syntax: PREDPPLOT<(LEVEL=(character-list))>                                  Requests the plot of the predicted probability against the first single continuous variable (dose variable) in the MODEL statement for both the binomial model and the multinomial model."}},{"ProcedureOptionName":"XDATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: XDATA=SAS-data-set] \n      \nSpecifies an input SAS data set that contains values for all the independent variables \nin the MODEL statement and variables in the CLASS statement."},"ProcedureOptionType":"V"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nYou can specify a BY statement with PROC PROBIT to obtain separate analyses on \nobservations in groups that are defined by the BY variables. When a BY statement \nappears, the procedure expects the input data set to be sorted in order of the BY \nvariables. If you specify more than one BY statement, only the last one specified \nis used."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"WEIGHT","StatementHelp":{"#cdata":"Syntax: WEIGHT variable;\n      \nA WEIGHT statement can be used with PROC PROBIT to weight each observation by the value of the \nvariable specified. The contribution of each observation to the likelihood function is multiplied \nby the value of the weight variable."},"StatementOptions":null},{"StatementName":"CLASS","StatementHelp":{"#cdata":"Syntax: CLASS variables ;\n      \nThe CLASS statement names the classification variables to be used in the analysis. \nClassification variables can be either character or numeric. Observations with zero, \nnegative, or missing weights are not used in model estimation. "},"StatementOptions":null},{"StatementName":"EFFECTPLOT","StatementHelp":{"#cdata":"Syntax: EFFECTPLOT <plot-type <(plot-definition-options)>> </ options> ; \n      \nThe EFFECTPLOT statement produces a display of the fitted model and provides options \nfor changing and enhancing the displays."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"BOX","StatementOptionHelp":{"#cdata":"Displays a box plot of continuous response data at each level of a CLASS effect, with \npredicted values superimposed and connected by a line. This is an alternative to the \nINTERACTION plot-type."},"StatementOptionType":"RS","SubOptionsKeywords":"PLOTBY=|X="},{"StatementOptionName":"CONTOUR","StatementOptionHelp":{"#cdata":"Displays a contour plot of predicted values against two continuous covariates."},"StatementOptionType":"RS","SubOptionsKeywords":"PLOTBY=|X=|Y="},{"StatementOptionName":"FIT","StatementOptionHelp":{"#cdata":"Displays a curve of predicted values versus a continuous variable."},"StatementOptionType":"RS","SubOptionsKeywords":"PLOTBY=|X="},{"StatementOptionName":"INTERACTION","StatementOptionHelp":{"#cdata":"Displays a curve of predicted values versus a continuous variable grouped by the levels \nof a CLASS effect."},"StatementOptionType":"RS","SubOptionsKeywords":"PLOTBY=|SLICEBY=|X="},{"StatementOptionName":"SLICEFIT","StatementOptionHelp":{"#cdata":"[Syntax: ]"},"StatementOptionType":"RS","SubOptionsKeywords":"PLOTBY=|SLICEBY=|X="},{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=value] \n          \nSpecifies the significance level, 0 ≥ value ≥ 1, for producing 100(1-value/2)% \nprediction and confidence limits. By default, value=0.05."},"StatementOptionType":"V"},{"StatementOptionName":"AT","StatementOptionHelp":{"#cdata":"[Syntax: AT <contopt> <classopt> <variable1=varopt <variable2=varopt...>> \n\nwhere contopt= MEAN | MIN | MAX | MIDRANGE \nclassopt= ALL | REF \nvaropt= contopts | number-list |  classopts | ’class-level’...’class-level’] \n\nSpecifies values at which to fix continuous and class variables when they are not used \nin X=, Y=, SLICEBY=, or PLOTBY= effects. The contopt keyword fixes continuous variables \nat their mean, minimum, maximum, or midrange; the default is to use the mean. The classopt \nkeyword either fixes a CLASS variable at its reference (last) level or indicates that all \nlevels of the CLASS variable should be processed; the default is to use the reference level. \nThe varopt values enable you to specify contopt and classopt keywords, or to specify lists \nof numbers or class levels. You can specify a CLASS variable only once in the AT specification, \nbut you can specify a continuous variable multiple times."},"StatementOptionType":"S"},{"StatementOptionName":"ATLEN=","StatementOptionHelp":{"#cdata":"[Syntax: ATLEN=n] \n          \nSpecifies the maximum length (1 < n < 256) of the levels of the AT variables that are displayed \nin footnotes and headers. By default, up to 256 characters of the CLASS levels are displayed, \nand the continuous AT levels are displayed with a BEST format that has a width greater than \nor equal to 5, which distinguishes each level. Caution:If the levels of your AT variables are \nnot unique when the first n characters are displayed, then the levels are combined in the plots \nbut not in the underlying computations. Also, at most n characters for continuous AT variables \nare displayed."},"StatementOptionType":"V"},{"StatementOptionName":"ATORDER=","StatementOptionHelp":{"#cdata":"Uses the AT values for continuous variables in ascending or descending order as specified. \nBy default, values are used in the order of their first appearance in the AT option."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ASCENDING","@Value2":"DESCENDING"},"StatementOptionToolTips":{"@ToolTip1":"Uses the AT values for continuous variables in ascending order","@ToolTip2":"Uses the AT values for continuous variables in descending order"}},{"StatementOptionName":"CLI","StatementOptionHelp":{"#cdata":"Displays normal (Wald) prediction limits. This option is available only for normal \ndistributions with identity links. If your model is from a Bayesian analysis, then \nsampling-based intervals are computed."},"StatementOptionType":"S"},{"StatementOptionName":"CLM","StatementOptionHelp":{"#cdata":"Displays confidence limits. These are computed as the normal (Wald) confidence limits \nfor the linear predictor, and if the ILINK option is specified, the limits are also \nback-transformed by the inverse link function. If your model is from a Bayesian analysis, \nthen sampling-based intervals are computed."},"StatementOptionType":"S"},{"StatementOptionName":"CLUSTER","StatementOptionHelp":{"#cdata":"Syntax: CLUSTER<=percent> \n          \nModifies the BOX and INTERACTION plot-types by displaying the levels of the SLICEBY= effect in \na side-by-side fashion. You can specify percent as a percentage of half the distance between X \nlevels. The percent value must be between 0.1 and 1; the default percent depends on the number \nof X levels, the number of SLICEBY levels, and the number of PLOTBY levels for INTERACTION \nplot-types. Default clustering can be removed by specifying the NOCLUSTER option."},"StatementOptionType":"S|V"},{"StatementOptionName":"CONNECT","StatementOptionHelp":{"#cdata":"Modifies the BOX and INTERACTION plot-types by connecting the predicted values with a line. \nDefault connecting lines can be removed by specifying the NOCONNECT option."},"StatementOptionType":"S"},{"StatementOptionName":"EXTEND=","StatementOptionHelp":{"#cdata":"Extends continuous covariate axes by value x ½range in both directions, where range \nis the range of the X axis."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"DATA","@Value2":"<value>"},"StatementOptionToolTips":{"@ToolTip1":"Displays curves to the range of the data within the appropriate SLICEBY=, PLOTBY=, and AT level.","@ToolTip2":"Replace <value> with an actual value."}},{"StatementOptionName":"GRIDSIZE=","StatementOptionHelp":{"#cdata":"[Syntax: GRIDSIZE=n] \n          \nSpecifies the resolution of curves by computing the predicted values at n equally spaced \nx-values and specifies the resolution of surfaces by computing the predicted values on an \nnxn grid of points. Default values are n=200 for curves and bands, n=50 for surfaces, and \nn=2 for lines. If results of a Bayesian or bootstrap analysis are being displayed, then \nthe defaults are n=500000/B, where B is the number of samples, the upper limit is equal \nto the usual defaults, and the lower limit equal to 20."},"StatementOptionType":"V"},{"StatementOptionName":"ILINK","StatementOptionHelp":{"#cdata":"Displays the fit on the scale of the inverse link function. In particular, the results \nare displayed on the probability scale for logistic regression. By default, a procedure \ndisplays the fit on either the link or inverse link scale."},"StatementOptionType":"S"},{"StatementOptionName":"INDIVIDUAL","StatementOptionHelp":{"#cdata":"Displays individual probabilities for polytomous response models with cumulative links \non the scale of the inverse link function. This option is not available when the LINK \noption is specified, and confidence limits are not available with this option."},"StatementOptionType":"S"},{"StatementOptionName":"LIMITS","StatementOptionHelp":{"#cdata":"Invokes the CLI and CLM options."},"StatementOptionType":"S"},{"StatementOptionName":"LINK","StatementOptionHelp":{"#cdata":"Displays the fit on the scale of the link function; that is, the linear predictor. \nNote that probabilities or observed proportions near 0 and 1 are transformed to . \nBy default, a procedure displays the fit on either the link or inverse link scale."},"StatementOptionType":"S"},{"StatementOptionName":"MOFF","StatementOptionHelp":{"#cdata":"Moves the offset for a Poisson regression model to the response side of the equation. \nIf the ILINK option is also in effect, then the rate is displayed on the Y axis, while \nthe LINK option displays the log of the rate on the Y axis. Without this option, the \npredicted values are computed and displayed only for the observations."},"StatementOptionType":"S"},{"StatementOptionName":"NCOLS=","StatementOptionHelp":{"#cdata":"[Syntax: NCOLS=n] \n          \nSpecifies the maximum number of columns in a paneled plot. This option is not available \nwith the BOX plot-type. \n\nThe default choice of NROWS= and NCOLS= is based on the number of PLOTBY= and AT levels. \nIf there is only one plot being displayed in a panel, then NROWS=1 and NCOLS=1 and the \nplots are produced as if you specified only the UNPACK option. If only two plots are \ndisplayed in a panel, then NROWS=1 and NCOLS=2. For all other cases, a 2x2, 2x3, or 3x3 \npanel is chosen based on how much of the last panel is used, with ties going to the larger \npanels. For example, if 14 plots are being created, then this requires either four 2x2 \npanels with 50% of the last panel filled, three 2x3 panels with 33% of the last panel \nfilled, or two 3x3 panels with 55% of the last panel filled; in this case, the 3x3 panels \nare chosen. \n\nIf you specify both of the NROWS= and NCOLS= options, then those are the values used. However, \nif you only specify one of the options but have fewer plots, then the panel size is reduced; \nfor example, if you specify NROWS=6 but only have four plots, then a plot with four rows and \none column is produced."},"StatementOptionType":"V"},{"StatementOptionName":"NOCLI","StatementOptionHelp":{"#cdata":"Suppresses the prediction limits."},"StatementOptionType":"S"},{"StatementOptionName":"NOCLM","StatementOptionHelp":{"#cdata":"Suppresses the confidence limits."},"StatementOptionType":"S"},{"StatementOptionName":"NOLIMITS","StatementOptionHelp":{"#cdata":"Invokes the NOCLI and NOCLM options."},"StatementOptionType":"S"},{"StatementOptionName":"NOOBS","StatementOptionHelp":{"#cdata":"Suppresses the display of observations and overrides the specification of the OBS= option."},"StatementOptionType":"S"},{"StatementOptionName":"NROWS=","StatementOptionHelp":{"#cdata":"[Syntax: NROWS=n] \n          \nSpecifies the maximum number of rows in a paneled plot. This option is not available \nwith the BOX plot-type. See the NCOLS= option for more details."},"StatementOptionType":"V"},{"StatementOptionName":"OBS","StatementOptionHelp":{"#cdata":"[Syntax: OBS<(options)>] \n          \nDisplays observations on the effect plots. An input data set is required; hence the OBS option \nis not available with PROC PLM. The OBS option is overridden by the NOOBS option. When the ILINK \noption is specified with binary response variables, then either the observed proportions or a coded \nvalue of the response is displayed. For polytomous response variables, the observed values are overlaid \nonto the fitted curves unless the LOCATION= option is specified. Whether observations are displayed by \ndefault or not depends upon the procedure. If the PLOTBY= option is specified, then the observations \ndisplayed on each plot are from the corresponding PLOTBY= level for classification effects; for \ncontinuous effects, all observations are displayed on every plot. \n\nThe following options are available: \n\n  BYAT -- subsets the observations by AT level and by the PLOTBY= level. \n\n  CDISPLAY=NONE | OUTLINE | GRADIENT | OUTLINEGRADIENT \n  controls the display of observations on contour plots. \n\n  CGRADIENT=RESIDUAL | DEPENDENT \n  specifies what the gradient-shading of the observed values on the CONTOUR plot-type represents. \n\n  DEPTH=depth (you can specify 1 ≤ depth ≤ 100. By default, DEPTH=1)\n  specifies the number of overlapping observations that can be distinguished by adjusting their transparency.\n\n  DISTANCE \n  displays observations on FIT plot-types with a color-gradient that indicates how far the \n  observation is from the AT and PLOTBY= level. \n\n  FITATCLASS --  computes fitted values only for class levels that are observed in the data set.  \n\n  FRINGE -- displays observations in a fringe (rug) plot at the bottom of the plot.  \n\n  JITTER<(FACTOR=factor SEED=seed X=x-jitter Y=y-jitter)> --  shifts (jitters) the observations. \n  \n  LABEL<=OBS> --  labels markers with their observation number. \n\n  LOCATION= BOTTOM | CURVE | FIRST | MAX | MIDDLE | MIN | SPREAD | TOP<=factor>\n  specifies where the observed values for polytomous response models are displayed when the SLICEBY= variable is the response."},"StatementOptionType":"S","SubOptionsKeywords":"BYAT|CDISPLAY=|CGRADIENT=|DEPTH=|DISTANCE|FITATCLASS|FRINGE|JITTER|FACTOR=|SEED=|X=|Y=|LABEL|LABEL=|LOCATION="},{"StatementOptionName":"PLOTBY=","StatementOptionHelp":{"#cdata":"[Syntax: PLOTBY<(panel-type)>=effect<=numeric-list>] \n          \nSpecifies a variable or CLASS effect at whose levels the predicted values are computed \nand the plots are displayed. You can specify the response variable as the effect for \npolytomous response models. The panel-type argument specifies the method in which the \nplots are grouped for the display. The following panel-types are available. \n\n  COLUMNS \n  specifies that the columns within each panel correspond to different levels of the PLOTBY= \n  effect and hence the rows correspond to different AT levels. \n\n  PACK \n  specifies that plots be displayed in the panels as they are produced with no control over \n  the placement of the PLOTBY= and AT levels. \n\n  PANELS | LEVELS \n  specifies that each level of the PLOTBY= effect begin a new panel of plots and the AT \n  levels define the plots within the panels. \n\n  ROWS \n  specifies that the rows within each panel correspond to different levels of the PLOTBY= \n  effect and hence the columns correspond to different AT levels. \n\nThis option is ignored with the BOX plot-type; box plots are always displayed in an unpacked \nfashion, grouped by the PLOTBY= and AT levels. If you specify a continuous variable as the \neffect, then you can either specify a numeric-list of values at which to display that variable \nor, by default, five equally spaced values from the minimum variable value to its maximum are \ndisplayed."},"StatementOptionType":"S|V","SubOptionsKeywords":"COLUMNS|PACK|PANELS|LEVELS|ROWS"},{"StatementOptionName":"PLOTBYLEN=","StatementOptionHelp":{"#cdata":"[Syntax: PLOTBYLEN=n] \n          \nSpecifies the maximum length (1 ≤ n ≤ 256) of the levels of the PLOTBY= variables, which are displayed \nin footnotes and headers. By default, up to 256 characters of the CLASS levels are displayed. \n\nCaution:If the levels of your PLOTBY= variables are not unique when the first n characters \nare displayed, then the levels are combined in the plots but not in the underlying computations."},"StatementOptionType":"V"},{"StatementOptionName":"POLYBAR","StatementOptionHelp":{"#cdata":"Displays polytomous response data as a stacked histogram with bar heights defined \nby the individual predicted value. Your response variable must be the SLICEBY= \nvariable, and the INDIVIDUAL and ILINK options must be in effect; otherwise, the \noption is ignored. Confidence limits are ignored."},"StatementOptionType":"S"},{"StatementOptionName":"PREDLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: PREDLABEL=label] \n          \nSpecifies a label to be displayed on the Y axis. The default Y axis label is determined \nby your model. For the CONTOUR plot-type, this option changes the title to \"label for Y.\""},"StatementOptionType":"V"},{"StatementOptionName":"SHOWCLEGEND","StatementOptionHelp":{"#cdata":"Displays the gradient-legend for the CONTOUR plot-type. This option has no effect \nwhen the OBS(CGRADIENT=RESIDUAL) option is also specified."},"StatementOptionType":"S"},{"StatementOptionName":"SLICEBY=","StatementOptionHelp":{"#cdata":"[Syntax: SLICEBY=NONE | effect<=numeric-list>] \n          \nDisplays the fitted values at the different levels of the specified variable or CLASS effect."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"NONE","@Value2":"effect<=numeric-list>"},"StatementOptionToolTips":{"@ToolTip1":"Preventing the INTERACTION plot-type from slicing by a second class covariate. Note  that the SLICEBY=NONE option is not available for the SLICEFIT plot-type, since that  is the same as the FIT plot-type.","@ToolTip2":"You can specify the response variable as the effect for polytomous response models. Use   this option to modify SLICEFIT and INTERACTION plot-types. If you specify a continuous  variable as the effect, then you can either specify a numeric-list of values at which  to display that variable or, by default, five equally spaced values from the minimum  variable value to its maximum are displayed."}},{"StatementOptionName":"SMOOTH","StatementOptionHelp":{"#cdata":"Overlays a loess smooth on the FIT plot-type for models that have only one continuous \npredictor. This option is not available for binary or polytomous response models."},"StatementOptionType":"S"},{"StatementOptionName":"UNPACK","StatementOptionHelp":{"#cdata":"Suppresses paneling. By default, multiple plots can appear in some output panels. \nSpecify UNPACK to display each plot separately.]"},"StatementOptionType":"S"},{"StatementOptionName":"X=","StatementOptionHelp":{"#cdata":"[Syntax: X=effect] \n          \nSpecifies values to display on the X axis. For BOX and INTERACTION plot-types, effect \ncan be a CLASS effect in the MODEL statement. For FIT, SLICEFIT, and CONTOUR plot-types, \neffect can be any continuous variable in the model."},"StatementOptionType":"V"},{"StatementOptionName":"Y=","StatementOptionHelp":{"#cdata":"[Syntax: Y=args] \n          \nSpecifies values to display on the Y axis for the CONTOUR plot-type. The Y= argument \ncan be any continuous variable in the model."},"StatementOptionType":"V"},{"StatementOptionName":"YRANGE=","StatementOptionHelp":{"#cdata":"Displays the predicted values on the Y axis in the range [min,max]. \n          \nBy default, when the Y axis displays predicted probabilities, the entire Y axis, [0,1], \nis displayed. This option is useful if your predicted probabilities are all contained \nin some subset of this range. This option is not available with the CONTOUR plot-type. "},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"CLIP","@Value2":"<(<min><,max>)>"},"StatementOptionToolTips":{"@ToolTip1":"Has the same effect as specifying the minimum predicted value as min and the maximum predicted value as max.","@ToolTip2":"Replace min and max with actual values."}}],"#comment":{}}},{"StatementName":"ESTIMATE","StatementHelp":{"#cdata":"Syntax: ESTIMATE ’label’ contrast-specification <(divisor=n)>\n    <, ’label’ contrast-specification <(divisor=n)> > <, ...>  < / options> ; \n\nThe ESTIMATE statement provides a mechanism for obtaining custom hypothesis tests."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ADJDFE=","StatementOptionHelp":{"#cdata":"Specifies how denominator degrees of freedom are determined when p-values and confidence limits are adjusted\nfor multiple comparisons with the ADJUST= option."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"SOURCE","@Value2":"ROW"},"StatementOptionToolTips":{"@ToolTip1":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of  freedom for the final effect listed in the ESTIMATE statement from the 'Type III Tests of Fixed Effects' table.","@ToolTip2":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom  are not constant across estimates."}},{"StatementOptionName":"ADJUST=","StatementOptionHelp":{"#cdata":"Requests a multiple comparison adjustment for the p-values and confidence limits for the estimates."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BON","@Value2":"SCHEFFE","@Value3":"SIDAK","@Value4":"SIMULATE<(simoptions)>","@Value5":"T"},"StatementOptionToolTips":{"@ToolTip1":"Bonferroni adjustment","@ToolTip2":"Scheffe's adjustment","@ToolTip3":"Sidak adjustment","@ToolTip4":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or  maximum absolute value of a multivariate t random vector.","@ToolTip5":"The default, which really signifies no adjustment for multiple comparisons."}},{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=number] \n          \nRequests that a t-type confidence interval be constructed with confidence level 1-number. \nThe value of number must be between 0 and 1; the default is 0.05."},"StatementOptionType":"V"},{"StatementOptionName":"BYCATEGORY|BYCAT","StatementOptionHelp":{"#cdata":"Requests that in models for nominal data (generalized logit models) estimates be reported separately \nfor each category."},"StatementOptionType":"S"},{"StatementOptionName":"CL","StatementOptionHelp":{"#cdata":"Requests that t-type confidence limits be constructed."},"StatementOptionType":"S"},{"StatementOptionName":"DF=","StatementOptionHelp":{"#cdata":"[Syntax: DF=number] \n          \nSpecifies the degrees of freedom for the t test and confidence limits."},"StatementOptionType":"V"},{"StatementOptionName":"DIVISOR=","StatementOptionHelp":{"#cdata":"[Syntax: DIVISOR=value-list] \n          \nSpecifies a list of values by which to divide the coefficients so that fractional \ncoefficients can be entered as integer numerators."},"StatementOptionType":"V"},{"StatementOptionName":"E","StatementOptionHelp":{"#cdata":"Requests that the L matrix coefficients be displayed."},"StatementOptionType":"S"},{"StatementOptionName":"EXP","StatementOptionHelp":{"#cdata":"Requests exponentiation of the estimate."},"StatementOptionType":"S"},{"StatementOptionName":"GROUP","StatementOptionHelp":{"#cdata":"[Syntax: GROUP coeffs] \n          \nSets up random-effect contrasts between different groups when a GROUP= variable \nappears in the RANDOM statement."},"StatementOptionType":"S"},{"StatementOptionName":"ILINK","StatementOptionHelp":{"#cdata":"Requests that the estimate and its standard error are also reported on the scale of the mean \n(the inverse linked scale)."},"StatementOptionType":"S"},{"StatementOptionName":"LOWER|LOWERTAILED","StatementOptionHelp":{"#cdata":"Requests that the p-value for the t test be based only on values less than the test statistic."},"StatementOptionType":"S"},{"StatementOptionName":"SINGULAR=","StatementOptionHelp":{"#cdata":"[Syntax: SINGULAR=number] \n          \nTunes the estimability checking as documented for the CONTRAST statement."},"StatementOptionType":"V"},{"StatementOptionName":"STEPDOWN","StatementOptionHelp":{"#cdata":"[Syntax: STEPDOWN<(step-down-options)>] \n          \nRequests that multiplicity adjustments for the p-values of estimates be further \nadjusted in a step-down fashion."},"StatementOptionType":"S"},{"StatementOptionName":"SUBJECT","StatementOptionHelp":{"#cdata":"[Syntax: SUBJECT coeffs] \n          \nSets up random-effect contrasts between different subjects when a SUBJECT= variable \nappears in the RANDOM statement."},"StatementOptionType":"S"},{"StatementOptionName":"UPPER|UPPERTAILED","StatementOptionHelp":{"#cdata":"Requests that the p-value for the t test be based only on values greater than the \ntest statistic."},"StatementOptionType":"S"}]}},{"StatementName":"LSMEANS","StatementHelp":{"#cdata":"Syntax: LSMEANS fixed-effects </ options> ; \n     \nThe LSMEANS statement computes least squares means (LS-means) of fixed effects. As \nin the GLM and the MIXED procedures, LS-means are predicted population margins—that \nis, they estimate the marginal means over a balanced population. In a sense, LS-means \nare to unbalanced designs as class and subclass arithmetic means are to balanced \ndesigns."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ADJDFE=","StatementOptionHelp":{"#cdata":"Specifies how denominator degrees of freedom are determined when p-values and confidence limits are adjusted\nfor multiple comparisons with the ADJUST= option."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"SOURCE","@Value2":"ROW"},"StatementOptionToolTips":{"@ToolTip1":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of  freedom for the LS-mean effect in the \"Type III Tests of Fixed Effects\" table.","@ToolTip2":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom  are not constant across LS-mean differences."}},{"StatementOptionName":"ADJUST=","StatementOptionHelp":{"#cdata":"Requests a multiple comparison adjustment for the p-values and confidence limits for the differences \nof LS-means."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BON","@Value2":"DUNNETT","@Value3":"NELSON","@Value4":"SCHEFFE","@Value5":"SIDAK","@Value6":"SIMULATE","@Value7":"SMM|GT2","@Value8":"TUKEY"},"StatementOptionToolTips":{"@ToolTip1":"Bonferroni adjustment","@ToolTip2":"Dunnett adjustment (in which the procedure analyzes all differences with a control level)","@ToolTip3":"Nelson adjustment (in which ANOM differences are taken)","@ToolTip4":"Scheffe's adjustment","@ToolTip5":"Sidak adjustment","@ToolTip6":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or  maximum absolute value of a multivariate t random vector.  Syntax: SIMULATE<(simoptions)>  You can specify the following simoptions in parentheses after the ADJUST=SIMULATE option.       ACC=value      specifies the target accuracy radius γ of a 100(1-ε)% confidence interval for the true      probability content of the estimated (1-α)th quantile. The default value is ACC=0.005.       CVADJUST      specifies that the quantile should be estimated by the control variate adjustment method of     Hsu and Nelson (1998) instead of simply as the quantile of the simulated sample.      EPS=value      specifies the value ε for a 100(1-ε)% confidence interval for the true probability      content of the estimated (1-α)th quantile.       NSAMP=n      specifies the sample size for the simulation.       REPORT      specifies that a report on the simulation should be displayed, including a listing of the parameters,     such as γ, ε, and α, as well as an analysis of various methods for estimating or approximating      the quantile.       SEED=number      specifies an integer used to start the pseudo-random number generator for the simulation.","@ToolTip7":"SMM adjustment","@ToolTip8":"If your data are unbalanced, PROC GLIMMIX uses the approximation described in Kramer (1956) and  identifies the adjustment as \"Tukey-Kramer\" in the results."},"SubOptionsKeywords":"ACC=|CVADJUST|EPS=|NSAMP=|REPORT|SEED="},{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=number] \n          \nRequests that a t-type confidence interval be constructed for each of the LS-means \nwith confidence level (1-number)x100%. The value of number must be between 0 and 1; \nthe default value is 0.05, corresponding to a 95% confidence interval."},"StatementOptionType":"V"},{"StatementOptionName":"AT","StatementOptionHelp":{"#cdata":"[Syntax: AT variable=value | AT(variable-list)=(value-list) | AT MEANS] \n          \nEnables you to modify the values of the covariates used in computing LS-means."},"StatementOptionType":"S|V","SubOptionsKeywords":"MEANS"},{"StatementOptionName":"BYLEVEL","StatementOptionHelp":{"#cdata":"Requests that separate margins be computed for each level of the LSMEANS effect."},"StatementOptionType":"S"},{"StatementOptionName":"CL","StatementOptionHelp":{"#cdata":"Requests that t-type confidence limits be constructed for each of the LS-means. The confidence level \nis 0.95 by default; this can be changed with the ALPHA= option."},"StatementOptionType":"S"},{"StatementOptionName":"CORR","StatementOptionHelp":{"#cdata":"Displays the estimated correlation matrix of the least squares means as part of the \"Least Squares Means\" table."},"StatementOptionType":"S"},{"StatementOptionName":"COV","StatementOptionHelp":{"#cdata":"Displays the estimated covariance matrix of the least squares means as part of the \"Least Squares Means\" table."},"StatementOptionType":"S"},{"StatementOptionName":"DF=","StatementOptionHelp":{"#cdata":"[Syntax: DF=number] \n          \nSpecifies the degrees of freedom for the t test and confidence limits."},"StatementOptionType":"V"},{"StatementOptionName":"DIFF=|PDIFF=","StatementOptionHelp":{"#cdata":"[Syntax: DIFF<=difftype>] \n          \nRequests that differences of the LS-means be displayed."},"StatementOptionType":"S|V","StatementOptionValues":{"@Value1":"ALL","@Value2":"ANOM","@Value3":"CONTROL","@Value4":"CONTROLL","@Value5":"CONTROLU"},"StatementOptionToolTips":{"@ToolTip1":"Requests all pairwise differences, and it is the default.","@ToolTip2":"Requests differences between each LS-mean and the average LS-mean, as in the analysis of means (Ott 1967).","@ToolTip3":"Requests the differences with a control, which, by default, is the first level of each of the  specified LSMEANS effects.","@ToolTip4":"Tests whether the noncontrol levels are significantly smaller than the control; the upper confidence  limits for the control minus the noncontrol levels are considered to be infinity and are displayed as missing.","@ToolTip5":"Tests whether the noncontrol levels are significantly larger than the control; the upper confidence  limits for the noncontrol levels minus the control are considered to be infinity and are displayed as missing."}},{"StatementOptionName":"E","StatementOptionHelp":{"#cdata":"Requests that the L matrix coefficients for all LSMEANS effects be displayed."},"StatementOptionType":"S"},{"StatementOptionName":"ILINK","StatementOptionHelp":{"#cdata":"Requests that estimates and their standard errors in the \"Least Squares Means\" table also be reported \non the scale of the mean (the inverse linked scale)."},"StatementOptionType":"S"},{"StatementOptionName":"LINES","StatementOptionHelp":{"#cdata":"Presents results of comparisons between all pairs of least squares means by listing the means in descending \norder and indicating nonsignificant subsets by line segments beside the corresponding LS-means."},"StatementOptionType":"S"},{"StatementOptionName":"ODDS","StatementOptionHelp":{"#cdata":"Requests that in models with logit, cumulative logit, and generalized logit link function the odds of the \nlevels of the fixed effects are reported."},"StatementOptionType":"S"},{"StatementOptionName":"ODDSRATIO|OR","StatementOptionHelp":{"#cdata":"Requests that LS-mean differences (DIFF, ADJUST= options) and simple effect comparisons (SLICEDIFF option) \nare also reported in terms of odds ratios."},"StatementOptionType":"S"},{"StatementOptionName":"OBSMARGINS|OM","StatementOptionHelp":{"#cdata":"Specifies a potentially different weighting scheme for the computation of LS-means coefficients."},"StatementOptionType":"S"},{"StatementOptionName":"PLOT=|PLOTS=","StatementOptionHelp":{"#cdata":"Requests that least squares means related graphics are produced via ODS Graphics, provided that the \nODS GRAPHICS statement has been specified and the plot request does not conflict with other options \nin the LSMEANS statement.\n\nSyntax:\n(1) PLOT | PLOTS<=plot-request<(options)>> \n(2) PLOT | PLOTS<=(plot-request<(options)> <...plot-request<(options)> >)>"},"StatementOptionType":"S|V","StatementOptionValues":{"@Value1":"ALL","@Value2":"ANOMPLOT|ANOM","@Value3":"CONTROLPLOT|CONTROL","@Value4":"DIFFPLOT|DIFFOGRAM|DIFF","@Value5":"MEANPLOT","@Value6":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Requests that the default plots corresponding to this LSMEANS statement be produced.","@ToolTip2":"Requests an analysis of means display in which least squares means are compared to an  average least squares mean.","@ToolTip3":"Requests a display in which least squares means are visually compared against a reference level.","@ToolTip4":"Requests a display of all pairwise least squares mean differences and their significance.  Syntax: DIFFPLOT<(diffplot-options)>  You can specify the following diffplot-options:       ABS     all line segments are shown on the same side of the reference line.       NOABS      separates comparisons according to the sign of the difference.       CENTER      marks the center point for each comparison.       NOLINES      suppresses the display of the line segments that represent the confidence bounds for the differences     of the least squares means. The NOLINES option implies the CENTER option.","@ToolTip5":"Requests displays of the least squares means.   Syntax: MEANPLOT<(meanplot-options)>  The following meanplot-options control the display of the least squares means:      ASCENDING      displays the least squares means in ascending order. This option has no effect if means are sliced      or displayed in separate plots.       CL      displays upper and lower confidence limits for the least squares means. By default, 95% limits are drawn.      CLBAND      displays confidence limits as bands. This option implies the JOIN option.       DESCENDING      displays the least squares means in descending order. This option has no effect if means are sliced     or displayed in separate plots.       ILINK      requests that means (and confidence limits) are displayed on the inverse linked scale.       JOIN | CONNECT      connects the least squares means with lines. This option is implied by the CLBAND option.          SLICEBY=fixed-effect      specifies an effect by which to group the means in a single plot.      PLOTBY=fixed-effect      specifies an effect by which to break interaction plots into separate displays.","@ToolTip6":"Requests that no plots be produced."},"SubOptionsKeywords":"ABS|NOABS|CENTER|NOLINES|ASCENDING|CL|CLBAND|DESCENDING|ILINK|JOIN|CONNECT|SLICEBY=|PLOTBY="},{"StatementOptionName":"SINGULAR=","StatementOptionHelp":{"#cdata":"[Syntax: SINGULAR=number] \n          \nTunes the estimability checking as documented for the CONTRAST statement."},"StatementOptionType":"V"},{"StatementOptionName":"SLICE=","StatementOptionHelp":{"#cdata":"[Syntax:SLICE=fixed-effect] \n          \nSpecifies effects by which to partition interaction LSMEANS effects."},"StatementOptionType":"V"},{"StatementOptionName":"SLICEDIFF=|SIMPLEDIFF=","StatementOptionHelp":{"#cdata":"[Syntax: SLICEDIFF=fixed-effect | SLICEDIFF=(fixed-effects)] \n          \nRequests that differences of simple effects be constructed and tested against zero."},"StatementOptionType":"V"},{"StatementOptionName":"SLICEDIFFTYPE=|SIMPLEDIFFTYPE=","StatementOptionHelp":{"#cdata":"[Syntax: SLICEDIFFTYPE<=difftype>] \n          \nDetermines the type of simple effect differences produced with the SLICEDIFF= option."},"StatementOptionType":"S|V","StatementOptionValues":{"@Value1":"ALL","@Value2":"CONTROL","@Value3":"CONTROLL","@Value4":"CONTROLU"},"StatementOptionToolTips":{"@ToolTip1":"Requests all simple effects differences, and it is the default.","@ToolTip2":"Requests the differences with a control, which, by default, is the first level of each of the  specified LSMEANS effects.","@ToolTip3":"Tests whether the noncontrol levels are significantly smaller than the control; the upper confidence  limits for the control minus the noncontrol levels are considered to be infinity and are displayed as missing.","@ToolTip4":"Tests whether the noncontrol levels are significantly larger than the control; the upper confidence  limits for the noncontrol levels minus the control are considered to be infinity and are displayed as missing."}},{"StatementOptionName":"STEPDOWN","StatementOptionHelp":{"#cdata":"[Syntax: STEPDOWN<(step-down options)>] \n          \nRequests that multiple comparison adjustments for the p-values of LS-mean differences \nbe further adjusted in a step-down fashion.\n\nYou can specify the following step-down options in parentheses: \n\n    MAXTIME=n \n    specifies the time (in seconds) to spend computing the maximal logically consistent sequential \n    subsets of equality hypotheses for TYPE=LOGICAL.\n\n    REPORT \n    specifies that a report on the step-down adjustment should be displayed, including a listing of \n    the sequential subsets (Westfall 1997) and, for ADJUST=SIMULATE, the step-down simulation results.\n\n    TYPE=LOGICAL<(n)> \n    TYPE=FREE \n    If you specify TYPE=LOGICAL, the step-down adjustments are computed by using maximal logically \n    consistent sequential subsets of equality hypotheses (Shaffer 1986, Westfall 1997). Alternatively, \n    for TYPE=FREE, sequential subsets are computed ignoring logical constraints. The TYPE=FREE results \n    are more conservative than those for TYPE=LOGICAL, but they can be much more efficient to produce \n    for many comparisons."},"StatementOptionType":"S"}]}},{"StatementName":"LSMESTIMATE","StatementHelp":{"#cdata":"Syntax: LSMESTIMATE fixed-effect <’label’> values <divisor=> \n    <, <’label’> values <divisor=>> <, .\n    ..> < / options> ; \n\nThe LSMESTIMATE statement provides a mechanism for obtaining custom hypothesis tests among the \nleast squares means."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ADJDFE=","StatementOptionHelp":{"#cdata":"Specifies how denominator degrees of freedom are determined when p-values and confidence \nlimits are adjusted for multiple comparisons with the ADJUST= option."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"SOURCE","@Value2":"ROW"},"StatementOptionToolTips":{"@ToolTip1":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of  freedom for the LS-mean effect in the \"Type III Tests of Fixed Effects\" table.","@ToolTip2":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom  are not constant across estimates."}},{"StatementOptionName":"ADJUST=","StatementOptionHelp":{"#cdata":"Requests a multiple comparison adjustment for the p-values and confidence limits for the estimates."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BON","@Value2":"SCHEFFE","@Value3":"SIDAK","@Value4":"SIMULATE","@Value5":"T"},"StatementOptionToolTips":{"@ToolTip1":"Bonferroni adjustment","@ToolTip2":"Scheffe's adjustment","@ToolTip3":"Sidak adjustment","@ToolTip4":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or  maximum absolute value of a multivariate t random vector.  Syntax: SIMULATE<(simoptions)>  You can specify the following simoptions in parentheses after the ADJUST=SIMULATE option.       ACC=value      specifies the target accuracy radius γ of a 100(1-ε)% confidence interval for the true      probability content of the estimated (1-α)th quantile. The default value is ACC=0.005.       CVADJUST      specifies that the quantile should be estimated by the control variate adjustment method of     Hsu and Nelson (1998) instead of simply as the quantile of the simulated sample.      EPS=value      specifies the value ε for a 100(1-ε)% confidence interval for the true probability      content of the estimated (1-α)th quantile.       NSAMP=n      specifies the sample size for the simulation.       REPORT      specifies that a report on the simulation should be displayed, including a listing of the parameters,     such as γ, ε, and α, as well as an analysis of various methods for estimating or approximating      the quantile.       SEED=number      specifies an integer used to start the pseudo-random number generator for the simulation.","@ToolTip5":"The default, which really signifies no adjustment for multiple comparisons."}},{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=number] \n          \nRequests that a t-type confidence interval be constructed with confidence level 1-number. \nThe value of number must be between 0 and 1; the default is 0.05."},"StatementOptionType":"V"},{"StatementOptionName":"AT","StatementOptionHelp":{"#cdata":"[Syntax: AT variable=value | AT(variable-list)=(value-list) | AT MEANS] \n          \nEnables you to modify the values of the covariates used in computing LS-means."},"StatementOptionType":"S|V","SubOptionsKeywords":"MEANS"},{"StatementOptionName":"BYLEVEL","StatementOptionHelp":{"#cdata":"Requests that PROC GLIMMIX compute separate margins for each level of the LSMEANS effect."},"StatementOptionType":"S"},{"StatementOptionName":"CHISQ","StatementOptionHelp":{"#cdata":"Requests that chi-square tests be performed in addition to F tests, when you request \nan F test with the FTEST option."},"StatementOptionType":"S"},{"StatementOptionName":"CL","StatementOptionHelp":{"#cdata":"Requests that t-type confidence limits be constructed."},"StatementOptionType":"S"},{"StatementOptionName":"CORR","StatementOptionHelp":{"#cdata":"Displays the estimated correlation matrix of the linear combination of the least squares means."},"StatementOptionType":"S"},{"StatementOptionName":"COV","StatementOptionHelp":{"#cdata":"Displays the estimated covariance matrix of the linear combination of the least squares means."},"StatementOptionType":"S"},{"StatementOptionName":"DF=","StatementOptionHelp":{"#cdata":"[Syntax: DF=number] \n          \nSpecifies the degrees of freedom for the t test and confidence limits."},"StatementOptionType":"V"},{"StatementOptionName":"DIVISOR=","StatementOptionHelp":{"#cdata":"[Syntax: DIVISOR=value-list] \n          \nSpecifies a list of values by which to divide the coefficients so that fractional \ncoefficients can be entered as integer numerators."},"StatementOptionType":"V"},{"StatementOptionName":"E","StatementOptionHelp":{"#cdata":"Requests that the L matrix coefficients be displayed."},"StatementOptionType":"S"},{"StatementOptionName":"ELSM","StatementOptionHelp":{"#cdata":"Requests that the K matrix coefficients be displayed."},"StatementOptionType":"S"},{"StatementOptionName":"EXP","StatementOptionHelp":{"#cdata":"Requests exponentiation of the estimate."},"StatementOptionType":"S"},{"StatementOptionName":"FTEST","StatementOptionHelp":{"#cdata":"[Syntax: FTEST<(LABEL=’label’)>] \n          \nProduces an F test that jointly tests the rows of the LSMESTIMATE against zero."},"StatementOptionType":"S"},{"StatementOptionName":"ILINK","StatementOptionHelp":{"#cdata":"Requests that the estimate and its standard error are also reported on the scale of the \nmean (the inverse linked scale)."},"StatementOptionType":"S"},{"StatementOptionName":"LOWER|LOWERTAILED","StatementOptionHelp":{"#cdata":"Requests that the p-value for the t test be based only on values less than the test statistic."},"StatementOptionType":"S"},{"StatementOptionName":"OBSMARGINS|OM","StatementOptionHelp":{"#cdata":"Specifies a potentially different weighting scheme for the computation of LS-means coefficients."},"StatementOptionType":"S"},{"StatementOptionName":"SINGULAR=","StatementOptionHelp":{"#cdata":"[Syntax: SINGULAR=number] \n          \nTunes the estimability checking as documented for the CONTRAST statement."},"StatementOptionType":"V"},{"StatementOptionName":"STEPDOWN","StatementOptionHelp":{"#cdata":"[Syntax: STEPDOWN<(step-down-options)>] \n          \nRequests that multiplicity adjustments for the p-values of estimates be further adjusted \nin a step-down fashion. You can specify the following step-down-options in parentheses: \n\n    MAXTIME=n \n    specifies the time (in seconds) to spend computing the maximal logically consistent sequential subsets \n    of equality hypotheses for TYPE=LOGICAL. The default is MAXTIME=60.\n\n    ORDER=PVALUE \n    ORDER=ROWS \n    specifies the order in which the step-down tests are performed. ORDER=PVALUE is the default, with LS-mean\n    estimates being declared significant only if all LS-mean estimates with smaller (unadjusted) p-values are\n    significant. If you specify ORDER=ROWS, then significances are evaluated in the order in which they are specified. \n\n    REPORT \n    specifies that a report on the step-down adjustment be displayed, including a listing of the sequential \n    subsets (Westfall 1997) and, for ADJUST=SIMULATE, the step-down simulation results. \n\n    TYPE=LOGICAL<(n)> \n    TYPE=FREE \n    If you specify TYPE=LOGICAL, the step-down adjustments are computed by using maximal logically consistent \n    sequential subsets of equality hypotheses (Shaffer 1986, Westfall 1997). Alternatively, for TYPE=FREE, \n    sequential subsets are computed ignoring logical constraints. The TYPE=FREE results are more conservative \n    than those for TYPE=LOGICAL, but they can be much more efficient to produce for many estimates. Default: TYPE=FREE."},"StatementOptionType":"S"},{"StatementOptionName":"UPPER|UPPERTAILED","StatementOptionHelp":{"#cdata":"Requests that the p-value for the t test be based only on values greater than the test statistic."},"StatementOptionType":"S"}]}},{"StatementName":"SLICE","StatementHelp":{"#cdata":"Syntax: SLICE model-effect </ options> ; \n      \nThe SLICE statement provides a general mechanism for performing a partitioned analysis \nof the LS-means for an interaction. This analysis is also known as an analysis of simple \neffects. \n\nThe SLICE statement uses the same options as the LSMEANS statement."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ADJDFE=","StatementOptionHelp":{"#cdata":"Specifies how denominator degrees of freedom are determined when p-values and confidence \nlimits are adjusted for multiple comparisons with the ADJUST= option."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"SOURCE","@Value2":"ROW"},"StatementOptionToolTips":{"@ToolTip1":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees  of freedom for the LS-mean effect in the \"Type III Tests of Fixed Effects\" table.","@ToolTip2":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom  are not constant across LS-mean differences."}},{"StatementOptionName":"ADJUST=","StatementOptionHelp":{"#cdata":"Requests a multiple comparison adjustment for the p-values and confidence limits for the differences \nof LS-means."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BON","@Value2":"DUNNETT","@Value3":"NELSON","@Value4":"SCHEFFE","@Value5":"SIDAK","@Value6":"SIMULATE","@Value7":"SMM|GT2","@Value8":"TUKEY"},"StatementOptionToolTips":{"@ToolTip1":"Bonferroni adjustment","@ToolTip2":"Dunnett adjustment (in which the procedure analyzes all differences with a control level)","@ToolTip3":"Nelson adjustment (in which ANOM differences are taken)","@ToolTip4":"Scheffe's adjustment","@ToolTip5":"Sidak adjustment","@ToolTip6":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or  maximum absolute value of a multivariate t random vector.  Syntax: SIMULATE<(simoptions)>  You can specify the following simoptions in parentheses after the ADJUST=SIMULATE option.       ACC=value      specifies the target accuracy radius γ of a 100(1-ε)% confidence interval for the true      probability content of the estimated (1-α)th quantile. The default value is ACC=0.005.           EPS=value      specifies the value ε for a 100(1-ε)% confidence interval for the true probability      content of the estimated (1-α)th quantile. The default value is ACC=0.005.      NSAMP=n      specifies the sample size for the simulation.       SEED=number      specifies an integer that is used to start the pseudo-random number generator for the simulation.          THREADS      specifies that the computational work for the simulation be divided into parallel threads,      where the number of threads is the value of the SAS system option CPUCOUNT=.           NOTHREADS      specifies that the computational work for the simulation be performed in sequence rather than in      parallel. NOTHREADS is the default. This option overrides the SAS system option THREADS|NOTHREADS.","@ToolTip7":"SMM adjustment","@ToolTip8":"If your data are unbalanced, PROC GLIMMIX uses the approximation described in Kramer (1956)  and identifies the adjustment as \"Tukey-Kramer\" in the results."},"SubOptionsKeywords":"ACC=|EPS=|NSAMP=|SEED=|THREADS|NOTHREADS"},{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=number] \n          \nRequests that a t-type confidence interval be constructed for each of the LS-means \nwith confidence level (1-number)x100%. The value of number must be between 0 and 1; \nthe default is 0.05."},"StatementOptionType":"V"},{"StatementOptionName":"AT","StatementOptionHelp":{"#cdata":"[Syntax: AT variable=value | AT(variable-list)=(value-list) | AT MEANS] \n          \nModifies the values of the covariates that are used in computing LS-means. By default, \nall covariate effects are set equal to their mean values for computation of standard \nLS-means. The AT option enables you to assign arbitrary values to the covariates. \nAdditional columns in the output table indicate the values of the covariates. \n\nIf there is an effect that contains two or more covariates, the AT option sets the \neffect equal to the product of the individual means rather than the mean of the product \n(as with standard LS-means calculations). The AT MEANS option sets covariates equal to \ntheir mean values (as with standard LS-means) and incorporates this adjustment to \ncrossproducts of covariates."},"StatementOptionType":"S|V","SubOptionsKeywords":"MEANS"},{"StatementOptionName":"BYLEVEL","StatementOptionHelp":{"#cdata":"Requests that separate margins be computed for each level of the SLICE model-effect."},"StatementOptionType":"S"},{"StatementOptionName":"CL","StatementOptionHelp":{"#cdata":"Requests that t-type confidence limits be constructed for each of the LS-means. The \nconfidence level is 0.95 by default; this can be changed with the ALPHA= option."},"StatementOptionType":"S"},{"StatementOptionName":"CORR","StatementOptionHelp":{"#cdata":"Displays the estimated correlation matrix of the least squares means as part of the \n\"Least Squares Means\" table."},"StatementOptionType":"S"},{"StatementOptionName":"COV","StatementOptionHelp":{"#cdata":"Displays the estimated covariance matrix of the least squares means as part of the \n\"Least Squares Means\" table."},"StatementOptionType":"S"},{"StatementOptionName":"DF=","StatementOptionHelp":{"#cdata":"[Syntax: DF=number] \n          \nSpecifies the degrees of freedom for the t test and confidence limits. The default is the \ndenominator degrees of freedom taken from the \"Type III Tests\" table that corresponds to \nthe LS-means effect."},"StatementOptionType":"V"},{"StatementOptionName":"DIFF=|PDIFF=","StatementOptionHelp":{"#cdata":"[Syntax: DIFF<=difftype>] \n          \nRequests that differences of the LS-means be displayed."},"StatementOptionType":"S|V","StatementOptionValues":{"@Value1":"ALL","@Value2":"ANOM","@Value3":"CONTROL","@Value4":"CONTROLL","@Value5":"CONTROLU"},"StatementOptionToolTips":{"@ToolTip1":"Requests all pairwise differences; this is the default.","@ToolTip2":"Requests differences between each LS-mean and the average LS-mean, as in the analysis  of means (Ott 1967).","@ToolTip3":"Requests the differences with a control, which, by default, is the first level of each of the  specified SLICE effects.","@ToolTip4":"Tests whether the noncontrol levels are significantly smaller than the control; the  upper confidence limits for the control minus the noncontrol levels are considered  to be infinity and are displayed as missing.","@ToolTip5":"Tests whether the noncontrol levels are significantly larger than the control; the  upper confidence limits for the noncontrol levels minus the control are considered  to be infinity and are displayed as missing."}},{"StatementOptionName":"E","StatementOptionHelp":{"#cdata":"Requests that the L matrix coefficients for the SLICE effects be displayed."},"StatementOptionType":"S"},{"StatementOptionName":"EXP","StatementOptionHelp":{"#cdata":"Requests exponentiation of the LS-means or LS-mean differences. When you model \ndata with the logit, cumulative logit, or generalized logit link functions, and \nthe estimate represents a log odds ratio or log cumulative odds ratio, the EXP \noption produces an odds ratio. In proportional hazards model, the exponentiation \nof the LS-mean differences produces estimates of hazard ratios. If you specify the \nCL or ALPHA= option, the (adjusted) confidence bounds are also exponentiated."},"StatementOptionType":"S"},{"StatementOptionName":"ILINK","StatementOptionHelp":{"#cdata":"Requests that estimates and their standard errors in the \"Least Squares Means\" \ntable also be reported on the scale of the mean (the inverse linked scale)."},"StatementOptionType":"S"},{"StatementOptionName":"LINES","StatementOptionHelp":{"#cdata":"Presents results of comparisons between all pairs of least squares means by listing \nthe means in descending order and indicating nonsignificant subsets by line segments \nbeside the corresponding LS-means."},"StatementOptionType":"S"},{"StatementOptionName":"MEANS","StatementOptionHelp":{"#cdata":"Specifies to produce the table of least squares means."},"StatementOptionType":"S"},{"StatementOptionName":"NOMEANS","StatementOptionHelp":{"#cdata":"Specifies not to produce the table of least squares means. This is the default."},"StatementOptionType":"S"},{"StatementOptionName":"ODDSRATIO|OR","StatementOptionHelp":{"#cdata":"Requests that LS-mean differences (DIFF, ADJUST= options) are also reported in terms \nof odds ratios. The ODDSRATIO option is ignored unless you use either the logit, \ncumulative logit, or generalized logit link function. If you specify the CL or \nALPHA= option, confidence intervals for the odds ratios are also computed. These \nintervals are adjusted for multiplicity when you specify the ADJUST= option."},"StatementOptionType":"S"},{"StatementOptionName":"OBSMARGINS=|OM=","StatementOptionHelp":{"#cdata":"Syntax: OBSMARGINS<=OM-data-set> \n          \nSpecifies a potentially different weighting scheme for the computation of LS-means \ncoefficients. The standard LS-means have equal coefficients across classification \neffects; however, the OM option changes these coefficients to be proportional to those \nfound in the OM-data-set. This adjustment is reasonable when you want your inferences \nto apply to a population that is not necessarily balanced but has the margins that are \nobserved in OM-data-set."},"StatementOptionType":"S|V"},{"StatementOptionName":"PDIFF","StatementOptionHelp":{"#cdata":"Is the same as the DIFF option."},"StatementOptionType":"S"},{"StatementOptionName":"PLOT=|PLOTS=","StatementOptionHelp":{"#cdata":"Requests that least squares means related graphics are produced via ODS Graphics, provided \nthat the ODS GRAPHICS statement has been specified and the plot request does not conflict \nwith other options in the SLICE statement.\n\nSyntax:\n(1) PLOT | PLOTS<=plot-request<(options)>> \n(2) PLOT | PLOTS<=(plot-request<(options)> <...plot-request<(options)> >)>"},"StatementOptionType":"S|V","StatementOptionValues":{"@Value1":"ALL","@Value2":"ANOMPLOT|ANOM","@Value3":"BOXPLOT","@Value4":"CONTROLPLOT|CONTROL","@Value5":"DIFFPLOT|DIFFOGRAM|DIFF","@Value6":"DISTPLOT|DIST","@Value7":"MEANPLOT","@Value8":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Requests that the default plots corresponding to this SLICE statement be produced.","@ToolTip2":"Requests an analysis of means display in which least squares means are compared to an  average least squares mean.","@ToolTip3":"Syntax: BOXPLOT<boxplot-options>>                                       Produces box plots of the distribution of the least squares mean or least squares mean  differences across a posterior sample. For example, this plot is available in procedures  that support a Bayesian analysis through the BAYES statement.   A separate box is generated for each estimable function, and all boxes appear on a single  graph by default. You can affect the appearance of the box plot graph with the following options:       ORIENTATION=VERTICAL|HORIZONTAL      ORIENT=VERT|HORIZ      specifies the orientation of the boxes. The default is vertical orientation of the box plots.       NPANELPOS=number      specifies how to break the series of box plots across multiple panels. If the NPANELPOS option      is not specified, or if number equals zero, then all box plots are displayed in a single graph;      this is the default.","@ToolTip4":"Requests a display in which least squares means are visually compared against a reference level.","@ToolTip5":"Requests a display of all pairwise least squares mean differences and their significance.  Syntax: DIFFPLOT<(diffplot-options)>  You can specify the following diffplot-options:       ABS     all line segments are shown on the same side of the reference line.       NOABS      separates comparisons according to the sign of the difference.       CENTER      marks the center point for each comparison.       NOLINES     suppresses the display of the line segments that represent the confidence bounds for the differences     of the least squares means. The NOLINES option implies the CENTER option.","@ToolTip6":"Syntax: DISTPLOT<distplot-options>                                        Generates panels of histograms with a kernel density overlaid if the analysis has access  to a set of posterior parameter estimates. You can sepcify the following distplot-options  in parentheses:       BOX|NOBOX      controls the display of a horizontal box plot of the estimable function’s distribution      across the posterior sample below the graph. The BOX option is enabled by default.       HIST|NOHIST      controls the display of the histogram of the estimable function’s distribution across the      posterior sample. The HIST option is enabled by default.       NORMAL|NONORMAL      controls the display of a normal density estimate on the graph. The NONORMAL option is enabled by default.       KERNEL|NOKERNEL      controls the display of a kernel density estimate on the graph. The KERNEL option is enabled by default.       NROWS=number      specifies the highest number of rows in a panel. The default is 3.       NCOLS=number      specifies the highest number of columns in a panel. The default is 3.       UNPACK      unpacks the panel into separate graphics.","@ToolTip7":"Syntax: MEANPLOT<(meanplot-options)>  Requests displays of the least squares means. The following meanplot-options control  the display of the least squares means:      ASCENDING      displays the least squares means in ascending order. This option has no effect if means are sliced      or displayed in separate plots.       CL      displays upper and lower confidence limits for the least squares means. By default, 95% limits are drawn.      CLBAND      displays confidence limits as bands. This option implies the JOIN option.       DESCENDING      displays the least squares means in descending order. This option has no effect if means are sliced     or displayed in separate plots.       ILINK      requests that means (and confidence limits) are displayed on the inverse linked scale.       JOIN | CONNECT      connects the least squares means with lines. This option is implied by the CLBAND option.          SLICEBY=fixed-effect      specifies an effect by which to group the means in a single plot.      PLOTBY=fixed-effect      specifies an effect by which to break interaction plots into separate displays.","@ToolTip8":"Requests that no plots be produced."},"SubOptionsKeywords":"\n            ABS|NOABS|CENTER|NOLINES|ASCENDING|CL|CLBAND|DESCENDING|ILINK|JOIN|\n            CONNECT|SLICEBY=|PLOTBY=|ORIENTATION=|ORIENT=|NPANELPOS=|BOX|NOBOX|\n            HIST|NOHIST|NORMAL|NONORMAL|KERNEL|NOKERNEL|NROWS=|NCOLS=|UNPACK\n          "},{"StatementOptionName":"SEED=","StatementOptionHelp":{"#cdata":"[Syntax: SEED=number] \n          \nSpecifies the seed for the sampling-based components of the computations for the SLICE \nstatement (for example, chi-bar-square statistics and simulated p-values). number specifies \nan integer that is used to start the pseudo-random-number generator for the simulation. If \nyou do not specify a seed, or if you specify a value less than or equal to zero, the seed \nis generated from reading the time of day from the computer clock."},"StatementOptionType":"V"},{"StatementOptionName":"SINGULAR=","StatementOptionHelp":{"#cdata":"[Syntax: SINGULAR=number] \n          \nTunes the estimability checking. The value for number must be between 0 and 1; \nthe default is 1E-4."},"StatementOptionType":"V"},{"StatementOptionName":"STEPDOWN","StatementOptionHelp":{"#cdata":"[Syntax: STEPDOWN<(step-down options)>] \n          \nRequests that multiple comparison adjustments for the p-values of LS-mean differences \nbe further adjusted in a step-down fashion. Step-down methods increase the power of \nmultiple comparisons by taking advantage of the fact that a p-value is never declared \nsignificant unless all smaller p-values are also declared significant.\n\nYou can specify the following step-down options in parentheses: \n\n    MAXTIME=n \n    specifies the time (in seconds) to spend computing the maximal logically consistent sequential \n    subsets of equality hypotheses for TYPE=LOGICAL.\n\n    REPORT \n    specifies that a report on the step-down adjustment should be displayed, including a listing of \n    the sequential subsets (Westfall 1997) and, for ADJUST=SIMULATE, the step-down simulation results.\n\n    TYPE=LOGICAL<(n)> \n    TYPE=FREE \n    If you specify TYPE=LOGICAL, the step-down adjustments are computed by using maximal logically \n    consistent sequential subsets of equality hypotheses (Shaffer 1986, Westfall 1997). Alternatively, \n    for TYPE=FREE, sequential subsets are computed ignoring logical constraints. The TYPE=FREE results \n    are more conservative than those for TYPE=LOGICAL, but they can be much more efficient to produce \n    for many comparisons."},"StatementOptionType":"S","SubOptionsKeywords":"MAXTIME=|REPORT|TYPE="},{"StatementOptionName":"SLICEBY=","StatementOptionHelp":{"#cdata":"Determines how to construct the partition of the least squares means for the model-effect.\n          \nSyntax: \nSLICEBY <=> slice-specification \nSIMPLE <=> slice-specification \nSLICEBY(slice-specification <, slice-specification <, >>) \nSIMPLE(slice-specification <, slice-specification <, >>) \n\nA slice-specification consists of an effect name followed by an optional list of formatted \nvalues. For example, the following statements creates partitions of the A*B interaction effect \nfor all levels of variable A: \n\n  class a b;\n  model y = a b a*b;\n  slice a*b / sliceby=a;"},"StatementOptionType":"S|V"},{"StatementOptionName":"NOF","StatementOptionHelp":{"#cdata":"Suppresses the F test for testing the mutual equality of the estimable functions \nin the partition."},"StatementOptionType":"S"}]}},{"StatementName":"STORE|ITEMSTORE","StatementHelp":{"#cdata":"Syntax: STORE <OUT=>item-store-name </ LABEL='label'> ; \n      \nThe STORE statement requests that the procedure save the context and results of the \nstatistical analysis. The resulting item store is a binary file format that cannot \nbe modified. The contents of the item store can be processed with the PLM procedure. \n\nThe item-store-name is a usual one- or two-level SAS name, like the names that are used \nfor SAS data sets. If you specify a one-level name, then the item store resides in the \nWORK library and is deleted at the end of the SAS session. Since item stores usually are \nused to perform postprocessing tasks, typical usage specifies a two-level name of the form \nlibname.membername. \n\nIf an item store by the same name as specified in the STORE statement already exists, \nthe existing store is replaced."},"StatementOptions":{"StatementOption":{"StatementOptionName":"LABEL=","StatementOptionHelp":{"#cdata":"[Syntax: LABEL='label'] \n          \nAdds a custom label. When the PLM procedure processes an item store, the label appears \nin the PROC PLM output along with other identifying information."},"StatementOptionType":"V"}}},{"StatementName":"MODEL","StatementHelp":{"#cdata":"Syntax: <label:> MODEL response = <effects> < /options> ; \n  <label:> MODEL events/trials = <effects> < /options> ; \n\nThe MODEL statement names the variables used as the response and the independent variables. \nAdditionally, you can specify the distribution used to model the response, as well as other \noptions. Only a single MODEL statement can be used with one invocation of the PROBIT procedure. \nIf multiple MODEL statements are present, only the last is used. Main effects and interaction \nterms can be specified in the MODEL statement, as in the GLM procedure. \n\nThe optional label, which must be a valid SAS name, is used to label output from the matching \nMODEL statement. \n\nThe response can be a single variable with a value that is used to indicate the level of the \nobserved response.\n\nAlternatively, the response can be specified as a pair of variable names separated by a slash (/). \nThe value of the first variable, events, is the number of positive responses (or events). The value \nof the second variable, trials, is the number of trials. Both variables must be numeric and nonnegative,\nand the ratio of the first variable value to the second variable value must be between 0 and 1, inclusive. \n\nThe effects following the equal sign are the covariates in the model. Higher-order effects, such as \ninteractions and nested terms, are allowed in the list, as in the GLM procedure."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"AGGREGATE=","StatementOptionHelp":{"#cdata":"[Syntax: AGGREGATE=variable-list] \n          \nSpecifies the subpopulations on which the Pearson chi-square test statistic and the log-likelihood \nratio chi-square test statistic (deviance) are calculated if the LACKFIT option is specified."},"StatementOptionType":"S|V"},{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=value] \n          \nSets the significance level for the confidence intervals for regression parameters, fiducial limits \nfor the predicted values, and confidence intervals for the predicted probabilities. The value must \nbe between 0 and 1. The default value is ALPHA=0.05."},"StatementOptionType":"V"},{"StatementOptionName":"CONVERGE=","StatementOptionHelp":{"#cdata":"[Syntax: CONVERGE=value] \n          \nSets the convergence criterion. Convergence is declared when the maximum change in the parameter \nestimates between Newton-Raphson steps is less than the value specified."},"StatementOptionType":"V"},{"StatementOptionName":"COORB","StatementOptionHelp":{"#cdata":"Displays the estimated correlation matrix of the parameter estimates."},"StatementOptionType":"S"},{"StatementOptionName":"COVB","StatementOptionHelp":{"#cdata":"Displays the estimated covariance matrix of the parameter estimates."},"StatementOptionType":"S"},{"StatementOptionName":"DISTRIBUTION=|DIST=|D=","StatementOptionHelp":{"#cdata":"Specifies the cumulative distribution function used to model the response probabilities."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"NORMAL","@Value2":"LOGISTIC","@Value3":"EXTREMEVALUE"},"StatementOptionToolTips":{"@ToolTip1":"Normal distribution for the probit model","@ToolTip2":"Logistic distribution for the probit model","@ToolTip3":"Extreme value, or Gompertz distribution for the gompit model"}},{"StatementOptionName":"HPROB","StatementOptionHelp":{"#cdata":"[Syntax: HPROB=p] \n          \nSpecifies a minimum probability level for the Pearson chi-square to indicate a good fit."},"StatementOptionType":"V"},{"StatementOptionName":"INITIAL=","StatementOptionHelp":{"#cdata":"[Syntax: INITIAL=values] \n          \nSets initial values for the parameters in the model other than the intercept. The values must be \ngiven in the order in which the variables are listed in the MODEL statement."},"StatementOptionType":"V"},{"StatementOptionName":"INTERCEPT=","StatementOptionHelp":{"#cdata":"[Syntax: INTERCEPT=value] \n          \nInitializes the intercept parameter to value. By default, INTERCEPT=0."},"StatementOptionType":"V"},{"StatementOptionName":"INVERSECL","StatementOptionHelp":{"#cdata":"Computes confidence limits for the values of the first continuous independent variable \n(such as dose) that yield selected response rates."},"StatementOptionType":"S"},{"StatementOptionName":"ITPRINT","StatementOptionHelp":{"#cdata":"Displays the iteration history, the final evaluation of the gradient, and the second derivative\nmatrix (Hessian)."},"StatementOptionType":"S"},{"StatementOptionName":"LACKFIT","StatementOptionHelp":{"#cdata":"Performs two goodness-of-fit tests (a Pearson chi-square test and a log-likelihood ratio chi-square \ntest) for the fitted model."},"StatementOptionType":"S"},{"StatementOptionName":"MAXITER=|MAXIT=","StatementOptionHelp":{"#cdata":"[Syntax: MAXITER=value] \n          \nSpecifies the maximum number of iterations to be performed in estimating the parameters. \nBy default, MAXITER=50."},"StatementOptionType":"V"},{"StatementOptionName":"NOINT","StatementOptionHelp":{"#cdata":"Fits a model with no intercept parameter."},"StatementOptionType":"S"},{"StatementOptionName":"SCALE=","StatementOptionHelp":{"#cdata":"Enables you to specify the method for estimating the dispersion parameter. To correct for overdispersion or \nunderdispersion, the covariance matrix is multiplied by the estimate of the dispersion parameter."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"DEVIANCE","@Value2":"PEARSON"},"StatementOptionToolTips":{"@ToolTip1":"Specifies that the dispersion parameter be estimated by the deviance divided by its degrees of freedom.","@ToolTip2":"Specifies that the dispersion parameter be estimated by the Pearson chi-square statistic divided by  its degrees of freedom. This is set as the default."}},{"StatementOptionName":"SINGULAR=","StatementOptionHelp":{"#cdata":"[Syntax: SINGULAR=value] \n          \nSpecifies the singularity criterion for determining linear dependencies in the set of independent variables."},"StatementOptionType":"V"}]}},{"StatementName":"OUTPUT","StatementHelp":{"#cdata":"Syntax: OUTPUT <OUT=SAS-data-set> keyword=name <...keyword=name> ; \n      \nThe OUTPUT statement creates a new SAS data set containing all variables in the input data set and, \noptionally, the fitted probabilities, the estimate of x'β, and the estimate of its standard error. \n\nkeyword=name \nspecifies the statistics to include in the output data set and assigns names to the new variables \nthat contain the statistics. Specify a keyword for each desired statistic, an equal sign, and the \nvariable to contain the statistic. "},"StatementOptions":{"StatementOption":[{"StatementOptionName":"OUT=","StatementOptionHelp":{"#cdata":"[Syntax: OUT=SAS-data-set] \n          \nNames the output data set. By default, the new data set is named by using the DATAn convention."},"StatementOptionType":"RV|DV"},{"StatementOptionName":"PROB=|P=","StatementOptionHelp":{"#cdata":"[Statistics keyword][Syntax: PROB=name]\n          \nCumulative probability estimates"},"StatementOptionType":"RV"},{"StatementOptionName":"STD=","StatementOptionHelp":{"#cdata":"[Statistics keyword] \n          \nStandard error estimates of aj + x'b"},"StatementOptionType":"RV"},{"StatementOptionName":"XBETA=","StatementOptionHelp":{"#cdata":"[Statistics keyword] E\n          \nEstimates of aj + x'β"},"StatementOptionType":"RV"}]}},{"StatementName":"CDFPLOT","StatementHelp":{"#cdata":"Syntax: CDFPLOT <var = variable> <options> ; \n\nThe CDFPLOT statement plots the predicted cumulative distribution function (CDF) of the multinomial \nresponse variable as a function of a single continuous independent variable (dose variable). You can \nuse this statement only after a multinomial model statement"},"StatementOptions":{"StatementOption":[{"StatementOptionName":"VAR=","StatementOptionHelp":{"#cdata":"[Syntax: VAR=variable] \n          \nSpecifies a single continuous variable (dose variable) in the independent variable \nlist of the MODEL statement. If a VAR= variable is not specified, the first single \ncontinuous variable in the independent variable list of the MODEL statement is used. \nIf such a variable does not exist in the independent variable list of the MODEL \nstatement, an error is reported."},"StatementOptionType":"V"},{"StatementOptionName":"ANNOTATE=|ANNO=","StatementOptionHelp":{"#cdata":"[Syntax: ANNOTATE=SAS-data-set] \n          \nSpecifies an Annotate data set that enables you to add features to the CDF plot. \nThe ANNOTATE= data set you specify in the CDFPLOT statement is used for all plots \ncreated by the statement."},"StatementOptionType":"DV"},{"StatementOptionName":"CAXIS=|CAXES=|CA=","StatementOptionHelp":{"#cdata":"[Syntax: CAXIS=color] \n          \nSpecifies the color used for the axes and tick marks. This option overrides any \nCOLOR= specifications in an AXIS statement. The default is the first color in the \ndevice color list."},"StatementOptionType":"C"},{"StatementOptionName":"CFIT=","StatementOptionHelp":{"#cdata":"[Syntax: CFIT=color] \n          \nSpecifies the color for the fitted CDF curves. The default is the first color in the \ndevice color list."},"StatementOptionType":"C"},{"StatementOptionName":"CFRAME=|CFR=","StatementOptionHelp":{"#cdata":"[Syntax: CFRAME=color] \n          \nSpecifies the color for the area enclosed by the axes and frame. The area is not shaded \nby default."},"StatementOptionType":"C"},{"StatementOptionName":"CGRID=","StatementOptionHelp":{"#cdata":"[Syntax: CGRID=color] \n          \nSpecifies the color for grid lines. The default is the first color in the device color list."},"StatementOptionType":"C"},{"StatementOptionName":"CLABBOX=","StatementOptionHelp":{"#cdata":"[Syntax: CLABBOX=color] \n          \nSpecifies the color for the area enclosed by the label box for CDF curves. This area \nis not shaded by default."},"StatementOptionType":"C"},{"StatementOptionName":"CHREF=|CH=","StatementOptionHelp":{"#cdata":"[Syntax: CHREF=color] \n          \nSpecifies the color for lines requested by the HREF= option. The default is the first \ncolor in the device color list."},"StatementOptionType":"C"},{"StatementOptionName":"CTEXT=","StatementOptionHelp":{"#cdata":"[Syntax: CTEXT=color] \n          \nSpecifies the color for tick mark values and axis labels. The default is the color \nspecified for the CTEXT= option in the most recent GOPTIONS statement."},"StatementOptionType":"C"},{"StatementOptionName":"CVREF=|CV=","StatementOptionHelp":{"#cdata":"[Syntax: CVREF=color] \n          \nSpecifies the color for lines requested by the VREF= option. The default is the first \ncolor in the device color list."},"StatementOptionType":"C"},{"StatementOptionName":"DESCRIPTION=|DES=","StatementOptionHelp":{"#cdata":"[Syntax: DESCRIPTION='string'] \n          \nSpecifies a description, up to 40 characters, that appears in the PROC GREPLAY master \nmenu. The default is the variable name."},"StatementOptionType":"V"},{"StatementOptionName":"FONT=","StatementOptionHelp":{"#cdata":"[Syntax: FONT=font] \n          \nSpecifies a software font for reference line and axis labels. You can also specify fonts for axis \nlabels in an AXIS statement. The FONT= font takes precedence over the FTEXT= font specified in the \nGOPTIONS statement."},"StatementOptionType":"V"},{"StatementOptionName":"HAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: HAXIS=value1 to value2 <by value3>] \n          \nSpecifies tick mark values for the horizontal axis; value1, value2, and value3 must \nbe numeric, and value1 must be less than value2. The lower tick mark is value1. Tick \nmarks are drawn at increments of value3. The last tick mark is the greatest value that \ndoes not exceed value2. If value3 is omitted, a value of 1 is used."},"StatementOptionType":"V"},{"StatementOptionName":"HEIGHT=","StatementOptionHelp":{"#cdata":"[Syntax: HEIGHT=value] \n          \nSpecifies the height of text used outside framed areas. The default value \nis 3.846 (in percentage)."},"StatementOptionType":"V"},{"StatementOptionName":"HLOWER=","StatementOptionHelp":{"#cdata":"[Syntax: HLOWER=value] \n          \nSpecifies the lower limit on the horizontal axis scale. The HLOWER= option specifies \nvalue as the lower horizontal axis tick mark. The tick mark interval and the upper axis \nlimit are determined automatically. This option has no effect if the HAXIS= option is \nused."},"StatementOptionType":"V"},{"StatementOptionName":"HOFFSET=","StatementOptionHelp":{"#cdata":"[Syntax: HOFFSET=value] \n          \nSpecifies offset for horizontal axis. The default value is 1."},"StatementOptionType":"V"},{"StatementOptionName":"HUPPER=","StatementOptionHelp":{"#cdata":"[Syntax: HUPPER=value] \n          \nSpecifies value as the upper horizontal axis tick mark. The tick mark interval \nand the lower axis limit are determined automatically. This option has no effect \nif the HAXIS= option is used."},"StatementOptionType":"V"},{"StatementOptionName":"HREF","StatementOptionHelp":{"#cdata":"[Syntax: HREF <(INTERSECT)> =value-list] \n          \nRequests reference lines perpendicular to the horizontal axis. If (INTERSECT) is specified, \na second reference line perpendicular to the vertical axis is drawn that intersects the fit \nline at the same point as the horizontal axis reference line. If a horizontal axis reference \nline label is specified, the intersecting vertical axis reference line is labeled with the \nvertical axis value."},"StatementOptionType":"S|V"},{"StatementOptionName":"HREFLABELS=|HREFLABEL=|HREFLAB=","StatementOptionHelp":{"#cdata":"[Syntax: HREFLABELS='label1' ...'labeln'] \n          \nSpecifies labels for the lines requested by the HREF= option. The number of labels must equal the \nnumber of lines. Enclose each label in quotes. Labels can have up to 16 characters."},"StatementOptionType":"V"},{"StatementOptionName":"HREFLABPOS=","StatementOptionHelp":{"#cdata":"Specifies the vertical position of the HREFLABELS= labels."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2","@Value3":"3","@Value4":"4","@Value5":"5","@Value6":"6"},"StatementOptionToolTips":{"@ToolTip1":"Top of plot","@ToolTip2":"Staggered from top","@ToolTip3":"Bottom of plot","@ToolTip4":"Staggered from bottom","@ToolTip5":"Alternating from top","@ToolTip6":"Alternating from bottom"}},{"StatementOptionName":"INBORDER","StatementOptionHelp":{"#cdata":"Requests a border around CDF plots."},"StatementOptionType":"S"},{"StatementOptionName":"LEVEL=|ORDINAL=","StatementOptionHelp":{"#cdata":"[Syntax: LEVEL=(character-list) | ORDINAL=(character-list)] \n          \nSpecifies the names of the levels for which CDF curves are requested. Names should \nbe quoted and separated by space. If there is no correct name provided, no CDF curve \nis plotted."},"StatementOptionType":"V"},{"StatementOptionName":"LFIT=","StatementOptionHelp":{"#cdata":"[Syntax: LFIT=linetype] \n          \nSpecifies a line style for fitted curves. By default, fitted curves are drawn \nby connecting solid lines (linetype = 1)."},"StatementOptionType":"V"},{"StatementOptionName":"LGRID=","StatementOptionHelp":{"#cdata":"[Syntax: LGRID=linetype] \n          \nSpecifies a line style for all grid lines. linetype is between 1 and 46. \nThe default is 35."},"StatementOptionType":"V"},{"StatementOptionName":"LHREF=|LH=","StatementOptionHelp":{"#cdata":"[Syntax: LHREF=linetype] \n          \nSpecifies the line type for lines requested by the HREF= option. The default \nis 2, which produces a dashed line."},"StatementOptionType":"V"},{"StatementOptionName":"LVREF=|LV=","StatementOptionHelp":{"#cdata":"[Syntax: LVREF=linetype] \n          \nSpecifies the line type for lines requested by the VREF= option. The default \nis 2, which produces a dashed line."},"StatementOptionType":"V"},{"StatementOptionName":"NAME=","StatementOptionHelp":{"#cdata":"[Syntax: NAME='string'] \n          \nSpecifies a name for the plot, up to eight characters, that appears in the \nPROC GREPLAY master menu. The default value is 'PROBIT'."},"StatementOptionType":"V"},{"StatementOptionName":"NOFIT","StatementOptionHelp":{"#cdata":"Suppresses the fitted CDF curves."},"StatementOptionType":"S"},{"StatementOptionName":"NOFRAME","StatementOptionHelp":{"#cdata":"Suppresses the frame around plotting areas."},"StatementOptionType":"S"},{"StatementOptionName":"NOGRID","StatementOptionHelp":{"#cdata":"Suppresses grid lines."},"StatementOptionType":"S"},{"StatementOptionName":"NOHLABEL","StatementOptionHelp":{"#cdata":"Suppresses horizontal labels."},"StatementOptionType":"S"},{"StatementOptionName":"NOHTICK","StatementOptionHelp":{"#cdata":"Suppresses horizontal tick marks."},"StatementOptionType":"S"},{"StatementOptionName":"NOTHRESH","StatementOptionHelp":{"#cdata":"Suppresses the threshold line."},"StatementOptionType":"S"},{"StatementOptionName":"NOVLABEL","StatementOptionHelp":{"#cdata":"Suppresses vertical labels."},"StatementOptionType":"S"},{"StatementOptionName":"NOVTICK","StatementOptionHelp":{"#cdata":"Suppresses vertical tick marks."},"StatementOptionType":"S"},{"StatementOptionName":"THRESHLABPOS=","StatementOptionHelp":{"#cdata":"Specifies the horizontal position of labels for the threshold line."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2"},"StatementOptionToolTips":{"@ToolTip1":"Labels are placed to the left of the plot.","@ToolTip2":"Labels are placed to the right of the plot."}},{"StatementOptionName":"VAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: VAXIS=value1 to value2 <by value3> ] \n          \nSpecifies tick mark values for the vertical axis; value1, value2, and value3 must \nbe numeric, and value1 must be less than value2. The lower tick mark is value1. Tick \nmarks are drawn at increments of value3. The last tick mark is the greatest value that \ndoes not exceed value2. This method of specification of tick marks is not valid for \nlogarithmic axes. If value3 is omitted, a value of 1 is used."},"StatementOptionType":"V"},{"StatementOptionName":"VAXISLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: VAXISLABEL='string'] \n          \nSpecifies a label for the vertical axis."},"StatementOptionType":"V"},{"StatementOptionName":"VLOWER=","StatementOptionHelp":{"#cdata":"[Syntax: VLOWER=value] \n          \nSpecifies the lower limit on the vertical axis scale. The VLOWER= option specifies \nvalue as the lower vertical axis tick mark. The tick mark interval and the upper \naxis limit are determined automatically. This option has no effect if the VAXIS= \noption is used."},"StatementOptionType":"V"},{"StatementOptionName":"VREF=","StatementOptionHelp":{"#cdata":"[Syntax: VREF=value-list] \n          \nRequests reference lines perpendicular to the vertical axis. If (INTERSECT) \nis specified, a second reference line perpendicular to the horizontal axis \nis drawn that intersects the fit line at the same point as the vertical axis \nreference line. If a vertical axis reference line label is specified, the \nintersecting horizontal axis reference line is labeled with the horizontal \naxis value."},"StatementOptionType":"V"},{"StatementOptionName":"VREFLABELS=|VREFLABEL=|VREFLAB=","StatementOptionHelp":{"#cdata":"[Syntax: VREFLABELS='label1'...'labeln'] \n          \nSpecifies labels for the lines requested by the VREF= option. The number of labels must equal the \nnumber of lines. Enclose each label in quotes. Labels can have up to 16 characters."},"StatementOptionType":"V"},{"StatementOptionName":"VREFLABPOS=","StatementOptionHelp":{"#cdata":"Specifies the horizontal position of labels for VREF= lines."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2"},"StatementOptionToolTips":{"@ToolTip1":"Labels are positioned to the left of the plot.","@ToolTip2":"Labels are positioned to the right of the plot."}},{"StatementOptionName":"VUPPER=","StatementOptionHelp":{"#cdata":"[Syntax: VUPPER=value] \n          \nSpecifies the upper limit on the vertical axis scale. The VUPPER= option specifies \nvalue as the upper vertical axis tick mark. The tick mark interval and the lower axis \nlimit are determined automatically. This option has no effect if the VAXIS= option is \nused."},"StatementOptionType":"V"},{"StatementOptionName":"WAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: WAXIS=n] \n          \nSpecifies the line thickness for axes and frame. The default value is 1."},"StatementOptionType":"V"},{"StatementOptionName":"WFIT=","StatementOptionHelp":{"#cdata":"[Syntax: WFIT=n] \n          \nSpecifies line thickness for fitted curves. The default value is 1."},"StatementOptionType":"V"},{"StatementOptionName":"WGRID=","StatementOptionHelp":{"#cdata":"[Syntax: WGRID=n] \n          \nSpecifies line thickness for grids. The default value is 1."},"StatementOptionType":"V"},{"StatementOptionName":"WREFL=","StatementOptionHelp":{"#cdata":"[Syntax: WREFL=n] \n          \nSpecifies line thickness for reference lines. The default value is 1."},"StatementOptionType":"V"}]}},{"StatementName":"TEST","StatementHelp":{"#cdata":"Syntax: TEST <model-effects> </ options> ; \n      \nThe TEST statement enables you to perform F tests for model effects that test \nType I, II, or Type III hypotheses."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"CHISQ","StatementOptionHelp":{"#cdata":"Requests that chi-square tests be performed for the relevant effects in addition to the \nF tests. Type III tests are the default; you can produce the Type I and Type II tests \nby using the HTYPE= option. This option has no effect when the procedure produces \nchi-square statistics by default."},"StatementOptionType":"S"},{"StatementOptionName":"DDF=|DF=","StatementOptionHelp":{"#cdata":"[Syntax: DDF=value-list] \n          \nSpecifies the denominator degrees of freedom for the fixed effects. The value-list \nspecification is a list of numbers or missing values (.) separated by commas. The \norder of degrees of freedom should match the order of the fixed effects that are \nspecified in the TEST statement; otherwise it should match the order in which the \neffects appear in the \"Type III Tests of Fixed Effects\" table."},"StatementOptionType":"V"},{"StatementOptionName":"E","StatementOptionHelp":{"#cdata":"Requests that Type I, Type II, and Type III L matrix coefficients be displayed for all \nrelevant effects."},"StatementOptionType":"S"},{"StatementOptionName":"E1|EI","StatementOptionHelp":{"#cdata":"Requests that Type I L matrix coefficients be displayed for all relevant effects."},"StatementOptionType":"S"},{"StatementOptionName":"E2|EII","StatementOptionHelp":{"#cdata":"Requests that Type II L matrix coefficients be displayed for all relevant effects.]"},"StatementOptionType":"S"},{"StatementOptionName":"E3|EIII","StatementOptionHelp":{"#cdata":"Requests that Type III L matrix coefficients be displayed for all relevant effects."},"StatementOptionType":"S"},{"StatementOptionName":"HTYPE=","StatementOptionHelp":{"#cdata":"[Syntax: HTYPE=value-list] \n          \nIndicates the type of hypothesis test to perform on the fixed effects. Valid entries \nfor values in the value-list are 1, 2, and 3, which correspond to Type I, Type II, and \nType III tests, respectively. The default value is 3."},"StatementOptionType":"V"},{"StatementOptionName":"INTERCEPT|INT","StatementOptionHelp":{"#cdata":"Adds a row to the tables for Type I, II, and III tests that correspond to the \noverall intercept."},"StatementOptionType":"S"}]}},{"StatementName":"INSET","StatementHelp":{"#cdata":"Syntax: INSET <keyword-list> </ options> ; \n\nThe box or table of summary information produced on plots made with the CDFPLOT, \nIPPPLOT, LPREDPLOT, or PREDPPLOT statement is called an inset. You can use the \nINSET statement to customize both the information that is printed in the inset in \nbox and the appearance of the inset box. To supply the information that is displayed \nthe inset box, you specify keywords corresponding to the information you want shown."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"CFILL=","StatementOptionHelp":{"#cdata":"[Syntax: CFILL=color] \n          \nSpecifies color for filling box."},"StatementOptionType":"C"},{"StatementOptionName":"CFILLH=","StatementOptionHelp":{"#cdata":"[Syntax: CFILLH=color] \n          \nSpecifies color for filling box header."},"StatementOptionType":"C"},{"StatementOptionName":"CFRAME=","StatementOptionHelp":{"#cdata":"[Syntax: CFRAME=color] \n          \nSpecifies the color for the frame."},"StatementOptionType":"C"},{"StatementOptionName":"CHEADER=CHEADER=","StatementOptionHelp":{"#cdata":"[Syntax: CHEADER=color] \n          \nSpecifies the color for text in header."},"StatementOptionType":"C"},{"StatementOptionName":"CTEXT=","StatementOptionHelp":{"#cdata":"[Syntax: CTEXT=color] \n          \nSpecifies the color for text."},"StatementOptionType":"C"},{"StatementOptionName":"FONT=","StatementOptionHelp":{"#cdata":"[Syntax: FONT=font] \n          \nSpecifies software font for text."},"StatementOptionType":"V"},{"StatementOptionName":"HEADER=","StatementOptionHelp":{"#cdata":"[Syntax: HEADER='quoted-string'] \n          \nSpecifies text for header or box title."},"StatementOptionType":"V"},{"StatementOptionName":"HEIGHT=","StatementOptionHelp":{"#cdata":"[Syntax: HEIGHT=value] \n          \nSpecifies the height of text."},"StatementOptionType":"V"},{"StatementOptionName":"NOFRAME","StatementOptionHelp":{"#cdata":"Suppresses the frame around the box."},"StatementOptionType":"V"},{"StatementOptionName":"POS=","StatementOptionHelp":{"#cdata":"[Syntax: POS=value value <DATA | PERCENT>\n  \nDetermines the position of the inset. The value can be a compass point (N, NE, E, \nSE, S, SW, W, NW) or a pair of coordinates (x, y) enclosed in parentheses. The \ncoordinates can be specified in axis percentage units or axis data units."},"StatementOptionType":"V"},{"StatementOptionName":"REFPOINT=","StatementOptionHelp":{"#cdata":"Specifies the reference point for an inset that is positioned by a pair of coordinates \nwith the POS= option."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BR","@Value2":"BL","@Value3":"TR","@Value4":"TL"},"StatementOptionToolTips":{"@ToolTip1":"Bottom right","@ToolTip2":"Bottom left (the default)","@ToolTip3":"Top right","@ToolTip4":"Top left"}},{"StatementOptionName":"NOBS","StatementOptionHelp":{"#cdata":"Number of observations"},"StatementOptionType":"RS"},{"StatementOptionName":"NTRIALS","StatementOptionHelp":{"#cdata":"Number of trials"},"StatementOptionType":"RS"},{"StatementOptionName":"NEVENTS","StatementOptionHelp":{"#cdata":"Number of events"},"StatementOptionType":"RS"},{"StatementOptionName":"C","StatementOptionHelp":{"#cdata":"User-input threshold"},"StatementOptionType":"RS"},{"StatementOptionName":"OPTC","StatementOptionHelp":{"#cdata":"Estimated natural threshold"},"StatementOptionType":"RS"},{"StatementOptionName":"NRESPLEV","StatementOptionHelp":{"#cdata":"Number of levels of the response variable"},"StatementOptionType":"RS"},{"StatementOptionName":"CONFIDENCE","StatementOptionHelp":{"#cdata":"Confidence coefficient for all confidence intervals"},"StatementOptionType":"RS"},{"StatementOptionName":"DIST","StatementOptionHelp":{"#cdata":"Name of the distribution"},"StatementOptionType":"RS"}],"#comment":{}}},{"StatementName":"IPPPLOT","StatementHelp":{"#cdata":"Syntax: IPPPLOT <var = variable> <options> ; \n\nThe IPPPLOT statement plots the inverse of the predicted probability against a single \ncontinuous variable (dose variable) in the MODEL statement for the binomial model. You \ncan only use this statement after a binomial model statement. The confidence limits for \nthe predicted values of the dose variable are the computed fiducial limits, not the \ninverse of the confidence limits of the predicted probabilities."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"VAR=","StatementOptionHelp":{"#cdata":"[Syntax: VAR=variable] \n          \nSpecifies a single continuous variable (dose variable) in the independent variable \nlist of the MODEL statement. If a VAR= variable is not specified, the first single \ncontinuous variable in the independent variable list of the MODEL statement is used. \nIf such a variable does not exist in the independent variable list of the MODEL \nstatement, an error is reported."},"StatementOptionType":"V"},{"StatementOptionName":"ANNOTATE=|ANNO=","StatementOptionHelp":{"#cdata":"[Syntax: ANNOTATE=SAS-data-set] \n          \nSpecifies an Annotate data set that enables you to add features to the IPP plot. \nThe ANNOTATE= data set you specify in the IPPPLOT statement is used for all plots \ncreated by the statement."},"StatementOptionType":"DV"},{"StatementOptionName":"CAXIS=|CAXES=|CA=","StatementOptionHelp":{"#cdata":"[Syntax: CAXIS=color] \n          \nSpecifies the color used for the axes and tick marks. This option overrides any \nCOLOR= specifications in an AXIS statement. The default is the first color in the \ndevice color list."},"StatementOptionType":"C"},{"StatementOptionName":"CFIT=","StatementOptionHelp":{"#cdata":"[Syntax: CFIT=color] \n          \nSpecifies the color for the fitted IPP curves. The default is the first color in the \ndevice color list."},"StatementOptionType":"C"},{"StatementOptionName":"CFRAME=|CFR=","StatementOptionHelp":{"#cdata":"[Syntax: CFRAME=color] \n          \nSpecifies the color for the area enclosed by the axes and frame. The area is not shaded \nby default."},"StatementOptionType":"C"},{"StatementOptionName":"CGRID=","StatementOptionHelp":{"#cdata":"[Syntax: CGRID=color] \n          \nSpecifies the color for grid lines. The default is the first color in the device color list."},"StatementOptionType":"C"},{"StatementOptionName":"CHREF=|CH=","StatementOptionHelp":{"#cdata":"[Syntax: CHREF=color] \n          \nSpecifies the color for lines requested by the HREF= option. The default is the first \ncolor in the device color list."},"StatementOptionType":"C"},{"StatementOptionName":"CTEXT=","StatementOptionHelp":{"#cdata":"[Syntax: CTEXT=color] \n          \nSpecifies the color for tick mark values and axis labels. The default is the color \nspecified for the CTEXT= option in the most recent GOPTIONS statement."},"StatementOptionType":"C"},{"StatementOptionName":"CVREF=|CV=","StatementOptionHelp":{"#cdata":"[Syntax: CVREF=color] \n          \nSpecifies the color for lines requested by the VREF= option. The default is the first \ncolor in the device color list."},"StatementOptionType":"C"},{"StatementOptionName":"DESCRIPTION=|DES=","StatementOptionHelp":{"#cdata":"[Syntax: DESCRIPTION='string'] \n          \nSpecifies a description, up to 40 characters, that appears in the PROC GREPLAY master \nmenu. The default is the variable name."},"StatementOptionType":"V"},{"StatementOptionName":"FONT=","StatementOptionHelp":{"#cdata":"[Syntax: FONT=font] \n          \nSpecifies a software font for reference line and axis labels. You can also specify fonts for axis \nlabels in an AXIS statement. The FONT= font takes precedence over the FTEXT= font specified in the \nGOPTIONS statement."},"StatementOptionType":"V"},{"StatementOptionName":"HAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: HAXIS=value1 to value2 <by value3>] \n          \nSpecifies tick mark values for the horizontal axis; value1, value2, and value3 must \nbe numeric, and value1 must be less than value2. The lower tick mark is value1. Tick \nmarks are drawn at increments of value3. The last tick mark is the greatest value that \ndoes not exceed value2. If value3 is omitted, a value of 1 is used."},"StatementOptionType":"V"},{"StatementOptionName":"HEIGHT=","StatementOptionHelp":{"#cdata":"[Syntax: HEIGHT=value] \n          \nSpecifies the height of text used outside framed areas. The default value \nis 3.846 (in percentage)."},"StatementOptionType":"V"},{"StatementOptionName":"HLOWER=","StatementOptionHelp":{"#cdata":"[Syntax: HLOWER=value] \n          \nSpecifies the lower limit on the horizontal axis scale. The HLOWER= option specifies \nvalue as the lower horizontal axis tick mark. The tick mark interval and the upper axis \nlimit are determined automatically. This option has no effect if the HAXIS= option is \nused."},"StatementOptionType":"V"},{"StatementOptionName":"HOFFSET=","StatementOptionHelp":{"#cdata":"[Syntax: HOFFSET=value] \n          \nSpecifies offset for horizontal axis. The default value is 1."},"StatementOptionType":"V"},{"StatementOptionName":"HUPPER=","StatementOptionHelp":{"#cdata":"[Syntax: HUPPER=value] \n          \nSpecifies value as the upper horizontal axis tick mark. The tick mark interval \nand the lower axis limit are determined automatically. This option has no effect \nif the HAXIS= option is used."},"StatementOptionType":"V"},{"StatementOptionName":"HREF","StatementOptionHelp":{"#cdata":"[Syntax: HREF <(INTERSECT)> =value-list] \n          \nRequests reference lines perpendicular to the horizontal axis. If (INTERSECT) is specified, \na second reference line perpendicular to the vertical axis is drawn that intersects the fit \nline at the same point as the horizontal axis reference line. If a horizontal axis reference \nline label is specified, the intersecting vertical axis reference line is labeled with the \nvertical axis value."},"StatementOptionType":"S|V","SubOptionsKeywords":"INTERSECT"},{"StatementOptionName":"HREFLABELS=|HREFLABEL=|HREFLAB=","StatementOptionHelp":{"#cdata":"[Syntax: HREFLABELS='label1' ...'labeln'] \n          \nSpecifies labels for the lines requested by the HREF= option. The number of labels must equal the \nnumber of lines. Enclose each label in quotes. Labels can have up to 16 characters."},"StatementOptionType":"V"},{"StatementOptionName":"HREFLABPOS=","StatementOptionHelp":{"#cdata":"Specifies the vertical position of the HREFLABELS= labels."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2","@Value3":"3","@Value4":"4","@Value5":"5","@Value6":"6"},"StatementOptionToolTips":{"@ToolTip1":"Top of plot","@ToolTip2":"Staggered from top","@ToolTip3":"Bottom of plot","@ToolTip4":"Staggered from bottom","@ToolTip5":"Alternating from top","@ToolTip6":"Alternating from bottom"}},{"StatementOptionName":"INBORDER","StatementOptionHelp":{"#cdata":"Requests a border around IPP plots."},"StatementOptionType":"S"},{"StatementOptionName":"LFIT=","StatementOptionHelp":{"#cdata":"[Syntax: LFIT=linetype] \n          \nSpecifies a line style for fitted curves. By default, fitted curves are drawn \nby connecting solid lines (linetype = 1)."},"StatementOptionType":"V"},{"StatementOptionName":"LGRID=","StatementOptionHelp":{"#cdata":"[Syntax: LGRID=linetype] \n          \nSpecifies a line style for all grid lines. linetype is between 1 and 46. \nThe default is 35."},"StatementOptionType":"V"},{"StatementOptionName":"LHREF=|LH=","StatementOptionHelp":{"#cdata":"[Syntax: LHREF=linetype] \n          \nSpecifies the line type for lines requested by the HREF= option. The default \nis 2, which produces a dashed line."},"StatementOptionType":"V"},{"StatementOptionName":"LVREF=|LV=","StatementOptionHelp":{"#cdata":"[Syntax: LVREF=linetype] \n          \nSpecifies the line type for lines requested by the VREF= option. The default \nis 2, which produces a dashed line."},"StatementOptionType":"V"},{"StatementOptionName":"NAME=","StatementOptionHelp":{"#cdata":"[Syntax: NAME='string'] \n          \nSpecifies a name for the plot, up to eight characters, that appears in the \nPROC GREPLAY master menu. The default value is 'PROBIT'."},"StatementOptionType":"V"},{"StatementOptionName":"NOFIT","StatementOptionHelp":{"#cdata":"Suppresses the fitted IPP curves."},"StatementOptionType":"S"},{"StatementOptionName":"NOFRAME","StatementOptionHelp":{"#cdata":"Suppresses the frame around plotting areas."},"StatementOptionType":"S"},{"StatementOptionName":"NOGRID","StatementOptionHelp":{"#cdata":"Suppresses grid lines."},"StatementOptionType":"S"},{"StatementOptionName":"NOHLABEL","StatementOptionHelp":{"#cdata":"Suppresses horizontal labels."},"StatementOptionType":"S"},{"StatementOptionName":"NOHTICK","StatementOptionHelp":{"#cdata":"Suppresses horizontal tick marks."},"StatementOptionType":"S"},{"StatementOptionName":"NOTHRESH","StatementOptionHelp":{"#cdata":"Suppresses the threshold line."},"StatementOptionType":"S"},{"StatementOptionName":"NOVLABEL","StatementOptionHelp":{"#cdata":"Suppresses vertical labels."},"StatementOptionType":"S"},{"StatementOptionName":"NOVTICK","StatementOptionHelp":{"#cdata":"Suppresses vertical tick marks."},"StatementOptionType":"S"},{"StatementOptionName":"THRESHLABPOS=","StatementOptionHelp":{"#cdata":"Specifies the horizontal position of labels for the threshold line."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2"},"StatementOptionToolTips":{"@ToolTip1":"Labels are placed to the left of the plot.","@ToolTip2":"Labels are placed to the right of the plot."}},{"StatementOptionName":"VAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: VAXIS=value1 to value2 <by value3> ] \n          \nSpecifies tick mark values for the vertical axis; value1, value2, and value3 must \nbe numeric, and value1 must be less than value2. The lower tick mark is value1. Tick \nmarks are drawn at increments of value3. The last tick mark is the greatest value that \ndoes not exceed value2. This method of specification of tick marks is not valid for \nlogarithmic axes. If value3 is omitted, a value of 1 is used."},"StatementOptionType":"V"},{"StatementOptionName":"VAXISLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: VAXISLABEL='string'] \n          \nSpecifies a label for the vertical axis."},"StatementOptionType":"V"},{"StatementOptionName":"VLOWER=","StatementOptionHelp":{"#cdata":"[Syntax: VLOWER=value] \n          \nSpecifies the lower limit on the vertical axis scale. The VLOWER= option specifies \nvalue as the lower vertical axis tick mark. The tick mark interval and the upper \naxis limit are determined automatically. This option has no effect if the VAXIS= \noption is used."},"StatementOptionType":"V"},{"StatementOptionName":"VREF=","StatementOptionHelp":{"#cdata":"[Syntax: VREF=value-list] \n          \nRequests reference lines perpendicular to the vertical axis. If (INTERSECT) \nis specified, a second reference line perpendicular to the horizontal axis \nis drawn that intersects the fit line at the same point as the vertical axis \nreference line. If a vertical axis reference line label is specified, the \nintersecting horizontal axis reference line is labeled with the horizontal \naxis value."},"StatementOptionType":"V"},{"StatementOptionName":"VREFLABELS=|VREFLABEL=|VREFLAB=","StatementOptionHelp":{"#cdata":"[Syntax: VREFLABELS='label1'...'labeln'] \n          \nSpecifies labels for the lines requested by the VREF= option. The number of labels must equal the \nnumber of lines. Enclose each label in quotes. Labels can have up to 16 characters."},"StatementOptionType":"V"},{"StatementOptionName":"VREFLABPOS=","StatementOptionHelp":{"#cdata":"Specifies the horizontal position of labels for VREF= lines."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2"},"StatementOptionToolTips":{"@ToolTip1":"Labels are positioned to the left of the plot.","@ToolTip2":"Labels are positioned to the right of the plot."}},{"StatementOptionName":"VUPPER=","StatementOptionHelp":{"#cdata":"[Syntax: VUPPER=value] \n          \nSpecifies the upper limit on the vertical axis scale. The VUPPER= option specifies \nvalue as the upper vertical axis tick mark. The tick mark interval and the lower axis \nlimit are determined automatically. This option has no effect if the VAXIS= option is \nused."},"StatementOptionType":"V"},{"StatementOptionName":"WAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: WAXIS=n] \n          \nSpecifies the line thickness for axes and frame. The default value is 1."},"StatementOptionType":"V"},{"StatementOptionName":"WFIT=","StatementOptionHelp":{"#cdata":"[Syntax: WFIT=n] \n          \nSpecifies line thickness for fitted curves. The default value is 1."},"StatementOptionType":"V"},{"StatementOptionName":"WGRID=","StatementOptionHelp":{"#cdata":"[Syntax: WGRID=n] \n          \nSpecifies line thickness for grids. The default value is 1."},"StatementOptionType":"V"},{"StatementOptionName":"WREFL=","StatementOptionHelp":{"#cdata":"[Syntax: WREFL=n] \n          \nSpecifies line thickness for reference lines. The default value is 1."},"StatementOptionType":"V"}]}},{"StatementName":"LPREDPLOT","StatementHelp":{"#cdata":"[Syntax: LPREDPLOT <var = variable> <options> ;] \n\nThe LPREDPLOT statement plots the linear predictor x'b against a single continuous variable (dose variable) \nin the MODEL statement for either the binomial model or the multinomial model. The confidence limits for \nthe predicted values are available only for the binomial model."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"VAR=","StatementOptionHelp":{"#cdata":"[Syntax: VAR=variable] \n          \nSpecifies a single continuous variable (dose variable) in the independent variable \nlist of the MODEL statement. If a VAR= variable is not specified, the first single \ncontinuous variable in the independent variable list of the MODEL statement is used. \nIf such a variable does not exist in the independent variable list of the MODEL \nstatement, an error is reported."},"StatementOptionType":"V"},{"StatementOptionName":"ANNOTATE=|ANNO=","StatementOptionHelp":{"#cdata":"[Syntax: ANNOTATE=SAS-data-set] \n          \nSpecifies an Annotate data set that enables you to add features to the LPRED plot. \nThe ANNOTATE= data set you specify in the LPREDPLOT statement is used for all plots \ncreated by the statement."},"StatementOptionType":"DV"},{"StatementOptionName":"CAXIS=|CAXES=|CA=","StatementOptionHelp":{"#cdata":"[Syntax: CAXIS=color] \n          \nSpecifies the color used for the axes and tick marks. This option overrides any \nCOLOR= specifications in an AXIS statement. The default is the first color in the \ndevice color list."},"StatementOptionType":"C"},{"StatementOptionName":"CFIT=","StatementOptionHelp":{"#cdata":"[Syntax: CFIT=color] \n          \nSpecifies the color for the fitted LPRED curves. The default is the first color in the \ndevice color list."},"StatementOptionType":"C"},{"StatementOptionName":"CFRAME=|CFR=","StatementOptionHelp":{"#cdata":"[Syntax: CFRAME=color] \n          \nSpecifies the color for the area enclosed by the axes and frame. The area is not shaded \nby default."},"StatementOptionType":"C"},{"StatementOptionName":"CGRID=","StatementOptionHelp":{"#cdata":"[Syntax: CGRID=color] \n          \nSpecifies the color for grid lines. The default is the first color in the device color list."},"StatementOptionType":"C"},{"StatementOptionName":"CHREF=|CH=","StatementOptionHelp":{"#cdata":"[Syntax: CHREF=color] \n          \nSpecifies the color for lines requested by the HREF= option. The default is the first \ncolor in the device color list."},"StatementOptionType":"C"},{"StatementOptionName":"CTEXT=","StatementOptionHelp":{"#cdata":"[Syntax: CTEXT=color] \n          \nSpecifies the color for tick mark values and axis labels. The default is the color \nspecified for the CTEXT= option in the most recent GOPTIONS statement."},"StatementOptionType":"C"},{"StatementOptionName":"CVREF=|CV=","StatementOptionHelp":{"#cdata":"[Syntax: CVREF=color] \n          \nSpecifies the color for lines requested by the VREF= option. The default is the first \ncolor in the device color list."},"StatementOptionType":"C"},{"StatementOptionName":"DESCRIPTION=|DES=","StatementOptionHelp":{"#cdata":"[Syntax: DESCRIPTION='string'] \n          \nSpecifies a description, up to 40 characters, that appears in the PROC GREPLAY master \nmenu. The default is the variable name."},"StatementOptionType":"V"},{"StatementOptionName":"FONT=","StatementOptionHelp":{"#cdata":"[Syntax: FONT=font] \n          \nSpecifies a software font for reference line and axis labels. You can also specify fonts for axis \nlabels in an AXIS statement. The FONT= font takes precedence over the FTEXT= font specified in the \nGOPTIONS statement."},"StatementOptionType":"V"},{"StatementOptionName":"HAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: HAXIS=value1 to value2 <by value3>] \n          \nSpecifies tick mark values for the horizontal axis; value1, value2, and value3 must \nbe numeric, and value1 must be less than value2. The lower tick mark is value1. Tick \nmarks are drawn at increments of value3. The last tick mark is the greatest value that \ndoes not exceed value2. If value3 is omitted, a value of 1 is used."},"StatementOptionType":"V"},{"StatementOptionName":"HEIGHT=","StatementOptionHelp":{"#cdata":"[Syntax: HEIGHT=value] \n          \nSpecifies the height of text used outside framed areas. The default value \nis 3.846 (in percentage)."},"StatementOptionType":"V"},{"StatementOptionName":"HLOWER=","StatementOptionHelp":{"#cdata":"[Syntax: HLOWER=value] \n          \nSpecifies the lower limit on the horizontal axis scale. The HLOWER= option specifies \nvalue as the lower horizontal axis tick mark. The tick mark interval and the upper axis \nlimit are determined automatically. This option has no effect if the HAXIS= option is \nused."},"StatementOptionType":"V"},{"StatementOptionName":"HOFFSET=","StatementOptionHelp":{"#cdata":"[Syntax: HOFFSET=value] \n          \nSpecifies offset for horizontal axis. The default value is 1."},"StatementOptionType":"V"},{"StatementOptionName":"HUPPER=","StatementOptionHelp":{"#cdata":"[Syntax: HUPPER=value] \n          \nSpecifies value as the upper horizontal axis tick mark. The tick mark interval \nand the lower axis limit are determined automatically. This option has no effect \nif the HAXIS= option is used."},"StatementOptionType":"V"},{"StatementOptionName":"HREF","StatementOptionHelp":{"#cdata":"[Syntax: HREF <(INTERSECT)> =value-list] \n          \nRequests reference lines perpendicular to the horizontal axis. If (INTERSECT) is specified, \na second reference line perpendicular to the vertical axis is drawn that intersects the fit \nline at the same point as the horizontal axis reference line. If a horizontal axis reference \nline label is specified, the intersecting vertical axis reference line is labeled with the \nvertical axis value."},"StatementOptionType":"S|V","SubOptionsKeywords":"INTERSECT"},{"StatementOptionName":"HREFLABELS=|HREFLABEL=|HREFLAB=","StatementOptionHelp":{"#cdata":"[Syntax: HREFLABELS='label1' ...'labeln'] \n          \nSpecifies labels for the lines requested by the HREF= option. The number of labels must equal the \nnumber of lines. Enclose each label in quotes. Labels can have up to 16 characters."},"StatementOptionType":"V"},{"StatementOptionName":"HREFLABPOS=","StatementOptionHelp":{"#cdata":"Specifies the vertical position of the HREFLABELS= labels."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2","@Value3":"3","@Value4":"4","@Value5":"5","@Value6":"6"},"StatementOptionToolTips":{"@ToolTip1":"Top of plot","@ToolTip2":"Staggered from top","@ToolTip3":"Bottom of plot","@ToolTip4":"Staggered from bottom","@ToolTip5":"Alternating from top","@ToolTip6":"Alternating from bottom"}},{"StatementOptionName":"INBORDER","StatementOptionHelp":{"#cdata":"Requests a border around LPRED plots."},"StatementOptionType":"S"},{"StatementOptionName":"LEVEL=|ORDINAL=","StatementOptionHelp":{"#cdata":"[Syntax: LEVEL=(character-list) | ORDINAL=(character-list)] \n          \nSpecifies the names of the levels for which LPRED curves are requested. Names should \nbe quoted and separated by space. If there is no correct name provided, no LPRED curve \nis plotted."},"StatementOptionType":"V"},{"StatementOptionName":"LFIT=","StatementOptionHelp":{"#cdata":"[Syntax: LFIT=linetype] \n          \nSpecifies a line style for fitted curves. By default, fitted curves are drawn \nby connecting solid lines (linetype = 1)."},"StatementOptionType":"V"},{"StatementOptionName":"LGRID=","StatementOptionHelp":{"#cdata":"[Syntax: LGRID=linetype] \n          \nSpecifies a line style for all grid lines. linetype is between 1 and 46. \nThe default is 35."},"StatementOptionType":"V"},{"StatementOptionName":"LHREF=|LH=","StatementOptionHelp":{"#cdata":"[Syntax: LHREF=linetype] \n          \nSpecifies the line type for lines requested by the HREF= option. The default \nis 2, which produces a dashed line."},"StatementOptionType":"V"},{"StatementOptionName":"LVREF=|LV=","StatementOptionHelp":{"#cdata":"[Syntax: LVREF=linetype] \n          \nSpecifies the line type for lines requested by the VREF= option. The default \nis 2, which produces a dashed line."},"StatementOptionType":"V"},{"StatementOptionName":"NAME=","StatementOptionHelp":{"#cdata":"[Syntax: NAME='string'] \n          \nSpecifies a name for the plot, up to eight characters, that appears in the \nPROC GREPLAY master menu. The default value is 'PROBIT'."},"StatementOptionType":"V"},{"StatementOptionName":"NOCONF","StatementOptionHelp":{"#cdata":"Suppresses confidence limits from the plot. This works only for the binomial model. \nConfidence limits are not plotted for the multinomial model."},"StatementOptionType":"S"},{"StatementOptionName":"NODATA","StatementOptionHelp":{"#cdata":"Suppresses observed data points from the plot. This works only for the binomial model. \nData points are not plotted for the multinomial model."},"StatementOptionType":"S"},{"StatementOptionName":"NOFIT","StatementOptionHelp":{"#cdata":"Suppresses the fitted LPRED curves."},"StatementOptionType":"S"},{"StatementOptionName":"NOFRAME","StatementOptionHelp":{"#cdata":"Suppresses the frame around plotting areas."},"StatementOptionType":"S"},{"StatementOptionName":"NOGRID","StatementOptionHelp":{"#cdata":"Suppresses grid lines."},"StatementOptionType":"S"},{"StatementOptionName":"NOHLABEL","StatementOptionHelp":{"#cdata":"Suppresses horizontal labels."},"StatementOptionType":"S"},{"StatementOptionName":"NOHTICK","StatementOptionHelp":{"#cdata":"Suppresses horizontal tick marks."},"StatementOptionType":"S"},{"StatementOptionName":"NOTHRESH","StatementOptionHelp":{"#cdata":"Suppresses the threshold line."},"StatementOptionType":"S"},{"StatementOptionName":"NOVLABEL","StatementOptionHelp":{"#cdata":"Suppresses vertical labels."},"StatementOptionType":"S"},{"StatementOptionName":"NOVTICK","StatementOptionHelp":{"#cdata":"Suppresses vertical tick marks."},"StatementOptionType":"S"},{"StatementOptionName":"THRESHLABPOS=","StatementOptionHelp":{"#cdata":"Specifies the horizontal position of labels for the threshold line."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2"},"StatementOptionToolTips":{"@ToolTip1":"Labels are placed to the left of the plot.","@ToolTip2":"Labels are placed to the right of the plot."}},{"StatementOptionName":"VAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: VAXIS=value1 to value2 <by value3> ] \n          \nSpecifies tick mark values for the vertical axis; value1, value2, and value3 must \nbe numeric, and value1 must be less than value2. The lower tick mark is value1. Tick \nmarks are drawn at increments of value3. The last tick mark is the greatest value that \ndoes not exceed value2. This method of specification of tick marks is not valid for \nlogarithmic axes. If value3 is omitted, a value of 1 is used."},"StatementOptionType":"V"},{"StatementOptionName":"VAXISLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: VAXISLABEL='string'] \n          \nSpecifies a label for the vertical axis."},"StatementOptionType":"V"},{"StatementOptionName":"VLOWER=","StatementOptionHelp":{"#cdata":"[Syntax: VLOWER=value] \n          \nSpecifies the lower limit on the vertical axis scale. The VLOWER= option specifies \nvalue as the lower vertical axis tick mark. The tick mark interval and the upper \naxis limit are determined automatically. This option has no effect if the VAXIS= \noption is used."},"StatementOptionType":"V"},{"StatementOptionName":"VREF=","StatementOptionHelp":{"#cdata":"[Syntax: VREF=value-list] \n          \nRequests reference lines perpendicular to the vertical axis. If (INTERSECT) \nis specified, a second reference line perpendicular to the horizontal axis \nis drawn that intersects the fit line at the same point as the vertical axis \nreference line. If a vertical axis reference line label is specified, the \nintersecting horizontal axis reference line is labeled with the horizontal \naxis value."},"StatementOptionType":"V"},{"StatementOptionName":"VREFLABELS=|VREFLABEL=|VREFLAB=","StatementOptionHelp":{"#cdata":"[Syntax: VREFLABELS='label1'...'labeln'] \n          \nSpecifies labels for the lines requested by the VREF= option. The number of labels must equal the \nnumber of lines. Enclose each label in quotes. Labels can have up to 16 characters."},"StatementOptionType":"V"},{"StatementOptionName":"VREFLABPOS=","StatementOptionHelp":{"#cdata":"Specifies the horizontal position of labels for VREF= lines."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2"},"StatementOptionToolTips":{"@ToolTip1":"Labels are positioned to the left of the plot.","@ToolTip2":"Labels are positioned to the right of the plot."}},{"StatementOptionName":"VUPPER=","StatementOptionHelp":{"#cdata":"[Syntax: VUPPER=value] \n          \nSpecifies the upper limit on the vertical axis scale. The VUPPER= option specifies \nvalue as the upper vertical axis tick mark. The tick mark interval and the lower axis \nlimit are determined automatically. This option has no effect if the VAXIS= option is \nused."},"StatementOptionType":"V"},{"StatementOptionName":"WAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: WAXIS=n] \n          \nSpecifies the line thickness for axes and frame. The default value is 1."},"StatementOptionType":"V"},{"StatementOptionName":"WFIT=","StatementOptionHelp":{"#cdata":"[Syntax: WFIT=n] \n          \nSpecifies line thickness for fitted curves. The default value is 1."},"StatementOptionType":"V"},{"StatementOptionName":"WGRID=","StatementOptionHelp":{"#cdata":"[Syntax: WGRID=n] \n          \nSpecifies line thickness for grids. The default value is 1."},"StatementOptionType":"V"},{"StatementOptionName":"WREFL=","StatementOptionHelp":{"#cdata":"[Syntax: WREFL=n] \n          \nSpecifies line thickness for reference lines. The default value is 1."},"StatementOptionType":"V"}]}},{"StatementName":"PREDPPLOT","StatementHelp":{"#cdata":"[Syntax:  PREDPPLOT <var = variable> <options> ; \n\nThe PREDPPLOT statement plots the predicted probability against a single continuous \nvariable (dose variable) in the MODEL statement for both the binomial model and the \nmultinomial model. Confidence limits are available only for the binomial model. An \nattached box on the right side of the plot is used to label predicted probability \ncurves with the names of their levels for the multinomial model. You can specify \nthe color of this box by using the CLABBOX= option."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"VAR=","StatementOptionHelp":{"#cdata":"[Syntax: VAR=variable] \n          \nSpecifies a single continuous variable (dose variable) in the independent variable \nlist of the MODEL statement. If a VAR= variable is not specified, the first single \ncontinuous variable in the independent variable list of the MODEL statement is used. \nIf such a variable does not exist in the independent variable list of the MODEL \nstatement, an error is reported."},"StatementOptionType":"V"},{"StatementOptionName":"ANNOTATE=|ANNO=","StatementOptionHelp":{"#cdata":"[Syntax: ANNOTATE=SAS-data-set] \n          \nSpecifies an Annotate data set that enables you to add features to the PREDP plot. \nThe ANNOTATE= data set you specify in the PREDPPLOT statement is used for all plots \ncreated by the statement."},"StatementOptionType":"DV"},{"StatementOptionName":"CAXIS=|CAXES=|CA=","StatementOptionHelp":{"#cdata":"[Syntax: CAXIS=color] \n          \nSpecifies the color used for the axes and tick marks. This option overrides any \nCOLOR= specifications in an AXIS statement. The default is the first color in the \ndevice color list."},"StatementOptionType":"C"},{"StatementOptionName":"CFIT=","StatementOptionHelp":{"#cdata":"[Syntax: CFIT=color] \n          \nSpecifies the color for the fitted PREDP curves. The default is the first color in the \ndevice color list."},"StatementOptionType":"C"},{"StatementOptionName":"CFRAME=|CFR=","StatementOptionHelp":{"#cdata":"[Syntax: CFRAME=color] \n          \nSpecifies the color for the area enclosed by the axes and frame. The area is not shaded \nby default."},"StatementOptionType":"C"},{"StatementOptionName":"CGRID=","StatementOptionHelp":{"#cdata":"[Syntax: CGRID=color] \n          \nSpecifies the color for grid lines. The default is the first color in the device \ncolor list."},"StatementOptionType":"C"},{"StatementOptionName":"CHREF=|CH=","StatementOptionHelp":{"#cdata":"[Syntax: CHREF=color] \n          \nSpecifies the color for lines requested by the HREF= option. The default is the first \ncolor in the device color list."},"StatementOptionType":"C"},{"StatementOptionName":"CTEXT=","StatementOptionHelp":{"#cdata":"[Syntax: CTEXT=color] \n          \nSpecifies the color for tick mark values and axis labels. The default is the color \nspecified for the CTEXT= option in the most recent GOPTIONS statement."},"StatementOptionType":"C"},{"StatementOptionName":"CVREF=|CV=","StatementOptionHelp":{"#cdata":"[Syntax: CVREF=color] \n          \nSpecifies the color for lines requested by the VREF= option. The default is the first \ncolor in the device color list."},"StatementOptionType":"C"},{"StatementOptionName":"DESCRIPTION=|DES=","StatementOptionHelp":{"#cdata":"[Syntax: DESCRIPTION='string'] \n          \nSpecifies a description, up to 40 characters, that appears in the PROC GREPLAY master \nmenu. The default is the variable name."},"StatementOptionType":"V"},{"StatementOptionName":"FONT=","StatementOptionHelp":{"#cdata":"[Syntax: FONT=font] \n          \nSpecifies a software font for reference line and axis labels. You can also specify fonts for axis \nlabels in an AXIS statement. The FONT= font takes precedence over the FTEXT= font specified in the \nGOPTIONS statement."},"StatementOptionType":"V"},{"StatementOptionName":"HAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: HAXIS=value1 to value2 <by value3>] \n          \nSpecifies tick mark values for the horizontal axis; value1, value2, and value3 must \nbe numeric, and value1 must be less than value2. The lower tick mark is value1. Tick \nmarks are drawn at increments of value3. The last tick mark is the greatest value that \ndoes not exceed value2. If value3 is omitted, a value of 1 is used."},"StatementOptionType":"V"},{"StatementOptionName":"HEIGHT=","StatementOptionHelp":{"#cdata":"[Syntax: HEIGHT=value] \n          \nSpecifies the height of text used outside framed areas. The default value \nis 3.846 (in percentage)."},"StatementOptionType":"V"},{"StatementOptionName":"HLOWER=","StatementOptionHelp":{"#cdata":"[Syntax: HLOWER=value] \n          \nSpecifies the lower limit on the horizontal axis scale. The HLOWER= option specifies \nvalue as the lower horizontal axis tick mark. The tick mark interval and the upper axis \nlimit are determined automatically. This option has no effect if the HAXIS= option is \nused."},"StatementOptionType":"V"},{"StatementOptionName":"HOFFSET=","StatementOptionHelp":{"#cdata":"[Syntax: HOFFSET=value] \n          \nSpecifies offset for horizontal axis. The default value is 1."},"StatementOptionType":"V"},{"StatementOptionName":"HUPPER=","StatementOptionHelp":{"#cdata":"[Syntax: HUPPER=value] \n          \nSpecifies value as the upper horizontal axis tick mark. The tick mark interval \nand the lower axis limit are determined automatically. This option has no effect \nif the HAXIS= option is used."},"StatementOptionType":"V"},{"StatementOptionName":"HREF","StatementOptionHelp":{"#cdata":"[Syntax: HREF <(INTERSECT)> =value-list] \n          \nRequests reference lines perpendicular to the horizontal axis. If (INTERSECT) is specified, \na second reference line perpendicular to the vertical axis is drawn that intersects the fit \nline at the same point as the horizontal axis reference line. If a horizontal axis reference \nline label is specified, the intersecting vertical axis reference line is labeled with the \nvertical axis value."},"StatementOptionType":"S|V","SubOptionsKeywords":"INTERSECT"},{"StatementOptionName":"HREFLABELS=|HREFLABEL=|HREFLAB=","StatementOptionHelp":{"#cdata":"[Syntax: HREFLABELS='label1' ...'labeln'] \n          \nSpecifies labels for the lines requested by the HREF= option. The number of labels must equal the \nnumber of lines. Enclose each label in quotes. Labels can have up to 16 characters."},"StatementOptionType":"V"},{"StatementOptionName":"HREFLABPOS=","StatementOptionHelp":{"#cdata":"Specifies the vertical position of the HREFLABELS= labels."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2","@Value3":"3","@Value4":"4","@Value5":"5","@Value6":"6"},"StatementOptionToolTips":{"@ToolTip1":"Top of plot","@ToolTip2":"Staggered from top","@ToolTip3":"Bottom of plot","@ToolTip4":"Staggered from bottom","@ToolTip5":"Alternating from top","@ToolTip6":"Alternating from bottom"}},{"StatementOptionName":"INBORDER","StatementOptionHelp":{"#cdata":"Requests a border around PREDP plots."},"StatementOptionType":"S"},{"StatementOptionName":"LEVEL=|ORDINAL=","StatementOptionHelp":{"#cdata":"[Syntax: LEVEL=(character-list) | ORDINAL=(character-list)] \n          \nSpecifies the names of the levels for which PREDP curves are requested. Names should \nbe quoted and separated by space. If there is no correct name provided, no PREDP curve \nis plotted."},"StatementOptionType":"V"},{"StatementOptionName":"LFIT=","StatementOptionHelp":{"#cdata":"[Syntax: LFIT=linetype] \n          \nSpecifies a line style for fitted curves. By default, fitted curves are drawn \nby connecting solid lines (linetype = 1)."},"StatementOptionType":"V"},{"StatementOptionName":"LGRID=","StatementOptionHelp":{"#cdata":"[Syntax: LGRID=linetype] \n          \nSpecifies a line style for all grid lines. linetype is between 1 and 46. \nThe default is 35."},"StatementOptionType":"V"},{"StatementOptionName":"LHREF=|LH=","StatementOptionHelp":{"#cdata":"[Syntax: LHREF=linetype] \n          \nSpecifies the line type for lines requested by the HREF= option. The default \nis 2, which produces a dashed line."},"StatementOptionType":"V"},{"StatementOptionName":"LVREF=|LV=","StatementOptionHelp":{"#cdata":"[Syntax: LVREF=linetype] \n          \nSpecifies the line type for lines requested by the VREF= option. The default \nis 2, which produces a dashed line."},"StatementOptionType":"V"},{"StatementOptionName":"NAME=","StatementOptionHelp":{"#cdata":"[Syntax: NAME='string'] \n          \nSpecifies a name for the plot, up to eight characters, that appears in the \nPROC GREPLAY master menu. The default value is 'PROBIT'."},"StatementOptionType":"V"},{"StatementOptionName":"NOFIT","StatementOptionHelp":{"#cdata":"Suppresses the fitted PREDP curves."},"StatementOptionType":"S"},{"StatementOptionName":"NOFRAME","StatementOptionHelp":{"#cdata":"Suppresses the frame around plotting areas."},"StatementOptionType":"S"},{"StatementOptionName":"NOGRID","StatementOptionHelp":{"#cdata":"Suppresses grid lines."},"StatementOptionType":"S"},{"StatementOptionName":"NOHLABEL","StatementOptionHelp":{"#cdata":"Suppresses horizontal labels."},"StatementOptionType":"S"},{"StatementOptionName":"NOHTICK","StatementOptionHelp":{"#cdata":"Suppresses horizontal tick marks."},"StatementOptionType":"S"},{"StatementOptionName":"NOTHRESH","StatementOptionHelp":{"#cdata":"Suppresses the threshold line."},"StatementOptionType":"S"},{"StatementOptionName":"NOVLABEL","StatementOptionHelp":{"#cdata":"Suppresses vertical labels."},"StatementOptionType":"S"},{"StatementOptionName":"NOVTICK","StatementOptionHelp":{"#cdata":"Suppresses vertical tick marks."},"StatementOptionType":"S"},{"StatementOptionName":"THRESHLABPOS=","StatementOptionHelp":{"#cdata":"Specifies the horizontal position of labels for the threshold line."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2"},"StatementOptionToolTips":{"@ToolTip1":"Labels are placed to the left of the plot.","@ToolTip2":"Labels are placed to the right of the plot."}},{"StatementOptionName":"VAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: VAXIS=value1 to value2 <by value3> ] \n          \nSpecifies tick mark values for the vertical axis; value1, value2, and value3 must \nbe numeric, and value1 must be less than value2. The lower tick mark is value1. Tick \nmarks are drawn at increments of value3. The last tick mark is the greatest value that \ndoes not exceed value2. This method of specification of tick marks is not valid for \nlogarithmic axes. If value3 is omitted, a value of 1 is used."},"StatementOptionType":"V"},{"StatementOptionName":"VAXISLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: VAXISLABEL='string'] \n          \nSpecifies a label for the vertical axis."},"StatementOptionType":"V"},{"StatementOptionName":"VLOWER=","StatementOptionHelp":{"#cdata":"[Syntax: VLOWER=value] \n          \nSpecifies the lower limit on the vertical axis scale. The VLOWER= option specifies \nvalue as the lower vertical axis tick mark. The tick mark interval and the upper \naxis limit are determined automatically. This option has no effect if the VAXIS= \noption is used."},"StatementOptionType":"V"},{"StatementOptionName":"VREF=","StatementOptionHelp":{"#cdata":"[Syntax: VREF=value-list] \n          \nRequests reference lines perpendicular to the vertical axis. If (INTERSECT) \nis specified, a second reference line perpendicular to the horizontal axis \nis drawn that intersects the fit line at the same point as the vertical axis \nreference line. If a vertical axis reference line label is specified, the \nintersecting horizontal axis reference line is labeled with the horizontal \naxis value."},"StatementOptionType":"V"},{"StatementOptionName":"VREFLABELS=|VREFLABEL=|VREFLAB=","StatementOptionHelp":{"#cdata":"[Syntax: VREFLABELS='label1'...'labeln'] \n          \nSpecifies labels for the lines requested by the VREF= option. The number of labels must equal the \nnumber of lines. Enclose each label in quotes. Labels can have up to 16 characters."},"StatementOptionType":"V"},{"StatementOptionName":"VREFLABPOS=","StatementOptionHelp":{"#cdata":"Specifies the horizontal position of labels for VREF= lines."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2"},"StatementOptionToolTips":{"@ToolTip1":"Labels are positioned to the left of the plot.","@ToolTip2":"Labels are positioned to the right of the plot."}},{"StatementOptionName":"VUPPER=","StatementOptionHelp":{"#cdata":"[Syntax: VUPPER=value] \n          \nSpecifies the upper limit on the vertical axis scale. The VUPPER= option specifies \nvalue as the upper vertical axis tick mark. The tick mark interval and the lower axis \nlimit are determined automatically. This option has no effect if the VAXIS= option is \nused."},"StatementOptionType":"V"},{"StatementOptionName":"WAXIS=","StatementOptionHelp":{"#cdata":"[Syntax: WAXIS=n] \n          \nSpecifies the line thickness for axes and frame. The default value is 1."},"StatementOptionType":"V"},{"StatementOptionName":"WFIT=","StatementOptionHelp":{"#cdata":"[Syntax: WFIT=n] \n          \nSpecifies line thickness for fitted curves. The default value is 1."},"StatementOptionType":"V"},{"StatementOptionName":"WGRID=","StatementOptionHelp":{"#cdata":"[Syntax: WGRID=n] \n          \nSpecifies line thickness for grids. The default value is 1."},"StatementOptionType":"V"},{"StatementOptionName":"WREFL=","StatementOptionHelp":{"#cdata":"[Syntax: WREFL=n] \n          \nSpecifies line thickness for reference lines. The default value is 1."},"StatementOptionType":"V"}]}}]}}}