{"Procedure":{"Name":"PSMOOTH","ProductGroup":"SAS/GENETICS","ProcedureHelp":{"#cdata":"Syntax: PROC PSMOOTH <options> ; \n    BY variables ; \n    ID variables ; \n    VAR variables ; \n\nIn the search for complex disease genes, linkage and/or association tests are often \nperformed on markers from a genome-wide scan or SNPs from a finely scaled map. This \nmeans hundreds or even thousands of hypotheses are being simultaneously tested. \nPlotting the negative log p-values of all the marker tests will reveal many peaks \nthat indicate significant test results, some of which are false positives. In order \nto reduce the number of false positives or improve power, smoothing methods can be \napplied that take into account p-values from neighboring, and possibly correlated, \nmarkers. That is, the peak length can be used to indicate significance in addition \nto the peak height. The PSMOOTH procedure offers smoothing methods that implement \nSimes’ method (1986), Fisher’s method (1932), and/or the truncated product method \n(TPM) (Zaykin et al. 2002) for multiple hypothesis testing. These methods modify \nthe p-value from each marker test by using a function of its original p-value and \nthe p-values of the tests on the nearest markers. Since the number of hypothesis \ntests being performed is not reduced, adjustments to correct the smoothed p-values \nfor multiple testing are available as well. \n\nPROC PSMOOTH can take any data set containing any number of columns of p-values as \nan input data set, including the output data sets from the CASECONTROL and FAMILY \nprocedures."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"ADJUST=","ProcedureOptionHelp":{"#cdata":"Indicates which adjustment for multiple testing to apply to the set(s) of p-values in \nthe output data set. This adjustment is applied after any smoothing has occurred. \n\nADJUST=NONE is the default."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"NONE","@Value2":"BONFERRONI|BON","@Value3":"FDR","@Value4":"SIDAK"},"ProcedureOptionToolTips":{"@ToolTip1":"Specifies no adjustment for multiple testing.","@ToolTip2":"Specifies the Bonferroni method.","@ToolTip3":"Specifies the false discovery rate method.","@ToolTip4":"Specifies the Sidak method."}},{"ProcedureOptionName":"BANDWIDTH=","ProcedureOptionHelp":{"#cdata":"[Syntax: BANDWIDTH=number-list] \n      \nGives the values for the bandwidths to use in combining p-values. A bandwidth of w \nindicates that w p-values on each side of the original p-value are included in the \ncombining method to create a sliding window of size 2w + 1."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nNames the input SAS data set to be used by PROC PSMOOTH. The default is to use the \nmost recently created data set."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"FISHER","ProcedureOptionHelp":{"#cdata":"Requests that Fisher’s method for combining p-values from multiple hypotheses be \napplied to the original p-values."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NEGLOG","ProcedureOptionHelp":{"#cdata":"Requests that all p-values, original and combined, be transformed to their negative \nlog (base e) in the output data set; that is, for each p-value, -log(p-value) is \nreported in the OUT= data set. This option is useful for graphing purposes."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NEGLOG10","ProcedureOptionHelp":{"#cdata":"Requests that all p-values, original and combined, be transformed to their negative \nlog (base 10) in the output data set; that is, for each p-value, -log10(p-value) \nis reported in the OUT= data set. This option is useful for graphing purposes."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"OUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUT=SAS-data-set] \n      \nNames the output SAS data set containing the original p-values and the new combined \np-values. When this option is omitted, an output data set is created by default and \nnamed according to the DATAn convention."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SIMES","ProcedureOptionHelp":{"#cdata":"Requests that Simes’ method for combining p-values from multiple hypotheses be applied \nto the original p-values."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"TAU=","ProcedureOptionHelp":{"#cdata":"[Syntax: TAU=number] \n      \nIndicates the value of τ to be used in the TPM. The significance level for the tests \ncan be used as the value for number, although this is not the only possibility. The \nvalue of number must be greater than 0 and less than or equal to 1. By default, number \nis set to 0.05. This option is ignored if the TPM option is not specified."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"TPM","ProcedureOptionHelp":{"#cdata":"Requests that the TPM for combining p-values from multiple hypotheses be applied \nto the original p-values."},"ProcedureOptionType":"S"}]},"ProcedureStatements":[{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nYou can specify a BY statement with PROC PSMOOTH to obtain separate analyses on \nobservations in groups defined by the BY variables. When a BY statement appears, \nthe procedure expects the input data set to be sorted in the order of the BY \nvariables. The variables are one or more variables in the input data set."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"ID","StatementHelp":{"#cdata":"Syntax: ID variables ; \n\nThe ID statement identifies the variables from the DATA= data set that should be \nincluded in the OUT= data set."},"StatementOptions":null},{"StatementName":"VAR","StatementHelp":{"#cdata":"Syntax: VAR variables ; \n\nThe VAR statement identifies the variables containing the original p-values on which \nthe combining methods should be performed."},"StatementOptions":null}]},null]}}