{"Procedure":{"Name":"QUANTLIFE","ProductGroup":"SAS/STAT","ProcedureHelp":{"#cdata":"Syntax: PROC QUANTLIFE <options> ; \n    BASELINE <options> ; \n    BY variables ; \n    CLASS variables ; \n    EFFECT name = effect-type ( variables </ options> ) ; \n    MODEL response <*censor(list)> = <effects> </ options> ; \n    OUTPUT <OUT=SAS-data-set> <keyword=name …keyword=name> ; \n    TEST effects </ options> ; \n    WEIGHT variable ; \n\n[SAS/STAT 12.1 Experimental Procedure]\n\nThe QUANTLIFE procedure performs quantile regression analysis for survival data, where observations \nare not always directly observed. \n\nQuantile regression (Koenker and Bassett, 1978) is a type of regression analysis that explores how \nthe conditional quantile of a response variable depends on its covariates. By estimating a set of \nconditional quantiles, you can gain more insight about the conditional distribution of the response \ngiven its covariates. \n\nQuantile regression provides a flexible way to capture heterogeneous effects in the sense that the \ntails and the central location of the conditional distributions can vary differently with the covariates. \nThus, quantile regression offers a powerful tool in survival analysis, where the lifetimes are skewed, \nand extreme survival times can be of special interest (Koenker and Geling, 2001; Huang, 2010)."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"ALPHA=","ProcedureOptionHelp":{"#cdata":"Syntax: ALPHA=value \n      \nSpecifies the confidence level for the regression parameters. The value must be between 0 and 1. \nThe default is ALPHA=0.05, which corresponds to a 95% confidence interval."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"CI=","ProcedureOptionHelp":{"#cdata":"Syntax: CI= EW | PW | NONE \n      \nSpecifies the method used to compute confidence intervals for regression parameters. In addition \nto confidence intervals, the QUANTLIFE procedure also computes standard errors, t values, and \np-values for regression parameters. You can suppress these computations by specifying CI=NONE. \nThe QUANTLIFE procedure provides two resampling methods for computing confidence intervals, \nthe exponentially weighted (EW) method and the pairwise (PW) resampling method. \n\nThe default is CI=EW, which requests the exponentially weighted method."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"EW","@Value2":"PW","@Value3":"NONE"},"ProcedureOptionToolTips":{"@ToolTip1":"Exponentially weighted (EW) resampling method for computing confidence intervals","@ToolTip2":"Pairwise resampling method for computing confidence intervals","@ToolTip3":"Suppresses computations of confidence intervals for regression parameters"}},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"Syntax: DATA=SAS-data-set\n      \nSpecifies the input SAS data set that the QUANTLIFE procedure uses. By default, the most recently \ncreated SAS data set is used. "},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"GRIDSIZE=","ProcedureOptionHelp":{"#cdata":"Syntax: GRIDSIZE=value \n      \nSpecifies the step size for computing regression quantiles. The value must be between 0 and 1."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"INITTAU=","ProcedureOptionHelp":{"#cdata":"Syntax: INITTAU=value \n      \nSpecifies the first quantile level for computing regression quantiles. \n\nThe value must be between 0 and 1."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"KAPPA=","ProcedureOptionHelp":{"#cdata":"Syntax: KAPPA=value \n      \nSpecifies the step-length parameter for the interior point algorithm. The value must \nbe between 0 and 1. The interior point method used by the QUANTLIFE is identical to \nthe interior point method used by the QUANTREG procedure. \n\nThe default is KAPPA=0.99995."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"LOG","ProcedureOptionHelp":{"#cdata":"Requests that a log transformation of the response variable be performed before the model is fitted."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"MAXIT=","ProcedureOptionHelp":{"#cdata":"Syntax: MAXIT=n \n      \nSpecifies the maximum number of iterations for the interior point algorithm. The default is MAXIT= 1000."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"METHOD=","ProcedureOptionHelp":{"#cdata":"Syntax: METHOD= KM | NA  \n      \nSpecifies the method used to estimate the regression parameters. KM specifies the Kaplan-Meier-type \nmethod (see the section Kaplan-Meier-Type Estimator for Censored Quantile Regression) and NA specifies \nthe Nelson-Aalen-type method (see the section Nelson-Aalen-Type Estimator for Censored Quantile Regression). \n\nThe default is METHOD=KM."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"KM","@Value2":"NA"},"ProcedureOptionToolTips":{"@ToolTip1":"Specifies the Kaplan-Meier-type method (see the section Kaplan-Meier-Type Estimator for Censored Quantile Regression)","@ToolTip2":"Specifies the Nelson-Aalen-type method (see the section Nelson-Aalen-Type Estimator for Censored Quantile Regression)."}},{"ProcedureOptionName":"NAMELEN=","ProcedureOptionHelp":{"#cdata":"Syntax: NAMELEN=n \n      \nSpecifies the length of effect names in tables and output data sets to be n characters, \nwhere n is a value between 20 and 200. The default is NAMELEN=20."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NREP=","ProcedureOptionHelp":{"#cdata":"Syntax: NREP=n \n      \nSpecifies the number of replications to draw in the resampling method. The default is NREP=200."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"OUTBOOTEST=","ProcedureOptionHelp":{"#cdata":"Syntax: OUTBOOTEST=SAS-data-set \n      \nCreates a data set to contain the parameter estimates from the resampled data sets."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"PLOTS=","ProcedureOptionHelp":{"#cdata":"Syntax: PLOTS =(plot-request < …plot-request >) \n\nRequests various plots. \n\nWhen you specify one plot-request, you can omit the parentheses around the plot request. \n\nODS Graphics must be enabled before plots can be requested. For example: \n\n  ods graphics on;\n \n  proc quantlife plots=survival;\n     model y=x1;\n  run;\n \n  ods graphics off;"},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"ALL","@Value2":"NONE","@Value3":"QUANTILE","@Value4":"QUANTPLOT","@Value5":"SURVIVAL"},"ProcedureOptionToolTips":{"@ToolTip1":"Creates all appropriate plots.","@ToolTip2":"Suppresses all the plots in the procedure. Specifying this option is equivalent to disabling ODS Graphics for the entire procedure.","@ToolTip3":"Plots the estimated quantile function for each combination of covariate values in the COVARIATES=  data set specified in the BASELINE statement. If the COVARIATES= data set is not specified, the  estimated quantile function is plotted for the reference set of covariate values that consists of  reference levels for the CLASS variables and average values for the continuous variables. When the  estimated quantile function is not monotonic, the quantile function (Chernozhukov, Fernandez-Val,  and Galichon, 2009) is rearranged to make it monotonic and then plotted.","@ToolTip4":"QUANTPLOT </ UNPACK >                                  Plots the regression quantile process. The estimated coefficient of each specified covariate effect  is plotted as a function of the quantile level. You can use the UNPACK option to create individual  process plots.","@ToolTip5":"Plots the estimated survival function for each combination of covariate values in the COVARIATES=  data set specified in the BASELINE statement. If the COVARIATES= data set is not specified, the  estimated survival function is plotted for the reference set of covariate values that consists  of reference levels for the CLASS variables and average values for the continuous variables."},"SubOptionsKeywords":"UNPACK"},{"ProcedureOptionName":"SEED=","ProcedureOptionHelp":{"#cdata":"Syntax: SEED=number\n      \nSpecifies a positive integer to start the pseudorandom number generator. The default is a value \nthat is generated from reading the time of day from the computer’s clock. However, to duplicate \nthe results under identical situations, you must specify the same seed in subsequent runs of the \nQUANTLIFE procedure. The seed information is displayed in the “Model Information” table."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"TOLERANCE=","ProcedureOptionHelp":{"#cdata":"[Syntax: TOLERANCE=value \n      \nSpecifies the tolerance for the convergence criterion of the interior point algorithm. Both the \nQUANTLIFE procedure and the QUANTREG procedure use the duality gap as the convergence criterion. \n\nThe default is TOLERANCE=1E–8."},"ProcedureOptionType":"V"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BASELINE","StatementHelp":{"#cdata":"Syntax: BASELINE <OUT=SAS-data-set> <COVARIATES=SAS-data-set> < keyword=name …keyword=name> ; \n\nThe BASELINE statement creates an output data set to contain the survival function estimates \nor the conditional quantile function estimates for every set of covariates (x) in the COVARIATES= \ndata set. If the COVARIATES= data set is not specified, PROC QUANTLIFE uses a reference set of \ncovariates that consists of the reference levels for the CLASS variables and the average values \nfor the continuous variables."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"OUT=","StatementOptionHelp":{"#cdata":"Syntax: OUT=SAS-data-set \n          \nNames the output data set. If you omit the OUT= option, the data set is created and given a default \nname by using the DATAn convention."},"StatementOptionType":"V"},{"StatementOptionName":"COVARIATES=","StatementOptionHelp":{"#cdata":"Syntax: COVARIATES=SAS-data-set \n          \nNames the SAS data set that contains the sets of explanatory variable values for which the quantities \nof interest are estimated. All variables in the COVARIATES= data set are copied to the OUT= data set. \nThus, the variables in the COVARIATES= data set can be used to identify the covariate sets in the \nOUT= data set."},"StatementOptionType":"V"},{"StatementOptionName":"SURVIVAL=","StatementOptionHelp":{"#cdata":"Syntax: SURVIVAL = name\n          \nSpecifies the estimated survival function."},"StatementOptionType":"V"},{"StatementOptionName":"QUANTILE=","StatementOptionHelp":{"#cdata":"Syntax: QUANTILE = name \n          \nSpecifies the estimated quantile function."},"StatementOptionType":"V"},{"StatementOptionName":"TAU=","StatementOptionHelp":{"#cdata":"Syntax: TAU = name \n          \nSpecifies the quantile level, which is the complement of the survival function."},"StatementOptionType":"V"}]}},{"StatementName":"BY","StatementHelp":{"#cdata":"[Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; ]\n      \nYou can specify a BY statement with PROC QUANTLIFE to obtain separate analyses of observations \nin groups that are defined by the BY variables. When a BY statement appears, the procedure expects \nthe input data set to be sorted in order of the BY variables. If you specify more than one BY \nstatement, only the last one specified is used. \n\nIf your input data set is not sorted in ascending order, use one of the following alternatives: \n\n• Sort the data by using the SORT procedure with a similar BY statement. \n\n• Specify the NOTSORTED or DESCENDING option in the BY statement for the QUANTLIFE procedure. \n  The NOTSORTED option does not mean that the data are unsorted but rather that the data are \n  arranged in groups (according to values of the BY variables) and that these groups are not \n  necessarily in alphabetical or increasing numeric order. \n\n• Create an index on the BY variables by using the DATASETS procedure (in Base SAS software)."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that immediately \nfollows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"The NOTSORTED option does not mean that the data are unsorted but rather that the data are \narranged in groups (according to values of the BY variables) and that these groups are not \nnecessarily in alphabetical or increasing numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"CLASS","StatementHelp":{"#cdata":"Syntax: CLASS variables </ TRUNCATE> ; \n\nThe CLASS statement names the classification variables to be used in the model. Typical \nclassification variables are Treatment, Sex, Race, Group, and Replication. If you use the \nCLASS statement, it must appear before the MODEL statement. \n\nClassification variables can be either character or numeric. By default, class levels \nare determined from the entire set of formatted values of the CLASS variables. \n\nIn any case, you can use formats to group values into levels."},"StatementOptions":{"StatementOption":{"StatementOptionName":"TRUNCATE","StatementOptionHelp":{"#cdata":"Specifies that class levels should be determined by using only up to the first 16 characters \nof the formatted values of CLASS variables."},"StatementOptionType":"S"}}},{"StatementName":"EFFECT","StatementHelp":{"#cdata":"Syntax: EFFECT effect-name = effect-type (var-list < / effect-options >) ; \n\nThe EFFECT statement enables you to construct special collections of columns for design \nmatrices. These collections are referred to as constructed effects to distinguish them \nfrom the usual model effects that are formed from continuous or classification variables, \nas discussed in the section GLM Parameterization of Classification Variables and Effects. \n\nThe name of the effect is specified after the EFFECT keyword. This name can appear \nin only one EFFECT statement and cannot be the name of a variable in the input data \nset. The effect-type is specified after an equal sign, followed by a list of variables \nwithin parentheses which are used in constructing the effect. Effect-options that are \nspecific to an effect-type can be specified after a slash (/) following the variable list. \n\nThe EFFECT statement enables you to construct special collections of columns for design \nmatrices. These collections are referred to as constructed effects to distinguish them \nfrom the usual model effects formed from continuous or classification variables."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"&lt;EFFECT-NAME&gt;=","StatementOptionHelp":{"#cdata":"Replace &lt;EFFECT-NAME&gt; with the name of the effect, specified after the EFFECT keyword. \nThis name can appear in only one EFFECT statement and cannot be the name of a variable in the \ninput data set."},"StatementOptionType":"RV","StatementOptionValues":{"@Value1":"COLLECTION","@Value2":"LAG","@Value3":"MULTIMEMBER|MM","@Value4":"POLYNOMIAL|POLY","@Value5":"SPLINE"},"StatementOptionToolTips":{"@ToolTip1":"Is a collection effect that defines one or more variables as a single effect with  multiple degrees of freedom. The variables in a collection are considered as a  unit for estimation and inference.  Option(s) available (specified after a slash (/) following the variable list):   DETAILS  Displays the constituents of the collection effect","@ToolTip2":"Is a classification effect in which the level that is used for a given period  corresponds to the level in the preceding period.   Options available (specified after a slash (/) following the variable list):    DESIGNROLE=    Names a variable that controls to which lag design an observation is assigned     DETAILS    Displays the lag design of the lag effect     NLAG=    Specifies the number of periods in the lag     PERIOD=    Names the variable that defines the period     WITHIN=    Names the variable or variables that define the group within which each period is defined","@ToolTip3":"Is a multimember classification effect whose levels are determined by one or  more variables that appear in a CLASS statement.   Options available (specified after a slash (/) following the variable list):     NOEFFECT    Specifies that observations with all missing levels for the multimember variables should    have zero values in the corresponding design matrix columns     WEIGHT=    Specifies the weight variable for the contributions of each of the classification effects","@ToolTip4":"Is a multivariate polynomial effect in the specified numeric variables.                                      Options available (specified after a slash (/) following the variable list):     DEGREE=    Specifies the degree of the polynomial     MDEGREE=    Specifies the maximum degree of any variable in a term of the polynomial     STANDARDIZE=    Specifies centering and scaling suboptions for the variables that define the polynomial","@ToolTip5":"Is a regression spline effect whose columns are univariate spline expansions of  one or more variables. A spline expansion replaces the original variable with  an expanded or larger set of new variables.   Options available (specified after a slash (/) following the variable list):     BASIS=    Specifies the type of basis (B-spline basis or truncated power function basis) for the spline expansion     DEGREE=    Specifies the degree of the spline transformation     KNOTMETHOD=    Specifies how to construct the knots for spline effects"},"SubOptionsKeywords":"DETAILS|DESIGNROLE=|NLAG=|WITHIN=|NOEFFECT|WEIGHT=|DEGREE=|MDEGREE=|STANDARDIZE=|BASIS=|KNOTMETHOD="},{"StatementOptionName":"PERIOD=","StatementOptionHelp":{"#cdata":"[For the LAG effect-type only]\n          \n[Syntax: PERIOD=variable] \n          \nSpecifies the period variable of the LAG design. The number of periods is the number \nof unique formatted values of the PERIOD= variable, and the ordering of the period is \nformed by sorting these formatted values in ascending order. You must specify a PERIOD= \nvariable."},"StatementOptionType":"V"},{"StatementOptionName":"WITHIN=","StatementOptionHelp":{"#cdata":"[For the LAG effect-type only] \n          \n[Syntax: WITHIN=(variables) | WITHIN=variable] \n\nSpecifies a variable (or a list of variables within parentheses) that defines the \nsubject grouping of the lag design. If there is only one WITHIN= variable, then the \nparentheses are not required. Each subject is defined by the unique set of formatted \nvalues of the variables in the WITHIN= list. The subjects are sorted in ascending \nlexicographic order. You must specify a WITHIN= variable."},"StatementOptionType":"V"},{"StatementOptionName":"DESIGNROLE=","StatementOptionHelp":{"#cdata":"[For the LAG effect-type only] \n          \n[Syntax: DESIGNROLE=variable] \n\nSpecifies a numeric variable that is used to subset observations into a fitting group \nin which the value of the DESIGNROW= variable is nonzero and a second group in which \nthe value of the specified variable is zero. The observations in the fitting group are \nused to form the LAG design matrix that is used in fitting the model. The LAG design \nthat corresponds to the non-fitting group is used when scoring observations in the \ninput data set that do not belong to the fitting group. This option is useful when \nyou want to obtain predicted values in an output data set for observations that are \nnot used in fitting the model. If you do not specify a DESIGNROLE= variable, then all \nobservations are assigned to the fitting group."},"StatementOptionType":"V"},{"StatementOptionName":"DETAILS","StatementOptionHelp":{"#cdata":"[For the LAG | COLLECTION | MULTIMEMBER | POLYNOMIAL |SPLINE effect-type] \n          \nRequests a table that shows the (1) lag design matrix of the lag effect, or (2) constituents \nof the collection effect, or (3) levels of the multimember effect, or (4) details of the specified \npolynomial, or (5) knot locations and the knots associated with each spline basis function."},"StatementOptionType":"S"},{"StatementOptionName":"NLAG=","StatementOptionHelp":{"#cdata":"[For the LAG effect-type only] \n          \n[Syntax: NLAG= n] \n\nSpecifies the number of lags. By default NLAG=1."},"StatementOptionType":"V"},{"StatementOptionName":"NOEFFECT","StatementOptionHelp":{"#cdata":"[For the MULTIMEMBER effect-type only] \n          \nSpecifies that, for observations with all missing levels of the multimember variables, \nthe values in the corresponding design matrix columns be set to zero."},"StatementOptionType":"S"},{"StatementOptionName":"STDIZE","StatementOptionHelp":{"#cdata":"[For the MULTIMEMBER effect-type only] \n          \nSpecifies that for each observation, the entries in the design matrix that corresponds \nto the multimember effect be scaled to have a sum of one."},"StatementOptionType":"S"},{"StatementOptionName":"WEIGHT=","StatementOptionHelp":{"#cdata":"[For the MULTIMEMBER effect-type only] \n          \n[Syntax: WEIGHT=wght-list] \n\nSpecifies numeric variables used to weigh the contributions of each of the classification \neffects that define the constructed multimember effect. The number of variables in wght-list \nmust match the number of classification variables that define the effect."},"StatementOptionType":"V"},{"StatementOptionName":"DEGREE=","StatementOptionHelp":{"#cdata":"[For the POLYNOMIAL and SPLINE effect-type only] \n          \n[Syntax: DEGREE=n] \n\nSpecifies the (1) degree of the polynomial, or (2) degree of the spline transformation. \nThe degree must be a positive integer. The n degree is typically a small integer, such as \n1, 2, or 3. The default for polynomial effect is DEGREE=1, and DEGREE=3 for spline \ntransformation."},"StatementOptionType":"V"},{"StatementOptionName":"LABELSTYLE=","StatementOptionHelp":{"#cdata":"[For the POLYNOMIAL effect-type only] \n          \n[Syntax: LABELSTYLE=(style-opts) | LABELSTYLE=style-opt] \n\nSpecifies how the terms in the polynomial are labeled. By default, powers are shown \nwith ^ as the exponentiation operator and * as the multiplication operator."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"EXPAND","@Value2":"EXPONENT","@Value3":"INCLUDENAME","@Value4":"PRODUCTSYMBOL="},"StatementOptionToolTips":{"@ToolTip1":"Specifies that each variable with an exponent greater than 1 be written as products of that variable.","@ToolTip2":"Syntax: EXPONENT <=quoted string>                                      Specifies that each variable with an exponent greater than 1 be written using exponential  notation. By default, the symbol ^ is used as the exponentiation operator. If you supply the  optional quoted string after an equal sign, then that string is used as the exponentiation  operator.","@ToolTip3":"Specifies that the name of the effect followed by an underscore be used as a prefix  for term labels.","@ToolTip4":"Syntax: PRODUCTSYMBOL=NONE | quoted string                                      Specifies that the supplied string be used as the product symbol."}},{"StatementOptionName":"MDEGREE=","StatementOptionHelp":{"#cdata":"[For the POLYNOMIAL effect-type only] \n          \n[Syntax: MDEGREE=n] \n\nSpecifies the maximum degree of any variable in a term of the polynomial. This degree \nmust be a positive integer. The default is the degree of the specified polynomial."},"StatementOptionType":"V"},{"StatementOptionName":"NOSEPARATE","StatementOptionHelp":{"#cdata":"[For the POLYNOMIAL effect-type only] \n          \nSpecifies that the polynomial be treated as a single effect with multiple degrees \nof freedom. The effect name that you specify is used as the constructed effect name, \nand the labels of the terms are used as labels of the corresponding parameters."},"StatementOptionType":"S"},{"StatementOptionName":"STANDARDIZE","StatementOptionHelp":{"#cdata":"[For the POLYNOMIAL effect-type only] \n          \n[Syntax: STANDARDIZE <(centerscale-opts)> <= standardize-opt>] \n\nSpecifies that the variables that define the polynomial be standardized. By default, \nthe standardized variables receive prefix \"s_\" in the variable names. \n\nYou can use the following centerscale-opts to specify how the center and scale are estimated: \n\n  METHOD=MOMENTS \n  specifies that the center be estimated by the variable mean and the scale be estimated by the standard deviation. \n\n  METHOD=RANGE \n  specifies that the center be estimated by the midpoint of the variable range and the scale be estimated as half the variable range.\n\n  METHOD=WMOMENTS \n  is the same as METHOD=MOMENTS except that weighted means and weighted standard deviations are used. \n\n  PREFIX=NONE | quoted-string \n  specifies the prefix that is appended to standardized variables when forming the term labels."},"StatementOptionType":"S|V","StatementOptionValues":{"@Value1":"CENTER","@Value2":"CENTERSCALE","@Value3":"NONE","@Value4":"SCALE"},"StatementOptionToolTips":{"@ToolTip1":"Specifies that variables be centered but not scaled.","@ToolTip2":"Specifies that variables be centered and scaled. This is the default if you do not  specify a standardization-opt.","@ToolTip3":"Specifies that no standardization be performed.","@ToolTip4":"Specifies that variables be scaled but not centered."}},{"StatementOptionName":"BASIS=","StatementOptionHelp":{"#cdata":"[For the SPLINE effect-type only] \n          \nSpecifies a basis for the spline expansion."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BSPLINE","@Value2":"TPF"},"StatementOptionToolTips":{"@ToolTip1":"Specifies a B-spline basis for the spline expansion.","@ToolTip2":"Syntax: TPF(options)                                      Specifies a truncated power function basis for the spline expansion.   You can modify the number of columns when you request BASIS=TPF with the following options:     NOINT    excludes the intercept column.     NOPOWERS    excludes the intercept and polynomial columns."}},{"StatementOptionName":"DATABOUNDARY","StatementOptionHelp":{"#cdata":"[For the SPLINE effect-type only]\n          \nSpecifies that the extremes of the data be used as boundary knots when building a B-spline basis."},"StatementOptionType":"S"},{"StatementOptionName":"KNOTMAX=","StatementOptionHelp":{"#cdata":"[For the SPLINE effect-type only]\n          \n[Syntax: KNOTMAX=value] \n\nSpecifies that, for each variable in the EFFECT statement, the right-side boundary \nknots be equally spaced starting at the maximum of the variable and ending at the \nspecified value. This option is ignored for variables whose maximum value is greater \nthan the specified value or if the DATABOUNDARY option is also specified."},"StatementOptionType":"V"},{"StatementOptionName":"KNOTMETHOD=","StatementOptionHelp":{"#cdata":"[For the SPLINE effect-type only] \n          \nSpecifies how to construct the knots for spline effects."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"EQUAL","@Value2":"LIST","@Value3":"LISTWITHBOUNDARY","@Value4":"MULTISCALE","@Value5":"PERCENTILES","@Value6":"RANGEFRACTIONS"},"StatementOptionToolTips":{"@ToolTip1":"Syntax: EQUAL<(n)>               Specifies that n equally spaced knots be positioned between the extremes of the data.  The default is n=3. For a B-spline basis, any needed boundary knots continue to be  equally spaced unless the DATABOUNDARY option has also been specified. KNOTMETHOD=EQUAL  is the default if no knot-method is specified.","@ToolTip2":"Syntax: LIST(number-list)                                      Specifies the list of internal knots to be used in forming the spline basis columns.  For a B-spline basis, the data extremes are used as boundary knots.","@ToolTip3":"Syntax: LISTWITHBOUNDARY(number-list)                                      Specifies the list of all knots that are used in forming the spline basis columns.","@ToolTip4":"Syntax: MULTISCALE<(multiscale-options)>                                      Specifies that multiple B-spline bases be generated, corresponding to sets with an  increasing number of internal knots.   You can control which scales are included with the following multiscale-options:     STARTSCALE=n    specifies the start scale, where n is a positive integer. The default is STARTSCALE=0.     ENDSCALE=n    specifies the end scale, where n is a positive integer. The default is ENDSCALE=7.","@ToolTip5":"Syntax: PERCENTILES(n)                                      Requests that internal knots be placed at n equally spaced percentiles of the variable  or variables named in the EFFECT statement.","@ToolTip6":"Syntax: RANGEFRACTIONS(fraction-list)                                      Requests that internal knots be placed at each fraction of the ranges of the variables  in the EFFECT statement."}},{"StatementOptionName":"KNOTMIN=","StatementOptionHelp":{"#cdata":"[For the SPLINE effect-type only] \n          \n[Syntax: KNOTMIN=value] \n\nSpecifies that for each variable in the EFFECT statement, the left-side boundary knots be \nequally spaced starting at the specified value and ending at the minimum of the variable. \nThis option is ignored for variables whose minimum value is less than the specified value \nor if the DATABOUNDARY option is also specified."},"StatementOptionType":"V"},{"StatementOptionName":"SEPARATE","StatementOptionHelp":{"#cdata":"[For the SPLINE effect-type only] \n          \nSpecifies that when multiple variables are specified in the EFFECT statement, \nthe spline basis for each variable be treated as a separate effect. The names \nof these separated effects are formed by appending an underscore followed by \nthe name of the variable to the name that you specify in the EFFECT statement."},"StatementOptionType":"S"},{"StatementOptionName":"SPLIT","StatementOptionHelp":{"#cdata":"[For the SPLINE effect-type only] \n          \nSpecifies that each individual column in the design matrix that corresponds to the spline \neffect be treated as a separate effect that can enter or leave the model independently. \nNames for these split effects are generated by appending the variable name and an index \nfor each column to the name that you specify in the EFFECT statement."},"StatementOptionType":"S"}]}},{"StatementName":"MODEL","StatementHelp":{"#cdata":"Syntax: MODEL response <*censor(list)> = <effects> </ options> ; \n\nThe MODEL statement identifies the response variable, the optional censoring variable, and the \nexplanatory effects, including covariates, main effects, interactions, and nested effects. In \nthe MODEL statement, the response variable precedes the equal sign. This name can optionally \nbe followed by an asterisk, the name of the censoring variable, and a list of censoring values \n(separated by blanks or commas if you list more than one value) enclosed in parentheses. If the \ncensoring variable takes on one of these values, the corresponding failure time is considered \nto be censored. Following the equal sign are the explanatory effects (sometimes called independent \nvariables or covariates) for the model. \n\nThe censoring variable must be numeric."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"NOINT","StatementOptionHelp":{"#cdata":"Specifies no intercept regression."},"StatementOptionType":"S"},{"StatementOptionName":"QUANTILE=","StatementOptionHelp":{"#cdata":"Syntax: QUANTILE=number-list | PROCESS \n          \nSpecifies the quantile levels of interest for quantile regression analysis. You can specify \nany number of quantile levels in the interval (0,1). You can also compute the entire quantile \nprocess by specifying the PROCESS option. \n\nIf you do not specify the QUANTILE= option, the QUANTLIFE procedure fits a median regression, \nwhich corresponds to QUANTILE=0.5."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"number-list","@Value2":"PROCESS"},"StatementOptionToolTips":{"@ToolTip1":"Replace number-list with any number of quantile levels in the interval (0,1).","@ToolTip2":"Specifies to compute the entire quantile process."}}]}},{"StatementName":"OUTPUT","StatementHelp":{"#cdata":"Syntax: OUTPUT <OUT=SAS-data-set>< keyword=name> <...keyword=name> ;\n      \nThe OUTPUT statement creates a SAS data set to contain statistics that are calculated after \nfitting models for all quantiles specified by the QUANTILE= option in the MODEL statement. \nAt least one specification of the form keyword=name is required. \n\nAll variables in the original data set are included in the new data set, along with the variables \nthat are created. These new variables contain fitted values and estimated quantiles. If you want \nto create a permanent SAS data set, you must specify a two-level name."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"OUT=","StatementOptionHelp":{"#cdata":"[Syntax: OUT=SAS-data-set] \n          \nSpecifies the new data set. By default, the procedure uses the DATAn convention to name the new data set."},"StatementOptionType":"V"},{"StatementOptionName":"PREDICTED=|P=","StatementOptionHelp":{"#cdata":"[keyword] \n          \nSpecifies a variable to contain the predicted response."},"StatementOptionType":"V"},{"StatementOptionName":"RESIDUAL=|RES=","StatementOptionHelp":{"#cdata":"[keyword] \n          \nSpecifies a variable to contain residuals."},"StatementOptionType":"V"},{"StatementOptionName":"SAMPLEWEIGHT=|SW=","StatementOptionHelp":{"#cdata":"[keyword] \n          \nSpecifies variables for sample weights from the bootstrap samples. For the ith sample, \na column that contains the weights that are used for that sample is added. The name of \nthis column is formed by appending an index i to the name that you specify. If you do \nnot specify a name, then the default prefix is sw."},"StatementOptionType":"V"},{"StatementOptionName":"STDP=","StatementOptionHelp":{"#cdata":"[keyword] \n          \nSpecifies a variable to contain the estimates of the standard errors of the estimated response."},"StatementOptionType":"V"}]}},{"StatementName":"TEST","StatementHelp":{"#cdata":"Syntax: <label:> TEST effects </ options> ; \n\nIn quantile regression analysis, you might be interested in testing whether a covariate effect \nis statistically significant for a given quantile. \n\nYou can include multiple TEST statements, provided that they appear after the MODEL statement. \nThe optional label, which must be a valid SAS name, is used to identify output from the corresponding \nTEST statement."},"StatementOptions":{"StatementOption":{"StatementOptionName":"WALD","StatementOptionHelp":{"#cdata":"Requests the Wald tests."},"StatementOptionType":"S"},"#comment":{}}},{"StatementName":"WEIGHT","StatementHelp":{"#cdata":"Syntax: WEIGHT variable ; \n\nThe WEIGHT statement specifies a weight variable in the input data set. \n\nTo request weighted quantile regression, place the weights in a variable and specify the name \nin the WEIGHT statement. The values of the WEIGHT variable can be nonintegral and are not \ntruncated. Observations with nonpositive or missing values for the weight variable do not \ncontribute to the fit of the model."},"StatementOptions":null}]}}}