{"Procedure":{"Name":"SGDESIGN","ProductGroup":"ODS GRAPHICS","#comment":{},"ProcedureHelp":{"#cdata":"Syntax: PROC SGDESIGN SGD=\"SGD-file-specification\" <option(s)>;\n    DYNAMIC dynamic-var–1=\"assigned-value–1\" <...dynamic-var–n=\"assigned-value-n\">;\n    \nThe SGDESIGN procedure produces a graph from one or more input SAS data sets and a user-defined \nODS Graphics Designer (SGD) file. The SGD file is created with the SAS ODS Graphics Designer \napplication."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"SGD=","ProcedureOptionHelp":{"#cdata":"[Syntax: SGD= \"SGD-file-specification\"] \n      \nSpecifies the SGD file to use for the graph. Include the complete path and filename \nenclosed in single or double quotation marks. \n\nIf you do not specify the full path, then the procedure looks for the file in the \nSAS current working directory. The SAS current directory is the same directory in \nwhich you start your SAS session. If you are running SAS with the Windowing environment \nin the Windows operating system, then the current directory is displayed in the status \nbar at the bottom of the main SAS window."},"ProcedureOptionType":"RV"},{"ProcedureOptionName":"CONTENT","ProcedureOptionHelp":{"#cdata":"Outputs important information about the SGD file into the SAS log. The information \nincludes data set names, library names, variable names (including those for dynamic \nvariables), and the ODS style.\n\nNote:When the CONTENT option is used, no graphics output is produced."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA = input-data-set] \n      \nSpecifies the SAS data set that contains the variables to process. \n\nBy default, the SGDESIGN procedure uses the data set or data sets that are currently \ndefined in the SGD file. You have the option to specify an alternate data set. Only \none data set can be specified here. If the SGD file uses columns from multiple data \nsets, then the specified data set should contain all the columns that are required \nto render the graph. \n\nSpecify the full name of the SAS data set in the format libref.data-set. If you do \nnot specify the library, then the procedure looks for the data set in the SAS Work \nlibrary."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"DESCRIPTION=|DES=","ProcedureOptionHelp":{"#cdata":"[Syntax: DESCRIPTION= “text-string”] \n      \nSpecifies a description for the output image. \n\nThe description identifies the image in the following locations: \n  \n  o the Results window \n  o the alternate text for the image in HTML output \n  o the table of contents that is created by the CONTENTS option in an ODS statement \n  \nAlias: DES \n\nDefault:The default description is “The SGDesign Procedure”."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"LIBNAME=","ProcedureOptionHelp":{"#cdata":"[Syntax: LIBNAME= library-name] \n      \nSpecifies an alternate library for all data sets that are associated with the SGD file. \nIf no library is specified, then the procedure uses the library that is currently defined \nin the SGD file.\n\nThe data sets in the SGD file can come from multiple libraries. However, when you use the \nLIBNAME= option, you override all of those library names with the specified library."},"ProcedureOptionType":"V"}]},"ProcedureStatements":{"ProcedureStatement":{"StatementName":"DYNAMIC","StatementHelp":{"#cdata":"Syntax: DYNAMIC dynamic-var–1=\"assigned-value–1\" <...dynamic-var–n=\"assigned-value-n\">;  \n\nAssigns values to dynamic variables that have been defined in the SGD file. You can either specify variables \nin multiple DYNAMIC statements or specify all of your variables in a single DYNAMIC statement.\n\ndynamic-var=assigned-value\n  specifies the values for one or more dynamic variables. \n  \ndynamic-var\n  specifies the name of a dynamic variable.\n  \nThe variable must be declared in a DYNAMIC statement within the SGD file's template. (In ODS Graphics Designer,\nyou can see the dynamic variables that have been declared for a graph when you view the graph's template code \nfrom the View menu.)\n\nassigned-value\n  specifies the value for the dynamic variable. If the value is a character string or a column name, then it \n  must be enclosed in single or double quotation marks. For example: V1=\"year\" and MYTITLE=\"Distribution of \n  Patient Weight\"."},"StatementOptions":null}}}}