{"Procedure":{"Name":"SGRENDER","ProductGroup":"ODS GRAPHICS","#comment":{},"ProcedureHelp":{"#cdata":"Syntax: PROC SGRENDER < option(s)>;  \n    DATTRVAR variable-assignment(s);\n    DYNAMIC variable-assignment(s);  \n\nThe SGRENDER procedure produces graphical output from templates that are created with the Graph Template \nLanguage (GTL). The templates are referred to as StatGraph templates. The GTL is a comprehensive language \nfor creating statistical graphics, which can be used to create customized layouts and graphs that are beyond \nthe scope of the ODS Graphics procedures."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"TEMPLATE=","ProcedureOptionHelp":{"#cdata":"[Syntax: TEMPLATE= statgraph-template] \n      \nSpecifies a StatGraph template that defines one or more graphs. The SGRENDER procedure \napplies the StatGraph template to your data to create the output graphs.\n\nNote: Specifying a template that is not a StatGraph template is not supported. If you specify \na non-StatGraph template, then the SGRENDER procedure might produce unpredictable results."},"ProcedureOptionType":"RV"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=input-data-set] \n      \nSpecifies the SAS data set that contains the variables to process. By default, the procedure \nuses the most recently created SAS data set."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"DATTRMAP=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATTRMAP=discrete-attr-map-data-set]\n      \nSpecifies a map data set that contains discrete attribute map descriptions. The attribute map \ndescriptions are read from the data set and are rendered in the graph output. Use this option \nwhen the discrete attribute map is defined in a SAS data set rather than in a DISCRETEATTRMAP \nblock in the StatGraph template to be rendered.\n\nRequirements:Do either one of the following:\n  o specify the attribute map ID variable by using the DATTRVAR statement in the SGRENDER procedure.\n  o specify the attribute map ID variable using the DISCRETEATTRVAR variable in the StatGraph template.\n\nIf neither of these requirements is met, the descriptions in the attribute map data set are ignored.\nThe values in the DATTRMAP data set must be sorted by ID. If they are not, only the first value is found.\n\nInteractions:If both the DATTRVAR and DISCRETEATTRVAR statements are used, then the DISCRETEATTRVAR \nstatement takes precedence.\n\nIf the ID value in the data set has the same identifier as an existing DISCRETEATTRMAP statement’s NAME= \noption in the template, the definition in the template is used."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"OBJECT=|NAME=","ProcedureOptionHelp":{"#cdata":"[Syntax: OBJECT=|NAME= object-name] \n      \nSpecifies a name for the ODS output object. \n\nDefault:SGRender\n\nNote: To specify the filename of the output image, use the IMAGENAME= option on the \nODS GRAPHICS statement."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"OBJECTLABEL=|DES=|DESCRIPTION=","ProcedureOptionHelp":{"#cdata":"[Syntax: OBJECTLABEL=|DES=|DESCRIPTION= \"text-string\"] \n      \nSpecifies a description for the output image. The description identifies the image in the \nfollowing locations:\n\n  o the Results window \n  o the alternate text for the image in HTML output \n  o the table of contents that is created by the CONTENTS option on an ODS statement\n\nThe default description is \"The SGRENDER Procedure\"."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SGANNO=","ProcedureOptionHelp":{"#cdata":"[Syntax: SGANNO=annotation-data-set]\n      \nSpecifies the name of a SAS data set that contains annotation instructions. You specify this option \nonly if you are rendering a template that contains one or more ANNOTATE statements. During rendering, \nwhen the ANNOTATE statement is encountered in the template, the annotation instructions are read from \nthe annotation data set and are rendered in the current context in the graph. If the template does not \ninclude the ANNOTATE statement, the annotations in the annotation data set are ignored."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SGE=","ProcedureOptionHelp":{"#cdata":"[Syntax: SGE=fileref | “file-name”]\n      \nSpecifies the SAS ODS Graphics Editor (SGE) file to render. Specify a fileref or a filename for the SGE file. \nThis option enables you to render an SGE file to any supported ODS destination. The output type depends on the \nOUTPUTFMT option of the ODS GRAPHICS statement and the open ODS destination.\n\nWhen you use this option to render an input SGE file, ODS does not produce an output SGE file even if the SGE=ON\noption is specified in the ODS statement. \n\nRequirement:Although SGE rendering does not require a data set, the SGRENDER procedure requires a data \nreference. You might need to specify DATA=_NULL_ in the SGRENDER procedure if the _LAST_ data set variable \nhas not been set by the SAS system. This typically happens at the beginning of a SAS session, before the \ncreation of a data set."},"ProcedureOptionType":"V"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"DATTRVAR","StatementHelp":{"#cdata":"Syntax: DATTRVAR variable-assignment(s);  \n      \nSpecifies one or more input variables to be associated with an attribute map at run time.\n\nInteractions:This statement is used in conjunction with the DATTRMAP= option in the PROC SGRENDER \n  statement to associate a discrete attribute map with the StatGraph template.\n\n  If the template that is specified in the SGRENDER statement's TEMPLATE= option uses a DISCRETEATTRVAR \n  statement, the DISCRETEATTRVAR statement takes precedence over the DATTRVAR statement.\n  \nNote:You can specify multiple instances of this statement in the SGRENDER procedure. The variable-assignment(s) \npairs from all of the DATTRVAR statements are accumulated.\n\nRequired Argument:\n\nvariable-assignment(s)\n  specifies the values for one or more variables. When multiple variable assignments are specified, separate each with a space.\n  Each variable assignment takes the following form:\n    group-variable-name=\"attrid\"\n\n  group-variable-name\n    a group variable to be associated with an attribute map at run time. The variable must exist in the \n    data set that you specify with the DATA= option in the PROC SGRENDER statement.\n  \n    The variable can be character or numeric, but the values must match the type of values that are specified \n    in the attribute map. For numeric variables, all values are treated as discrete values.\n  \n  \"attrid”\n    an identifier for the attribute map. The attrid value must exist in the attribute map data set. \n    This value must be a quoted string.\n\n  Note:If a group-variable-name is not found or is of the wrong type for the attribute map, the \n    group-variable-name=\"attrid\" pair is ignored."},"StatementOptions":null},{"StatementName":"DYNAMIC","StatementHelp":{"#cdata":"Syntax: DYNAMIC variable-assignment(s); \n      \nThe DYNAMIC statement defines values for dynamic variables that are used in your StatGraph \ntemplate. \n\nYou can either specify variables on multiple DYNAMIC statements, or specify all of your \nvariables on a single DYNAMIC statement.\n\nNote: If your template uses dynamic variables to specify required attributes, and you do \nnot define values for those variables in a DYNAMIC statement, then the SGRENDER procedure \nmight produce errors. \n\nRequired Argument:\n\nvariable-assignment(s)\n  specifies the values for one or more dynamic variables. The variables that you assign must also be \n  declared in a DYNAMIC statement within the StatGraph template.\n  \n  You can specify either a numeric value or a quoted text string. For example, the following statement \n  defines one string variable and one numeric variable: dynamic region=\"Europe\" limit=3000;"},"StatementOptions":null}]}}}