{"Procedure":{"Name":"SGSCATTER","ProductGroup":"ODS","#comment":{},"ProcedureHelp":{"#cdata":"Syntax: PROC SGSCATTER < options>;  \n      COMPARE X= variable | (variable-1 ... variable-n) Y= variable | (variable-1 ... variable-n)</options>;  \n      MATRIX variable-1 < ... variable-n> </options>;  \n      PLOT plot-request(s) </options>;  \n\nThe SGSCATTER procedure creates a paneled graph of scatter plots for multiple combinations \nof variables, depending on the plot statement that you use. You can use options to overlay \nfit plots and ellipses on your scatter plots."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"BACKCOLOR=","ProcedureOptionHelp":{"#cdata":"[Syntax: BACKCOLOR=color]\n      \nSpecifies the background color of the graph area.\n\nNote: This feature applies to the third maintenance release of SAS 9.4 and to later releases.\nYou can specify colors using a number of different color-naming schemes. \n\nDefault:The Color attribute of the GraphBackground style element\nExamples:\n  backcolor=CXFF0000\n  backcolor=light_blue"},"ProcedureOptionType":"C"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=input-data-set] \n      \nSpecifies the SAS data set that contains the variables to process. By default, the procedure \nuses the most recently created SAS data set."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"DATACOLORS=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATACOLORS=(color-list)] \n          \nSpecifies the fill colors for the graphics elements, such as CLM bands and filled markers. Provide \na space-separated list of colors enclosed in parentheses. You can specify colors using a number of \ndifferent color-naming schemes. \n\nDefault:The colors that are defined in the GraphData1 ... GraphDatan style elements in the current style are used.\n\nRequirements:The input data must be ordered by the group variable for this option to take effect. If \n  otherwise, the results are unpredictable.\n  \n  The plot statement that is used in the procedure must specify the GROUP= option.\n  \nNote:When this option is specified, the colors cycle through color-list rather than the line patterns \n  that are defined in the GraphData1 ... GraphDatan style elements. When the colors in color-list are exhausted, the colors repeat.\n\nExample:datacolors=(CXFF0000 green blue)"},"ProcedureOptionType":"V"},{"ProcedureOptionName":"DATACONTRASTCOLORS=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATACONTRASTCOLORS=(color-list)] \n          \nSpecifies the contrast colors for the graphics elements, such as lines and markers. The lines \nand markers can be in grouped plots or in overlaid multiple plots with the CYCLEATTRS feature \nin effect. \n\nProvide a space-separated list of colors enclosed in parentheses. You can specify colors using \nthe same color schemes that are supported by SAS/GRAPH software."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"DATALINEPATTERNS=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATALINEPATTERNS=(line-pattern-list)] \n          \nSpecifies the list of line patterns for the graph data lines. Provide a space-separated list of line \npatterns enclosed in parentheses. You can reference SAS patterns by number or by name. \n\nSome valid pattern numbers: 1 (Solid), 2 (ShortDash), 4 (MediumDash), 5 (LongDash) \n8 (MediumDashShortDash) 14 (DashDashDot) 15 (DashDotDot) 20 (Dash) 26 (LongDashShortDash) \n34 (Dot) 35 (ThinDot) 41 (ShortDashDot) 42 (MediumDashDotDot). \nNot all pattern numbers have names."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"DATASYMBOLS=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATASYMBOLS=(marker-symbol-list)] \n          \nSpecifies the list of marker symbol for the graph data. Provide a space-separated list of symbols \nenclosed in parentheses. \n          \nList of valid marker symbols:\nArrowDown\nAsterisk\nCircle | CircleFilled\nDiamond | DiamondFilled\nGreaterThan\nHash\nHomeDown | HomeDownFilled\nIbeam\nPlus\nSquare | SquareFilled\nStar | StartFilled\nTack\nTilde\nTriangle | TriangleFilled\nTriangleDown | TriangleDownFilled\nTriangleLeft | TriangleLeftFilled\nTriangleRight | TriangleRightFilled\nUnion\nX\nY\nZ"},"ProcedureOptionType":"V"},{"ProcedureOptionName":"DATTRMAP=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATTRMAP=attribute-map-data-set ] \n      \nSpecifies the discrete attribute map data set that you want to use with the SGSCATTER procedure. You \nspecify this option only if you are using a discrete attribute map to control visual attributes of the graph.\n\nRequirement:The values in the DATTRMAP data set must be sorted by ID. If they are not, only the first \n  value is found"},"ProcedureOptionType":"V"},{"ProcedureOptionName":"DESCRIPTION=|DES=","ProcedureOptionHelp":{"#cdata":"[Syntax: DESCRIPTION= \"text-string\"] \n      \nSpecifies a description for the output image. The description identifies the image in the following locations:\n\n  o the Results window \n  o the alternate text for the image in HTML output \n  o the table of contents that is created by the CONTENTS option on an ODS statement\n\nThe default description is \"The SGSCATTER Procedure\".\n\nNotes:   You can disable the alternate text in HTML output by specifying an empty string. \n  That is, DESCRIPTION=\"\" .  \n\n  The name of the output image is specified by the IMAGENAME= option on the ODS GRAPHICS statement."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SUBPIXEL","ProcedureOptionHelp":{"#cdata":"Always uses subpixel rendering, when applicable, for rendering curved lines."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NOSUBPIXEL","ProcedureOptionHelp":{"#cdata":"Never uses subpixel rendering for rendering curved lines."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"OPAQUE","ProcedureOptionHelp":{"#cdata":"Specifies that the graph background is opaque."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NOOPAQUE","ProcedureOptionHelp":{"#cdata":"Specifies that the graph background is transparent."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"PAD=","ProcedureOptionHelp":{"#cdata":"[Syntax: PAD= dimension<units> | (pad-options)]\n      \nSpecifies the amount of extra space that is reserved inside the border of an annotated graph. \n\nYou specify this option only if you are using the SG annotation feature to annotate your graph.  \nThis option creates margins around the graph for company logos, annotated notes, and so on. You \ncan also specify the unit of measurement. The default unit is pixels. Use pad options to create \nnon-uniform padding. Edges that are not assigned padding are padded with the default amount. \n\npad-options can be one or more of the following: \n\n  LEFT= dimension<units> \n    specifies the amount of extra space to add to the left edge. \n  RIGHT= dimension<units> \n    specifies the amount of extra space to add to the right edge. \n  TOP= dimension<units> \n    specifies the amount of extra space to add to the top edge. \n  BOTTOM= dimension<units> \n    specifies the amount of extra space to add to the bottom edge."},"ProcedureOptionType":"V","SubOptionsKeywords":"LEFT=|RIGHT=|TOP=|BOTTOM="},{"ProcedureOptionName":"RATTRMAP=","ProcedureOptionHelp":{"#cdata":"[Syntax: RATTRMAP=range-attribute-map-data-set]\n      \nSpecifies the range attribute map data set that you want to use with the procedure. You specify this \noption only if you are using a range attribute map to control visual attributes of the graph.\n\nRequirement:The values in the RATTRMAP data set must be sorted by ID. If they are not, only the \nfirst value is found."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SGANNO=","ProcedureOptionHelp":{"#cdata":"[Syntax: SGANNO= annotation-data-set]\n      \nSpecifies the SG annotation data set that you want to use. You specify this option \nonly if you are using the SG annotation feature to annotate your graph."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"TMPLOUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: TMPLOUT= \"filename\"] \n      \nSpecifies a file destination for the template code that is generated by the \nSGSCATTER procedure."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"WALLCOLOR=","ProcedureOptionHelp":{"#cdata":"[Syntax: WALLCOLOR=color]\n      \nSpecifies the color of the plot wall area.\n\nNote: This feature applies to the third maintenance release of SAS 9.4 and to later releases.\n  You can specify colors using a number of different color-naming schemes. For more information, see Color-Naming Schemes.\n\nDefault:The Color attribute of the GraphWalls style element\nExamples:\n  wallcolor=CXFF0000\n  wallcolor=light_blue"},"ProcedureOptionType":"C"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"COMPARE","StatementHelp":{"#cdata":"Syntax: COMPARE X= variable | (variable-1 ... variable-n) \n      Y= variable | (variable-1 ... variable-n) </options>;\n      \nCreates a comparative panel of scatter plots with shared axes."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"X=","StatementOptionHelp":{"#cdata":"[Syntax: X= variable | (variable-1) ... (variable-n)] \n          \nSpecifies one or more variables for the X axis. To specify more than one variable, \nenclose the list of variables in parentheses."},"StatementOptionType":"RV"},{"StatementOptionName":"Y=","StatementOptionHelp":{"#cdata":"[Syntax: Y= variable | (variable-1) ... (variable-n)] \n          \nSpecifies the one or more variables for the Y axis. To specify more than one variable, \nenclose the list of variables in parentheses."},"StatementOptionType":"RV"},{"StatementOptionName":"ATTRID=","StatementOptionHelp":{"#cdata":"[Syntax: ATTRID= variable]\n          \nSpecifies the value of the ID variable in an attribute map data set. You specify this \noption only if you are using an attribute map to control visual attributes of the graph."},"StatementOptionType":"V"},{"StatementOptionName":"COLORMODEL=","StatementOptionHelp":{"#cdata":"[Syntax: COLORMODEL=style-element | (color-list)] \n          \nSpecifies a color ramp that is to be used with the COLORRESPONSE= option. \n\nstyle-element\n  specifies the name of a style element. The style element should contain these style attributes:\n    STARTCOLOR\n      specifies the color for the smallest data value of the COLORRESPONSE= column.\n    NEUTRALCOLOR\n      specifies the color for the midpoint of the range of the COLORRESPONSE= column. This attribute \n      is not required when you specify a two-color ramp model.\n    ENDCOLOR\n      specifies the color for the highest data value of the COLORRESPONSE= column.\n    Example: colormodel=TwoColorRamp\n\n(color-list)\n  specifies a space-separated list of colors to use in the color ramp. You can use style attribute references \n  such as GraphData3:Color. \n  \n  You can specify colors using a number of different color-naming schemes. The list can contain a mix of \n  style attribute references, color names, and color codes.\n  \n  Requirement: The list of colors must be enclosed in parentheses.\n  Example: colormodel=(blue yellow green)\n  Default: The ThreeColorAltRamp style element\n  Interaction: For this option to take effect, the COLORRESPONSE= option must also be specified in the statement."},"StatementOptionType":"V"},{"StatementOptionName":"COLORRESPONSE=","StatementOptionHelp":{"#cdata":"[Syntax: COLORRESPONSE=numeric-column] \n          \nSpecifies the numeric column that is used to map colors to a continuous color legend.\n\nInteractions:If the GROUP= option is also specified, then the GROUP= option is ignored.\n  The GRADLEGEND= option controls the title, position, and border of the legend. If you want only \n  the colors and not the legend, then you can specify NOGRADLEGEND.\n\nNote:This option is ignored when the JOIN option is also specified.\n\nTip:The color ramp is specified by the COLORMODEL= option. The color ramp represents the range \n  of unique response values"},"StatementOptionType":"V"},{"StatementOptionName":"DATALABEL","StatementOptionHelp":{"#cdata":"[Syntax: DATALABEL <=variable>] \n          \nDisplays a label for each data point. If you specify a variable, the values of that variable \nare used for the data labels. If you do not specify a variable, the value of the Y variable \nis used for the data label."},"StatementOptionType":"S|V"},{"StatementOptionName":"DATALABELPOS=","StatementOptionHelp":{"#cdata":"Syntax: DATALABELPOS= BOTTOM | CENTER | TOP | BOTTOMLEFT | LEFT | TOPLEFT | BOTTOMRIGHT | RIGHT | TOPRIGHT\n          \nSpecifies the location of the data label with respect to the plot. \n\nInteractions: This option has no effect unless you also specify the DATALABEL option.\n  This option displays group values for each category when GROUP= is also specified.\n  This option does not support the splitting or rotation of data labels."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BOTTOM","@Value2":"CENTER","@Value3":"TOP","@Value4":"BOTTOMLEFT","@Value5":"LEFT","@Value6":"TOPLEFT","@Value7":"BOTTOMRIGHT","@Value8":"RIGHT","@Value9":"TOPRIGHT"},"StatementOptionToolTips":{"@ToolTip1":"Places the data label at the bottom of the plot.","@ToolTip2":"Places the data label at the center of the plot.","@ToolTip3":"Places the data label at the top of the plot.","@ToolTip4":"Places the data label at the bottom left corner of the plot.","@ToolTip5":"Places the data label on the left side of the plot.","@ToolTip6":"Places the data label on the top left corner of the plot.","@ToolTip7":"Places the data label at the bottom right corner of the plot.","@ToolTip8":"Places the data label on the right side of the plot.","@ToolTip9":"Places the data label on the top right corner of the plot."}},{"StatementOptionName":"ELLIPSE","StatementOptionHelp":{"#cdata":"[Syntax: ELLIPSE <= (options) >] \n          \nAdds a confidence or prediction ellipse to the scatter plot.\n\noptions can be one or more of the following:\n\nALPHA= numeric-value \n  specifies the confidence level for the ellipse.\n\nCLIP\n  specifies that X and Y values for the ellipse are ignored when determining the data ranges for the axes.\n  Clipping occurs if the X or Y value for an ellipse exceeds the axis range.\n  \n  Default:The X and Y values for the ellipse contribute to the data ranges for the axes. If necessary, \n    each axis is extended in order to display the entire ellipse.\n\nTYPE= MEAN | PREDICTED \nspecifies the type of ellipse. MEAN specifies a confidence ellipse for the population mean. \nPREDICTED specifies a prediction ellipse for a new observation."},"StatementOptionType":"S|V","SubOptionsKeywords":"ALPHA=|CLIP|TYPE="},{"StatementOptionName":"FILLEDOUTLINEDMARKERS","StatementOptionHelp":{"#cdata":"Specifies that markers have a fill and an outline.\n          \nRequirement: The marker symbol, derived either from the applied style or specified with the \n\nMARKERATTRS= option, must have the “Filled” suffix in its name. Otherwise, this option is ignored. \n\nInteraction: Use the MARKERFILLATTRS= and MARKEROUTLINEATTRS= options to specify attributes for \nthe fill and outline."},"StatementOptionType":"S"},{"StatementOptionName":"GRADLEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: GRADLEGEND=(options)]\n          \nSpecifies the appearance of a continuous color legend when the COLORRESPONSE= option is used.\n\noptions can be one or more of the following:\n  BORDER  adds a border around the legend.\n  INTEGER specifies that integers are used for the gradient legend.\n    Note: This feature applies to the third maintenance release of SAS 9.4 and to later releases.\n  NOTITLE removes the default title. The default title is the name of the response variable.\n  POSITION=TOP | BOTTOM | LEFT | RIGHT\n    specifies the position of the legend within the graph.\n    Default:RIGHT\n  TITLE=\"text-sting\" specifies the label for the legend."},"StatementOptionType":"V","SubOptionsKeywords":"BORDER|INTEGER|NOTITLE|POSITION=|TITLE="},{"StatementOptionName":"GRID","StatementOptionHelp":{"#cdata":"Creates grid lines for each tick on both axes."},"StatementOptionType":"S"},{"StatementOptionName":"GRIDATTRS=","StatementOptionHelp":{"#cdata":"[Syntax: GRIDATTRS=style-element <(options)> | (options)]\n          \nSpecifies the appearance of the grid lines.\n\nNote: This feature applies to the second maintenance release of SAS 9.4 and to later releases.\n\nYou can specify the appearance by using a style element or by specifying specific options. If you specify \na style element, you can also specify options to override specific appearance attributes.\n\noptions can be one or more of the following: \n\n  COLOR= color \n    specifies the color of the line. \n  PATTERN= line-pattern \n    specifies the line pattern for the line. You can reference SAS patterns by number or by name.\n  THICKNESS= n <units> \n    specifies the thickness of the line. You can also specify the unit of measure. The default unit is pixels. "},"StatementOptionType":"V","SubOptionsKeywords":"COLOR=|PATTERN=|THICKNESS="},{"StatementOptionName":"GROUP=","StatementOptionHelp":{"#cdata":"[Syntax: GROUP= variable] \n          \nSpecifies a classification variable to divide the values into groups. If a fit line is requested, \nthen the GROUP= variable is also applied to the fit plot unless you specify the NOGROUP suboption \nin the option for the fit plot."},"StatementOptionType":"V"},{"StatementOptionName":"JITTER","StatementOptionHelp":{"#cdata":"Specifies that data markers are offset when multiple observations have the same response value. \nWhen the JITTER option is enabled, markers that represent the same response value are offset \nslightly in order to make all of the markers visible."},"StatementOptionType":"S"},{"StatementOptionName":"JOIN","StatementOptionHelp":{"#cdata":"[Syntax: JOIN <=(options)>] \n          \nSpecifies that line segments join all of the scatter points. The line segments connect the scatter \npoints in increasing order along the X axis. The data order of the input data set has no effect on \nthe order of the lines. \n\nYou can specify the following options:\n\nLINEATTRS=style-element <(options)> | (options)\n  specifies the appearance of the join lines. You can specify the appearance by using a style element \n  or by specifying specific options. If you specify a style element, you can also specify options to \n  override specific appearance attributes. \n  \nSMOOTHCONNECT specifies that a smoothed line passes through all vertices."},"StatementOptionType":"S|V","SubOptionsKeywords":"LINEATTRS=|SMOOTHCONNECT"},{"StatementOptionName":"LEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: LEGEND=(options)] \n          \nSpecifies the appearance of the legend for the scatter plot.\n\noptions can be one or more of the following:\n\nACROSS= n \nspecifies the number of columns in the legend.\n\nAUTOITEMSIZEspecifies that all markers in the legend are sized in proportion to the font size used for the legend labels.\n\nDOWN= n \nspecifies the number of columns in the legend.\n\nNOBORDER \nremoves the border from the legend.\n\nNOTITLE \nremoves the label from the legend.\n\nPOSITION= position-value \nspecifies the position of the legend within the graph. The positions are as follows:\n\n  BOTTOM places the legend at the bottom of the graph.\n   \n  LEFT places the legend at the left side of the graph.\n   \n  RIGHT places the legend at the right side of the graph.\n   \n  TOP places the legend at the top of the graph\n \n  TITLE= \"text-sting\" \n  specifies the label for the legend."},"StatementOptionType":"V","SubOptionsKeywords":"ACROSS=|DOWN=|NOBORDER|NOTITLE|POSITION="},{"StatementOptionName":"LOESS","StatementOptionHelp":{"#cdata":"[Syntax: LOESS <=(options)>] \n          \nAdds a loess fit to the scatter plot. You can specify the following options:\n\n  ALPHA= numeric-value \n  specifies the confidence level for the confidence limits.\n\n  CLM \n  creates confidence limits for a mean predicted value for each observation.\n\n  DEGREE= 1 | 2 \n  specifies the degree of the local polynomials to use for each local regression. 1 specifies \n  a linear fit and 2 specifies a quadratic fit.\n\n  INTERPOLATION= CUBIC | LINEAR \n  specifies the degree of the interpolating polynomials that are used for blending local polynomial \n  fits at the kd tree vertices.\n\n  LINEATTRS= style-element <(COLOR= | PATTERN= | THICKNESS=)> | (COLOR= | PATTERN= | THICKNESS=) \n  specifies the appearance of the fit line.\n\n  NOGROUP \n  specifies that the fit does not use the group variable from the scatter plot.\n\n  SMOOTH= numeric-value \n  specifies a smoothing parameter value."},"StatementOptionType":"S|V","SubOptionsKeywords":"ALPHA=|CLM|DEGREE=|INTERPOLATION=|LINEATTRS=|NOGROUP|SMOOTH="},{"StatementOptionName":"MARKERATTRS=","StatementOptionHelp":{"#cdata":"[Syntax: MARKERATTRS= style-element <(options)>| (options)] \n          \nSpecifies the appearance of the markers in the plot.\n          \noptions can be one or more of the following:\n\n    COLOR= color \n    specifies the color of the markers.\n\n    SIZE= n \n    specifies the size of the markers in pixels.\n\n    SYMBOL= symbol-name \n    specifies the symbol for the markers."},"StatementOptionType":"V","SubOptionsKeywords":"COLOR=|SIZE=|SYMBOL="},{"StatementOptionName":"MARKERFILLATTRS=","StatementOptionHelp":{"#cdata":"[Syntax: MARKERFILLATTRS=style-element <(COLOR=color)> | (COLOR=color)] \n          \nSpecifies the color of the marker fill. You can specify colors using the same color schemes \nthat are supported by SAS/GRAPH software. \n\nDefault: Color attribute of the GraphDataDefault style element in the current style for ungrouped data. \nGraphData-1 ... GraphData-n style elements in the current style for grouped data.\n\nInteractions: This option has no effect unless FILLEDOUTLINEDMARKERS is also specified.\nThis option overrides any color that is specified with the MARKERATTRS= option. \n\nTip: You can also use the MARKEROUTLINEATTRS= option to specify attributes for the marker outline."},"StatementOptionType":"V"},{"StatementOptionName":"MARKEROUTLINEATTRS=","StatementOptionHelp":{"#cdata":"[Syntax: MARKEROUTLINEATTRS=style-element <(options)> | (options)] \n          \nSpecifies the appearance of the marker outlines. You can specify the appearance by using a style \nelement or by specifying specific options. If you specify a style element, you can also specify \noptions to override specific appearance attributes. \n\nFor the options, you can specify either or both of the following:\n  •line color\n  •line thickness \n  \noptions can be one or more of the following attributes.\nCOLOR= color\n  specifies the color of the line. You can specify colors using the same color schemes that are \n  supported by SAS/GRAPH software. \nPATTERN= line-pattern\n  specifies the line pattern for the line. Line patterns can be specified as a pattern name \n  or pattern number. Some valid pattern numbers: 1 (Solid), 2 (ShortDash), \n  4 (MediumDash), 5 (LongDash) 8 (MediumDashShortDash) 14 (DashDashDot) 15 (DashDotDot) 20 (Dash) \n  26 (LongDashShortDash) 34 (Dot) 35 (ThinDot) 41 (ShortDashDot) 42 (MediumDashDotDot). \n  Not all pattern numbers have names.\nTHICKNESS= n <units>\n  specifies the thickness of the line. You can also specify the unit of measurement. The default \n  unit is pixels."},"StatementOptionType":"V","SubOptionsKeywords":"COLOR=|PATTERN=|THICKNESS="},{"StatementOptionName":"MINORGRID","StatementOptionHelp":{"#cdata":"Creates grid lines at each minor tick on both axes.\n          \nNote: This feature applies to the second maintenance release of SAS 9.4 and to later releases.\n\nInteraction:This option has no effect unless GRID is also specified for the axis."},"StatementOptionType":"V"},{"StatementOptionName":"MINORGRIDATTRS=","StatementOptionHelp":{"#cdata":"[Syntax: MINORGRIDATTRS=style-element <(options)> | (options)\\\n          \nSpecifies the appearance of the minor grid lines.\n\nNote: This feature applies to the second maintenance release of SAS 9.4 and to later releases.\n\nYou can specify the appearance by using a style element or by specifying specific options. If you specify \na style element, you can also specify options to override specific appearance attributes.\n\nDefault:GraphMinorGridLines style element in the current style for ungrouped data. GraphData1 ... GraphDatan \n  style elements in the current style for grouped data.\nInteraction:This option has no effect unless MINORGRID is also specified.\nTip:You can use GRIDATTRS= to change the appearance of the major grid lines.\n  \noptions can be one or more of the following attributes.\nCOLOR= color\n  specifies the color of the line. You can specify colors using the same color schemes that are \n  supported by SAS/GRAPH software. \nPATTERN= line-pattern\n  specifies the line pattern for the line. Line patterns can be specified as a pattern name \n  or pattern number. Some valid pattern numbers: 1 (Solid), 2 (ShortDash), \n  4 (MediumDash), 5 (LongDash) 8 (MediumDashShortDash) 14 (DashDashDot) 15 (DashDotDot) 20 (Dash) \n  26 (LongDashShortDash) 34 (Dot) 35 (ThinDot) 41 (ShortDashDot) 42 (MediumDashDotDot). \n  Not all pattern numbers have names.\nTHICKNESS= n <units>\n  specifies the thickness of the line. You can also specify the unit of measurement. The default \n  unit is pixels."},"StatementOptionType":"V","SubOptionsKeywords":"COLOR=|PATTERN=|THICKNESS="},{"StatementOptionName":"NOGRADLEGEND","StatementOptionHelp":{"#cdata":"Turns off the display of the continuous color legend that appears when the COLORRESPONSE= option is used. \nThis option might be useful when you map plot colors using a numeric column but do not want a continuous \ncolor legend."},"StatementOptionType":"V"},{"StatementOptionName":"NOLEGEND","StatementOptionHelp":{"#cdata":"Removes the legend from the plot."},"StatementOptionType":"V"},{"StatementOptionName":"NOWALL","StatementOptionHelp":{"#cdata":"Turns off the display of the graph wall’s fill and outline. This option might be useful when your \n          \ngraph contains an annotation, and the wall color interferes with that annotation. \n\nFor most styles, the wall outline is the same as the axis lines, and it is impossible to see the \ndifference. Also, the wall fill color is often the same as the graph background. However, if this \nis not the case with the style that you use for a graph, then you might want to suppress the wall \nfill and outline."},"StatementOptionType":"V"},{"StatementOptionName":"PBSPLINE=","StatementOptionHelp":{"#cdata":"[Syntax: PBSPLINE <= (options)>]\n          \nAdds a fitted, penalized β-spline curve to the scatter plot.\n\nYou can specify the following options:\n\nALPHA= numeric-value \nspecifies the confidence level for the confidence limits.\n\nCLI \ncreates confidence limits for individual predicted values for each observation.\n\nCLM \ncreates confidence limits for a mean predicted value for each observation.\n\nDEGREE= 1 | 2 \nspecifies the degree of the local polynomials to use for each local regression. \n1 specifies a linear fit and 2 specifies a quadratic fit.\n\nINTERPOLATION= CUBIC | LINEAR \nspecifies the degree of the interpolating polynomials that are used for blending \nlocal polynomial fits at the kd tree vertices.\n\nLINEATTRS= style-element <(COLOR= | PATTERN= | THICKNESS=)> | (COLOR= | PATTERN= | THICKNESS=) \nspecifies the appearance of the fit line.\n\nNKNOTS= n \nspecifies the number of evenly-spaced internal knots.\n\nNOGROUP \nspecifies that the fit does not use the group variable from the scatter plot.\n\nSMOOTH= numeric-value \nspecifies a smoothing parameter value."},"StatementOptionType":"S|V","SubOptionsKeywords":"ALPHA=|CLI|CLM|DEGREE=|INTERPOLATION=|LINEATTRS=|NKNOTS=|NOGROUP|SMOOTH="},{"StatementOptionName":"RATTRID=","StatementOptionHelp":{"#cdata":"[Syntax: RATTRID=character-value]\n          \nSpecifies the value of the ID variable in a range attribute map data set. You specify this option \nonly if you are using a range attribute map to control visual attributes of the graph.\n\nNote: This feature applies to the third maintenance release of SAS 9.4 and to later releases."},"StatementOptionType":"V"},{"StatementOptionName":"REFTICKS","StatementOptionHelp":{"#cdata":"[Syntax: REFTICKS <=(options)>]\n          \nDuplicates the tick marks from the X and Y axes on the opposite sides of the graph. You can also specify options:\n\n  LABEL\n    in addition to the tick marks, displays the axis label.\n  VALUES\n    in addition to the tick marks, displays the values that are represented by the tick marks."},"StatementOptionType":"S","SubOptionsKeywords":"LABEL|VALUES"},{"StatementOptionName":"REG","StatementOptionHelp":{"#cdata":"[Syntax: REG<=(options)>] \n          \nAdds a regression fit to the scatter plot. options can be one or more of the following:\n\nALPHA= numeric-value \nspecifies the confidence level for the confidence limits.\n\nCLI creates confidence limits for individual predicted values for each observation.\n\nCLM creates confidence limits for a mean predicted value for each observation.\n\nDEGREE= 1 | 2 \nspecifies the degree of the local polynomials to use for each local regression. 1 specifies \na linear fit and 2 specifies a quadratic fit.\n\nLINEATTRS= style-element <(COLOR= | PATTERN= | THICKNESS=)> | (COLOR= | PATTERN= | THICKNESS=) \nspecifies the appearance of the fit line.\n\nNOGROUP specifies that the fit does not use the group variable from the scatter plot."},"StatementOptionType":"V","SubOptionsKeywords":"ALPHA=|CLI|CLM|DEGREE=|LINEATTRS=|NOGROUP"},{"StatementOptionName":"SPACING=","StatementOptionHelp":{"#cdata":"[Syntax: SPACING = n] \n          \nSpecifies the amount of spacing (in pixels) that is placed between the cells in the graph."},"StatementOptionType":"V"},{"StatementOptionName":"SPLITCHAR=","StatementOptionHelp":{"#cdata":"[Syntax: SPLITCHAR=“character-list”] \n          \nSplits the text for data labels at the specified character(s) when there is not enough room to display \nthe text normally. The text value is split at every occurrence of the specified split character or characters.\n\n“character-list” is one or more characters with no delimiter between each character and enclosed \nin quotation marks. For example, to specify the split characters a, b, and c, use the following option:\n\n  SPLITCHAR=\"abc\"\n\nWhen multiple split characters are specified, each character in the list is treated as a separate \nsplit character unless the specified characters appear consecutively in the value. In that case, \nall of the specified split characters together are treated as a single split character.\nIf the value does not contain any of the specified split characters, a split does not occur."},"StatementOptionType":"V"},{"StatementOptionName":"SPLITCHARNODROP","StatementOptionHelp":{"#cdata":"Specifies that the split characters are included in the displayed value. \n          \nInteraction: This option has no effect unless SPLITCHAR= is also specified."},"StatementOptionType":"S"},{"StatementOptionName":"SPLITJUSTIFY=","StatementOptionHelp":{"#cdata":"[Syntax: SPLITJUSTIFY=LEFT | CENTER | RIGHT] \n          \nSpecifies the horizontal alignment of the value text that is being split. \n\nDefault: LEFT\n\nInteraction: This option has no effect unless you specify the SPLITCHAR= option."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"LEFT","@Value2":"CENTER","@Value3":"RIGHT"},"StatementOptionToolTips":{"@ToolTip1":"Specifies a left horizontal alignment of the value text that is being split.","@ToolTip2":"Specifies a center horizontal alignment of the value text that is being split.","@ToolTip3":"Specifies a right horizontal alignment of the value text that is being split."}},{"StatementOptionName":"TIP=","StatementOptionHelp":{"#cdata":"[Syntax: TIP=(variable-list)] \n          \nDisplays data tips using the data obtained from the specified variables. Data tips display information \nwhen the cursor is positioned over the graphics element. Provide a space-separated list of variables \nenclosed in parentheses. \n\nRequirement: You must specify the IMAGEMAP=ON option in the ODS GRAPHICS statement in order to generate \ndata tips. For example, add the following statement before your procedure:\n\n  ODS GRAPHICS / IMAGEMAP=ON; \n  \nInteraction: This option replaces all of the information that is displayed by default.\nTip: Use the TIPFORMAT and TIPLABEL options to assign formats and labels to the list of variables."},"StatementOptionType":"V"},{"StatementOptionName":"TIPFORMAT=","StatementOptionHelp":{"#cdata":"[Syntax: TIPFORMAT=(format-list)] \n          \nApplies formats to the list of data tip variables that you specify in the TIP= option.\n\nProvide a space-separated list of formats enclosed in parentheses. This option provides a way to \ncontrol the format of the variable data that appears in the data tips. \n\nA one-to-one correspondence exists between the format-list and the variable-list that is specified \nfor the TIP= option. A format must be provided for each variable, using the same order as the \nvariable-list. If you do not want to apply a format to a variable, use the AUTO keyword instead. \n\nDefault: The column format of the tip variable, or BEST6 if no format is assigned to a numeric column\nRequirement: A format or the keyword AUTO must be provided for each variable that is listed in the TIP= option.\nInteraction: This option has no effect unless TIP= is also specified.\nTip: Use the TIPLABEL option to assign labels to the list of variables. \nExample: tipformat=(auto F5.2)"},"StatementOptionType":"V"},{"StatementOptionName":"TIPLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: TIPLABEL=(label-list)] \n          \nApplies labels to the list of data tip variables that you specify in the TIP= option. \n\nProvide a space-separated list of quoted “text strings” enclosed in parentheses. This option provides \na way to specify labels for the variable data that appears in the data tips. \n\nA one-to-one correspondence exists between the label-list and the variable-list that is specified for \nthe TIP= option. A label must be provided for each variable, using the same order as the variable-list. \nIf you do not want to apply a custom label to a variable, use the AUTO keyword instead.\n\nRequirement: A label or the keyword AUTO must be provided for each variable that is listed in the TIP= \noption. When AUTO is used, the label is obtained from the variable.\n\nInteraction: This option has no effect unless TIP= is also specified.\nTip: Use the TIPFORMAT option to assign formats to the list of variables. \nExample: tiplabel=(auto \"Class Weight\")"},"StatementOptionType":"V"},{"StatementOptionName":"TRANSPARENCY=","StatementOptionHelp":{"#cdata":"[Syntax: TRANSPARENCY= numeric-value] \n          \nSpecifies the degree of transparency for the plot components. Specify a value from 0.0 \n(completely opaque) to 1.0 (completely transparent).\n\nDefault:0.0"},"StatementOptionType":"V"}]}},{"StatementName":"MATRIX","StatementHelp":{"#cdata":"Syntax: MATRIX numeric-variable-1 < ... numeric-variable-n> </ options>;\n      \nCreates a scatter plot matrix."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ATTRID=","StatementOptionHelp":{"#cdata":"[Syntax: ATTRID= variable]\n          \nSpecifies the value of the ID variable in an attribute map data set. You specify this option \nonly if you are using an attribute map to control visual attributes of the graph."},"StatementOptionType":"V"},{"StatementOptionName":"COLORMODEL=","StatementOptionHelp":{"#cdata":"[Syntax: COLORMODEL=style-element | (color-list)] \n          \nSpecifies a color ramp that is to be used with the COLORRESPONSE= option. \n\nstyle-element\n  specifies the name of a style element. The style element should contain these style attributes:\n    STARTCOLOR\n      specifies the color for the smallest data value of the COLORRESPONSE= column.\n    NEUTRALCOLOR\n      specifies the color for the midpoint of the range of the COLORRESPONSE= column. This attribute \n      is not required when you specify a two-color ramp model.\n    ENDCOLOR\n      specifies the color for the highest data value of the COLORRESPONSE= column.\n    Example: colormodel=TwoColorRamp\n\n(color-list)\n  specifies a space-separated list of colors to use in the color ramp. You can use style attribute references \n  such as GraphData3:Color. \n  \n  You can specify colors using a number of different color-naming schemes. The list can contain a mix of \n  style attribute references, color names, and color codes.\n  \n  Requirement: The list of colors must be enclosed in parentheses.\n  Example: colormodel=(blue yellow green)\n  Default: The ThreeColorAltRamp style element\n  Interaction: For this option to take effect, the COLORRESPONSE= option must also be specified in the statement."},"StatementOptionType":"V"},{"StatementOptionName":"COLORRESPONSE=","StatementOptionHelp":{"#cdata":"[Syntax: COLORRESPONSE=numeric-column] \n          \nSpecifies the numeric column that is used to map colors to a continuous color legend.\n\nInteractions:If the GROUP= option is also specified, then the GROUP= option is ignored.\n  The GRADLEGEND= option controls the title, position, and border of the legend. If you want only \n  the colors and not the legend, then you can specify NOGRADLEGEND.\n\nNote:This option is ignored when the JOIN option is also specified.\n\nTip:The color ramp is specified by the COLORMODEL= option. The color ramp represents the range \n  of unique response values"},"StatementOptionType":"V"},{"StatementOptionName":"DATALABEL=","StatementOptionHelp":{"#cdata":"[Syntax: DATALABEL=variable>] \n          \nSpecifies a variable that is used to create data labels for each point in the plot."},"StatementOptionType":"V"},{"StatementOptionName":"DATALABELPOS=","StatementOptionHelp":{"#cdata":"Syntax: DATALABELPOS= BOTTOM | CENTER | TOP | BOTTOMLEFT | LEFT | TOPLEFT | BOTTOMRIGHT | RIGHT | TOPRIGHT\n          \nSpecifies the location of the data label with respect to the plot. \n\nInteractions: This option has no effect unless you also specify the DATALABEL option.\nThis option displays group values for each category when GROUP= is also specified."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BOTTOM","@Value2":"CENTER","@Value3":"TOP","@Value4":"BOTTOMLEFT","@Value5":"LEFT","@Value6":"TOPLEFT","@Value7":"BOTTOMRIGHT","@Value8":"RIGHT","@Value9":"TOPRIGHT"},"StatementOptionToolTips":{"@ToolTip1":"Places the data label at the bottom of the plot.","@ToolTip2":"Places the data label at the center of the plot.","@ToolTip3":"Places the data label at the top of the plot.","@ToolTip4":"Places the data label at the bottom left corner of the plot.","@ToolTip5":"Places the data label on the left side of the plot.","@ToolTip6":"Places the data label on the top left corner of the plot.","@ToolTip7":"Places the data label at the bottom right corner of the plot.","@ToolTip8":"Places the data label on the right side of the plot.","@ToolTip9":"Places the data label on the top right corner of the plot."}},{"StatementOptionName":"DIAGONAL=","StatementOptionHelp":{"#cdata":"[Syntax: DIAGONAL=(graph-list)]\n          \nAdds graphs to the diagonal cells of the plot matrix.\n\ngraph-list can be one or more of the following:\n\n  HISTOGRAM specifies a histogram.\n   \n  KERNEL specifies a kernel density estimate.\n   \n  NORMAL specifies a normal density curve."},"StatementOptionType":"V","SubOptionsKeywords":"HISTOGRAM|KERNEL|NORMAL"},{"StatementOptionName":"ELLIPSE","StatementOptionHelp":{"#cdata":"[Syntax: ELLIPSE <= (options) >] \n          \nAdds a confidence or prediction ellipse to the scatter plot.\n\noptions can be one or more of the following:\n\nALPHA= numeric-value \n  specifies the confidence level for the ellipse.\n\nCLIP\n  specifies that X and Y values for the ellipse are ignored when determining the data ranges for the axes. \n  lipping occurs if the X or Y value for an ellipse exceeds the axis range.\n\nTYPE= MEAN | PREDICTED \n  specifies the type of ellipse. MEAN specifies a confidence ellipse for the population mean. \n  PREDICTED specifies a prediction ellipse for a new observation."},"StatementOptionType":"S|V","SubOptionsKeywords":"ALPHA=|CLIP|TYPE="},{"StatementOptionName":"GRADLEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: GRADLEGEND=(options)]\n          \nSpecifies the appearance of a continuous color legend when the COLORRESPONSE= option is used.\n\noptions can be one or more of the following:\n  BORDER  adds a border around the legend.\n  INTEGER specifies that integers are used for the gradient legend.\n    Note: This feature applies to the third maintenance release of SAS 9.4 and to later releases.\n  NOTITLE removes the default title. The default title is the name of the response variable.\n  POSITION=TOP | BOTTOM | LEFT | RIGHT\n    specifies the position of the legend within the graph.\n    Default:RIGHT\n  TITLE=\"text-sting\" specifies the label for the legend."},"StatementOptionType":"V","SubOptionsKeywords":"BORDER|INTEGER|NOTITLE|POSITION=|TITLE="},{"StatementOptionName":"GROUP=","StatementOptionHelp":{"#cdata":"[Syntax: GROUP= variable] \n          \nSpecifies a classification variable to divide the values into groups. If a fit line is requested, \nthen the GROUP= variable is also applied to the fit plot unless you specify the NOGROUP suboption \nin the option for the fit plot."},"StatementOptionType":"V"},{"StatementOptionName":"LEGEND=","StatementOptionHelp":{"#cdata":"Specifies the appearance of the legend for the scatter plot.\n\nSyntax: LEGEND=(options)\n\nwhere options can be one or more of the following:\n\n  ACROSS= n  specifies the number of columns in the legend.\n  DOWN= n  specifies the number of columns in the legend.\n  NOBORDER  removes the border from the legend.\n  NOTITLE  removes the label from the legend.\n  POSITION= position-value \n    specifies the position of the legend within the graph. The positions are as follows:\n\n    BOTTOM places the legend at the bottom of the graph.     \n    LEFT places the legend at the left side of the graph.     \n    RIGHT places the legend at the right side of the graph.     \n    TOP places the legend at the top of the graph   \n    TITLE= \"text-sting\" \n    specifies the label for the legend.\n  SORTORDER=ASCENDING | DESCENDING\n    specifies the sort order to use for the legend entry labels."},"StatementOptionType":"V","SubOptionsKeywords":"ACROSS=|DOWN=|NOBORDER|NOTITLE|POSITION=|SORTORDER="},{"StatementOptionName":"MARKERATTRS=","StatementOptionHelp":{"#cdata":"[Syntax: MARKERATTRS= style-element <(options)>| (options)] \n          \nSpecifies the appearance of the markers in the plot.\n          \noptions can be one or more of the following:\n\n    COLOR= color \n    specifies the color of the markers.\n\n    SIZE= n \n    specifies the size of the markers in pixels.\n\n    SYMBOL= symbol-name \n    specifies the symbol for the markers."},"StatementOptionType":"V","SubOptionsKeywords":"COLOR=|SIZE=|SYMBOL="},{"StatementOptionName":"NOGRADLEGEND","StatementOptionHelp":{"#cdata":"Turns off the display of the continuous color legend that appears when the COLORRESPONSE= option is used. \nThis option might be useful when you map plot colors using a numeric column but do not want a continuous color legend."},"StatementOptionType":"V"},{"StatementOptionName":"NOLEGEND","StatementOptionHelp":{"#cdata":"Removes the legend from the graph."},"StatementOptionType":"V"},{"StatementOptionName":"RATTRID=","StatementOptionHelp":{"#cdata":"[Syntax: RATTRID=character-value]\n          \nSpecifies the value of the ID variable in a range attribute map data set. You specify this option only \nif you are using a range attribute map to control visual attributes of the graph. \n\nNote: This feature applies to the third maintenance release of SAS 9.4 and to later releases."},"StatementOptionType":"V"},{"StatementOptionName":"SPLITCHAR=","StatementOptionHelp":{"#cdata":"[Syntax: SPLITCHAR=“character-list”] \n          \nSplits the text for data labels at the specified character(s) when there is not enough room to display \nthe text normally. The text value is split at every occurrence of the specified split character or characters.\n\n“character-list” is one or more characters with no delimiter between each character and enclosed \nin quotation marks. For example, to specify the split characters a, b, and c, use the following option:\n\n  SPLITCHAR=\"abc\"\n\nWhen multiple split characters are specified, each character in the list is treated as a separate \nsplit character unless the specified characters appear consecutively in the value. In that case, \nall of the specified split characters together are treated as a single split character.\nIf the value does not contain any of the specified split characters, a split does not occur."},"StatementOptionType":"V"},{"StatementOptionName":"SPLITCHARNODROP","StatementOptionHelp":{"#cdata":"Specifies that the split characters are included in the displayed value. \n          \nInteraction: This option has no effect unless SPLITCHAR= is also specified."},"StatementOptionType":"S"},{"StatementOptionName":"SPLITJUSTIFY=","StatementOptionHelp":{"#cdata":"[Syntax: SPLITJUSTIFY=LEFT | CENTER | RIGHT] \n          \nSpecifies the horizontal alignment of the value text that is being split. \n\nDefault: LEFT\n\nInteraction: This option has no effect unless you specify the SPLITCHAR= option."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"LEFT","@Value2":"CENTER","@Value3":"RIGHT"},"StatementOptionToolTips":{"@ToolTip1":"Specifies a left horizontal alignment of the value text that is being split.","@ToolTip2":"Specifies a center horizontal alignment of the value text that is being split.","@ToolTip3":"Specifies a right horizontal alignment of the value text that is being split."}},{"StatementOptionName":"START=","StatementOptionHelp":{"#cdata":"Specifies whether the diagonal starts in the top left corner or the bottom left corner.\n\nDefault: TOPLEFT"},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BOTTOMLEFT","@Value2":"TOPLEFT"},"StatementOptionToolTips":{"@ToolTip1":"Specifies that the diagonal starts in the the bottom left corner.","@ToolTip2":"Specifies that the diagonal starts in the top left corner corner."}},{"StatementOptionName":"TIP=","StatementOptionHelp":{"#cdata":"[Syntax: TIP=(variable-list)] \n          \nDisplays data tips using the data obtained from the specified variables. Data tips display information \nwhen the cursor is positioned over the graphics element. Provide a space-separated list of variables \nenclosed in parentheses. \n\nRequirement: You must specify the IMAGEMAP=ON option in the ODS GRAPHICS statement in order to generate \ndata tips. For example, add the following statement before your procedure:\n\n  ODS GRAPHICS / IMAGEMAP=ON; \n  \nInteraction: This option replaces all of the information that is displayed by default.\nTip: Use the TIPFORMAT and TIPLABEL options to assign formats and labels to the list of variables."},"StatementOptionType":"V"},{"StatementOptionName":"TIPFORMAT=","StatementOptionHelp":{"#cdata":"[Syntax: TIPFORMAT=(format-list)] \n          \nApplies formats to the list of data tip variables that you specify in the TIP= option.\n\nProvide a space-separated list of formats enclosed in parentheses. This option provides a way to \ncontrol the format of the variable data that appears in the data tips. \n\nA one-to-one correspondence exists between the format-list and the variable-list that is specified \nfor the TIP= option. A format must be provided for each variable, using the same order as the \nvariable-list. If you do not want to apply a format to a variable, use the AUTO keyword instead. \n\nDefault: The column format of the tip variable, or BEST6 if no format is assigned to a numeric column\nRequirement: A format or the keyword AUTO must be provided for each variable that is listed in the TIP= option.\nInteraction: This option has no effect unless TIP= is also specified.\nTip: Use the TIPLABEL option to assign labels to the list of variables. \nExample: tipformat=(auto F5.2)"},"StatementOptionType":"V"},{"StatementOptionName":"TIPLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: TIPLABEL=(label-list)] \n          \nApplies labels to the list of data tip variables that you specify in the TIP= option. \n\nProvide a space-separated list of quoted “text strings” enclosed in parentheses. This option provides \na way to specify labels for the variable data that appears in the data tips. \n\nA one-to-one correspondence exists between the label-list and the variable-list that is specified for \nthe TIP= option. A label must be provided for each variable, using the same order as the variable-list. \nIf you do not want to apply a custom label to a variable, use the AUTO keyword instead.\n\nRequirement: A label or the keyword AUTO must be provided for each variable that is listed in the TIP= \noption. When AUTO is used, the label is obtained from the variable.\n\nInteraction: This option has no effect unless TIP= is also specified.\nTip: Use the TIPFORMAT option to assign formats to the list of variables. \nExample: tiplabel=(auto \"Class Weight\")"},"StatementOptionType":"V"},{"StatementOptionName":"TRANSPARENCY=","StatementOptionHelp":{"#cdata":"[Syntax: TRANSPARENCY= numeric-value] \n          \nSpecifies the degree of transparency for the plot components. Specify a value from 0.0 \n(completely opaque) to 1.0 (completely transparent).\n\nDefault:0.0\n"},"StatementOptionType":"V"}]}},{"StatementName":"PLOT","StatementHelp":{"#cdata":"Syntax: PLOT plot-request(s) </ options>; \n      \nCreates a paneled graph that contains multiple independent scatter plots. A plot request \ncan be either of these: \n\ny-variable*x-variable \nplots the values of two variables. \n\n    y-variable \n    variable plotted on the left vertical axis.\n\n    x-variable \n    variable plotted on the horizontal axis.\n\n(y-variable(s))*(x-variable(s)) \nplots the values of two or more variables and produces a separate cell for each \ncombination of Y and X variables.\n\n    y-variable(s) \n    variables plotted on the left vertical axes.\n\n    x-variable(s) \n    variables plotted on the horizontal axes."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ASPECT=","StatementOptionHelp":{"#cdata":"[Syntax: ASPECT=positive-number] \n      \nSpecifies the aspect ratio of the plot’s wall area. The ratio is expressed as a positive decimal \nfraction representing wall-height divided by wall-width. For example, 0.75 is a 3/4 aspect ratio, \nand 1.0 is a square aspect ratio. \n\nDefault: The wall area is sized to the maximum area that can fill the available space.\nRange: 0.01 (short, wide rectangle) to 1 (square)"},"StatementOptionType":"V"},{"StatementOptionName":"ATTRID=","StatementOptionHelp":{"#cdata":"[Syntax: ATTRID= variable]\n          \nSpecifies the value of the ID variable in an attribute map data set. You specify this \noption only if you are using an attribute map to control visual attributes of the graph."},"StatementOptionType":"V"},{"StatementOptionName":"AXISEXTENT=","StatementOptionHelp":{"#cdata":"[Syntax: AXISEXTENT=FULL | DATA]\n          \nSpecifies the extent of the axis line for the axes.\n\nNote: This feature applies to the third maintenance release of SAS 9.4 and to later releases.\n\nThis option turns off the wall border so that the axis lines can be clearly seen."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FULL","@Value2":"DATA"},"StatementOptionToolTips":{"@ToolTip1":"The axis lines extend along the entire length of the axis.","@ToolTip2":"The axis lines extend through the data range from the minimum data point to the maximum data point."}},{"StatementOptionName":"COLORMODEL=","StatementOptionHelp":{"#cdata":"[Syntax: COLORMODEL=style-element | (color-list)] \n          \nSpecifies a color ramp that is to be used with the COLORRESPONSE= option. \n\nstyle-element\n  specifies the name of a style element. The style element should contain these style attributes:\n    STARTCOLOR\n      specifies the color for the smallest data value of the COLORRESPONSE= column.\n    NEUTRALCOLOR\n      specifies the color for the midpoint of the range of the COLORRESPONSE= column. This attribute \n      is not required when you specify a two-color ramp model.\n    ENDCOLOR\n      specifies the color for the highest data value of the COLORRESPONSE= column.\n    Example: colormodel=TwoColorRamp\n\n(color-list)\n  specifies a space-separated list of colors to use in the color ramp. You can use style attribute references \n  such as GraphData3:Color. \n  \n  You can specify colors using a number of different color-naming schemes. The list can contain a mix of \n  style attribute references, color names, and color codes.\n  \n  Requirement: The list of colors must be enclosed in parentheses.\n  Example: colormodel=(blue yellow green)\n  Default: The ThreeColorAltRamp style element\n  Interaction: For this option to take effect, the COLORRESPONSE= option must also be specified in the statement."},"StatementOptionType":"V"},{"StatementOptionName":"COLORRESPONSE=","StatementOptionHelp":{"#cdata":"[Syntax: COLORRESPONSE=numeric-column] \n          \nSpecifies the numeric column that is used to map colors to a continuous color legend.\n\nInteractions:If the GROUP= option is also specified, then the GROUP= option is ignored.\n  The GRADLEGEND= option controls the title, position, and border of the legend. If you want only \n  the colors and not the legend, then you can specify NOGRADLEGEND.\n\nNote:This option is ignored when the JOIN option is also specified.\n\nTip:The color ramp is specified by the COLORMODEL= option. The color ramp represents the range \n  of unique response values"},"StatementOptionType":"V"},{"StatementOptionName":"COLUMNS=","StatementOptionHelp":{"#cdata":"[Syntax: COLUMNS= n] \n          \nSpecifies the number of columns in the graph."},"StatementOptionType":"V"},{"StatementOptionName":"DATALABEL","StatementOptionHelp":{"#cdata":"[Syntax: DATALABEL <=variable>] \n          \nDisplays a label for each data point. If you specify a variable, the values of that variable \nare used for the data labels. If you do not specify a variable, the value of the Y variable \nis used for the data label."},"StatementOptionType":"S|V"},{"StatementOptionName":"DATALABELPOS=","StatementOptionHelp":{"#cdata":"Syntax: DATALABELPOS= BOTTOM | CENTER | TOP | BOTTOMLEFT | LEFT | TOPLEFT | BOTTOMRIGHT | RIGHT | TOPRIGHT\n          \nSpecifies the location of the data label with respect to the plot. \n\nInteractions: This option has no effect unless you also specify the DATALABEL option.\nThis option displays group values for each category when GROUP= is also specified."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BOTTOM","@Value2":"CENTER","@Value3":"TOP","@Value4":"BOTTOMLEFT","@Value5":"LEFT","@Value6":"TOPLEFT","@Value7":"BOTTOMRIGHT","@Value8":"RIGHT","@Value9":"TOPRIGHT"},"StatementOptionToolTips":{"@ToolTip1":"Places the data label at the bottom of the plot.","@ToolTip2":"Places the data label at the center of the plot.","@ToolTip3":"Places the data label at the top of the plot.","@ToolTip4":"Places the data label at the bottom left corner of the plot.","@ToolTip5":"Places the data label on the left side of the plot.","@ToolTip6":"Places the data label on the top left corner of the plot.","@ToolTip7":"Places the data label at the bottom right corner of the plot.","@ToolTip8":"Places the data label on the right side of the plot.","@ToolTip9":"Places the data label on the top right corner of the plot."}},{"StatementOptionName":"ELLIPSE","StatementOptionHelp":{"#cdata":"[Syntax: ELLIPSE <= (options) >] \n          \nAdds a confidence or prediction ellipse to the scatter plot.\n\noptions can be one or more of the following:\n\nALPHA= numeric-value \n  specifies the confidence level for the ellipse.\n\nCLIP\n  specifies that X and Y values for the ellipse are ignored when determining the data ranges for the axes.\n\nTYPE= MEAN | PREDICTED \n  specifies the type of ellipse. MEAN specifies a confidence ellipse for the population mean. \n  PREDICTED specifies a prediction ellipse for a new observation."},"StatementOptionType":"S|V","SubOptionsKeywords":"ALPHA=|CLIP|TYPE="},{"StatementOptionName":"FILLEDOUTLINEDMARKERS","StatementOptionHelp":{"#cdata":"Specifies that markers have a fill and an outline.\n          \nRequirement: The marker symbol, derived either from the applied style or specified with the \nMARKERATTRS= option, must have the “Filled” suffix in its name. Otherwise, this option is ignored. \n\nInteraction: Use the MARKERFILLATTRS= and MARKEROUTLINEATTRS= options to specify attributes for \nthe fill and outline."},"StatementOptionType":"S"},{"StatementOptionName":"GRADLEGEND=","StatementOptionHelp":{"#cdata":"[Syntax: GRADLEGEND=(options)]\n          \nSpecifies the appearance of a continuous color legend when the COLORRESPONSE= option is used.\n\noptions can be one or more of the following:\n  BORDER  adds a border around the legend.\n  INTEGER specifies that integers are used for the gradient legend.\n    Note: This feature applies to the third maintenance release of SAS 9.4 and to later releases.\n  NOTITLE removes the default title. The default title is the name of the response variable.\n  POSITION=TOP | BOTTOM | LEFT | RIGHT\n    specifies the position of the legend within the graph.\n    Default:RIGHT\n  TITLE=\"text-sting\" specifies the label for the legend."},"StatementOptionType":"V","SubOptionsKeywords":"BORDER|INTEGER|NOTITLE|POSITION=|TITLE="},{"StatementOptionName":"GRID","StatementOptionHelp":{"#cdata":"Creates grid lines for each tick on both axes."},"StatementOptionType":"S"},{"StatementOptionName":"GRIDATTRS=","StatementOptionHelp":{"#cdata":"[Syntax: GRIDATTRS=style-element <(options)> | (options)]\n          \nSpecifies the appearance of the grid lines.\n\nNote: This feature applies to the second maintenance release of SAS 9.4 and to later releases.\n\nYou can specify the appearance by using a style element or by specifying specific options. If you specify \na style element, you can also specify options to override specific appearance attributes.\n\noptions can be one or more of the following: \n\n  COLOR= color \n    specifies the color of the line. \n  PATTERN= line-pattern \n    specifies the line pattern for the line. You can reference SAS patterns by number or by name.\n  THICKNESS= n <units> \n    specifies the thickness of the line. You can also specify the unit of measure. The default unit is pixels. "},"StatementOptionType":"V","SubOptionsKeywords":"COLOR=|PATTERN=|THICKNESS="},{"StatementOptionName":"GROUP=","StatementOptionHelp":{"#cdata":"[Syntax: GROUP= variable] \n          \nSpecifies a classification variable to divide the values into groups."},"StatementOptionType":"V"},{"StatementOptionName":"JITTER","StatementOptionHelp":{"#cdata":"Specifies that data markers are offset when multiple observations have the same response value. \nWhen the JITTER option is enabled, markers that represent the same response value are offset \nslightly in order to make all of the markers visible."},"StatementOptionType":"S"},{"StatementOptionName":"JOIN","StatementOptionHelp":{"#cdata":"[Syntax: JOIN <=(options)>] \n          \nSpecifies that line segments join all of the scatter points. The line segments connect the scatter \npoints in increasing order along the X axis. The data order of the input data set has no effect on \nthe order of the lines. \n\nYou can specify the following options:\n\nLINEATTRS=style-element <(options)> | (options)\n  specifies the appearance of the join lines. You can specify the appearance by using a style element \n  or by specifying specific options. If you specify a style element, you can also specify options to \n  override specific appearance attributes. \n  \nSMOOTHCONNECT specifies that a smoothed line passes through all vertices."},"StatementOptionType":"S|V","SubOptionsKeywords":"LINEATTRS=SMOOTHCONNECT|"},{"StatementOptionName":"LEGEND=","StatementOptionHelp":{"#cdata":"Specifies the appearance of the legend for the scatter plot.\n\nSyntax: LEGEND=(options)\n\nwhere options can be one or more of the following:\n\n  ACROSS= n  specifies the number of columns in the legend.\n  DOWN= n  specifies the number of columns in the legend.\n  NOBORDER  removes the border from the legend.\n  NOTITLE  removes the label from the legend.\n  POSITION= position-value \n    specifies the position of the legend within the graph. The positions are as follows:\n\n    BOTTOM places the legend at the bottom of the graph.     \n    LEFT places the legend at the left side of the graph.     \n    RIGHT places the legend at the right side of the graph.     \n    TOP places the legend at the top of the graph   \n    TITLE= \"text-sting\" \n    specifies the label for the legend.\n  SORTORDER=ASCENDING | DESCENDING\n    specifies the sort order to use for the legend entry labels."},"StatementOptionType":"V","SubOptionsKeywords":"ACROSS=|DOWN=|NOBORDER|NOTITLE|POSITION=|SORTORDER="},{"StatementOptionName":"LOESS=","StatementOptionHelp":{"#cdata":"[Syntax: LOESS=(options)] \n          \nAdds a loess fit to the scatter plot. You can specify the following options:\n\n  ALPHA= numeric-value \n  specifies the confidence level for the confidence limits.\n\n  CLM \n  creates confidence limits for a mean predicted value for each observation.\n\n  DEGREE= 1 | 2 \n  specifies the degree of the local polynomials to use for each local regression. 1 specifies a linear fit and 2 specifies a quadratic fit.\n\n  INTERPOLATION= CUBIC | LINEAR \n  specifies the degree of the interpolating polynomials that are used for blending local polynomial fits at the kd tree vertices.\n\n  LINEATTRS= style-element <(COLOR= | PATTERN= | THICKNESS=)> | (COLOR= | PATTERN= | THICKNESS=) \n  specifies the appearance of the fit line.\n\n  NOGROUP \n  specifies that the fit does not use the group variable from the scatter plot.\n\n  SMOOTH= numeric-value \n  specifies a smoothing parameter value."},"StatementOptionType":"S|V","SubOptionsKeywords":"ALPHA=|CLM|DEGREE=|INTERPOLATION=|LINEATTRS=|NOGROUP|SMOOTH="},{"StatementOptionName":"MARKERATTRS=","StatementOptionHelp":{"#cdata":"[Syntax: MARKERATTRS= style-element <(options)>| (options)] \n          \nSpecifies the appearance of the markers in the plot.\n          \noptions can be one or more of the following:\n\n    COLOR= color \n    specifies the color of the markers.\n\n    SIZE= n \n    specifies the size of the markers in pixels.\n\n    SYMBOL= symbol-name \n    specifies the symbol for the markers."},"StatementOptionType":"V","SubOptionsKeywords":"COLOR=|SIZE=|SYMBOL="},{"StatementOptionName":"MARKERFILLATTRS=","StatementOptionHelp":{"#cdata":"[Syntax: MARKERFILLATTRS=style-element <(COLOR=color)> | (COLOR=color)] \n          \nSpecifies the color of the marker fill. You can specify colors using the same color schemes \nthat are supported by SAS/GRAPH software. \n\nDefault: Color attribute of the GraphDataDefault style element in the current style for ungrouped data. \nGraphData-1 ... GraphData-n style elements in the current style for grouped data.\n\nInteractions: This option has no effect unless FILLEDOUTLINEDMARKERS is also specified.\nThis option overrides any color that is specified with the MARKERATTRS= option. \n\nTip: You can also use the MARKEROUTLINEATTRS= option to specify attributes for the marker outline."},"StatementOptionType":"V"},{"StatementOptionName":"MARKEROUTLINEATTRS=","StatementOptionHelp":{"#cdata":"[Syntax: MARKEROUTLINEATTRS=style-element <(options)> | (options)] \n          \nSpecifies the appearance of the marker outlines. You can specify the appearance by using a style \nelement or by specifying specific options. If you specify a style element, you can also specify \noptions to override specific appearance attributes. \n\nFor the options, you can specify either or both of the following:\n  •line color\n  •line thickness \n  \noptions can be one or more of the following attributes.\nCOLOR= color\n  specifies the color of the line. You can specify colors using the same color schemes that are \n  supported by SAS/GRAPH software. \nPATTERN= line-pattern\n  specifies the line pattern for the line. Line patterns can be specified as a pattern name \n  or pattern number. Some valid pattern numbers: 1 (Solid), 2 (ShortDash), \n  4 (MediumDash), 5 (LongDash) 8 (MediumDashShortDash) 14 (DashDashDot) 15 (DashDotDot) 20 (Dash) \n  26 (LongDashShortDash) 34 (Dot) 35 (ThinDot) 41 (ShortDashDot) 42 (MediumDashDotDot). \n  Not all pattern numbers have names.\nTHICKNESS= n <units>\n  specifies the thickness of the line. You can also specify the unit of measurement. The default \n  unit is pixels."},"StatementOptionType":"V","SubOptionsKeywords":"COLOR=|PATTERN=|THICKNESS="},{"StatementOptionName":"MINORGRID","StatementOptionHelp":{"#cdata":"Creates grid lines at each minor tick on both axes.\n          \nNote: This feature applies to the second maintenance release of SAS 9.4 and to later releases.\n\nInteraction:This option has no effect unless GRID is also specified for the axis."},"StatementOptionType":"V"},{"StatementOptionName":"MINORGRIDATTRS=","StatementOptionHelp":{"#cdata":"[Syntax: MINORGRIDATTRS=style-element <(options)> | (options)\\\n          \nSpecifies the appearance of the minor grid lines.\n\nNote: This feature applies to the second maintenance release of SAS 9.4 and to later releases.\n\nYou can specify the appearance by using a style element or by specifying specific options. If you specify \na style element, you can also specify options to override specific appearance attributes.\n\nDefault:GraphMinorGridLines style element in the current style for ungrouped data. GraphData1 ... GraphDatan \n  style elements in the current style for grouped data.\nInteraction:This option has no effect unless MINORGRID is also specified.\nTip:You can use GRIDATTRS= to change the appearance of the major grid lines.\n  \noptions can be one or more of the following attributes.\nCOLOR= color\n  specifies the color of the line. You can specify colors using the same color schemes that are \n  supported by SAS/GRAPH software. \nPATTERN= line-pattern\n  specifies the line pattern for the line. Line patterns can be specified as a pattern name \n  or pattern number. Some valid pattern numbers: 1 (Solid), 2 (ShortDash), \n  4 (MediumDash), 5 (LongDash) 8 (MediumDashShortDash) 14 (DashDashDot) 15 (DashDotDot) 20 (Dash) \n  26 (LongDashShortDash) 34 (Dot) 35 (ThinDot) 41 (ShortDashDot) 42 (MediumDashDotDot). \n  Not all pattern numbers have names.\nTHICKNESS= n <units>\n  specifies the thickness of the line. You can also specify the unit of measurement. The default \n  unit is pixels."},"StatementOptionType":"V","SubOptionsKeywords":"COLOR=|PATTERN=|THICKNESS="},{"StatementOptionName":"NOBORDER","StatementOptionHelp":{"#cdata":"Removes the border from each plot in the panel."},"StatementOptionType":"V"},{"StatementOptionName":"NOGRADLEGEND","StatementOptionHelp":{"#cdata":"Turns off the display of the continuous color legend that appears when the COLORRESPONSE= option is used. \nThis option might be useful when you map plot colors using a numeric column but do not want a continuous \ncolor legend."},"StatementOptionType":"V"},{"StatementOptionName":"NOLEGEND","StatementOptionHelp":{"#cdata":"Removes the legend from the graph."},"StatementOptionType":"V"},{"StatementOptionName":"NOWALL","StatementOptionHelp":{"#cdata":"Turns off the display of the graph wall’s fill and outline. This option might be useful when your \ngraph contains an annotation, and the wall color interferes with that annotation. \n\nFor most styles, the wall outline is the same as the axis lines, and it is impossible to see the \ndifference. Also, the wall fill color is often the same as the graph background. However, if this \nis not the case with the style that you use for a graph, then you might want to suppress the wall \nfill and outline."},"StatementOptionType":"V"},{"StatementOptionName":"PBSPLINE","StatementOptionHelp":{"#cdata":"[Syntax: PBSLPINE<=(options)>] \n          \nAdds a fitted, penalized β-spline curve to the scatter plot. You can specify the \nfollowing options:\n\n  ALPHA= numeric-value \n  specifies the confidence level for the confidence limits.\n\n  CLI \n  creates confidence limits for individual predicted values for each observation.\n\n  CLM \n  creates confidence limits for a mean predicted value for each observation.\n\n  DEGREE= 1 | 2 \n  specifies the degree of the local polynomials to use for each local regression. \n  1 specifies a linear fit and 2 specifies a quadratic fit.\n\n  LINEATTRS= style-element <(COLOR= | PATTERN= | THICKNESS=)> | (COLOR= | PATTERN= | THICKNESS=) \n  specifies the appearance of the fit line.\n\n  NKNOTS= n \n  specifies the number of evenly-spaced internal knots.\n\n  NOGROUP \n  specifies that the fit does not use the group variable from the scatter plot.\n\n  SMOOTH= numeric-value \n  specifies a smoothing parameter value."},"StatementOptionType":"S|V","SubOptionsKeywords":"ALPHA=|CLI|CLM|DEGREE=|LINEATTRS=|NKNOTS=|NOGROUP|SMOOTH="},{"StatementOptionName":"RATTRID=","StatementOptionHelp":{"#cdata":"[Syntax: RATTRID=character-value]\n          \nSpecifies the value of the ID variable in a range attribute map data set. You specify this option \nonly if you are using a range attribute map to control visual attributes of the graph.\n\nNote: This feature applies to the third maintenance release of SAS 9.4 and to later releases."},"StatementOptionType":"V"},{"StatementOptionName":"REFTICKS","StatementOptionHelp":{"#cdata":"[Syntax: REFTICKS <=(options)>] \n          \nDuplicates the tick marks from the X and Y axes on the opposite sides of each cell. \n\nYou can also specify options:\n\n  LABEL\n  in addition to the tick marks, displays the axis label.\n  \n  VALUES\n  in addition to the tick marks, displays the values that are represented by the tick marks."},"StatementOptionType":"S|V","SubOptionsKeywords":"LABEL|VALUES"},{"StatementOptionName":"REG","StatementOptionHelp":{"#cdata":"[Syntax: REG< =(options)>] \n          \nAdds a regression fit to the scatter plot. You can specify the following options:\n\n  ALPHA= numeric-value \n  specifies the confidence level for the confidence limits.\n\n  CLI \n  creates confidence limits for individual predicted values for each observation.\n\n  CLM \n  creates confidence limits for a mean predicted value for each observation.\n\n  DEGREE= 1 | 2 \n  specifies the degree of the local polynomials to use for each local regression. \n  1 specifies a linear fit and 2 specifies a quadratic fit.\n\n  LINEATTRS= style-element <(COLOR= | PATTERN= | THICKNESS=)> | (COLOR= | PATTERN= | THICKNESS=) \n  specifies the appearance of the fit line.\n\n  NOGROUP \n  specifies that the fit does not use the group variable from the scatter plot."},"StatementOptionType":"S|V","SubOptionsKeywords":"ALPHA=|CLI|CLM|DEGREE=|LINEATTRS=|NOGROUP"},{"StatementOptionName":"ROWS=","StatementOptionHelp":{"#cdata":"[Syntax: ROWS = n] \n          \nSpecifies the number of rows in the graph."},"StatementOptionType":"V"},{"StatementOptionName":"SPACING=","StatementOptionHelp":{"#cdata":"[Syntax: SPACING = n] \n          \nSpecifies the amount of spacing (in pixels) that is placed between the cells \nin the graph."},"StatementOptionType":"V"},{"StatementOptionName":"SPLITCHAR=","StatementOptionHelp":{"#cdata":"[Syntax: SPLITCHAR=“character-list”] \n          \nSplits the text for data labels at the specified character(s) when there is not enough room to display \nthe text normally. The text value is split at every occurrence of the specified split character or characters.\n\n“character-list” is one or more characters with no delimiter between each character and enclosed \nin quotation marks. For example, to specify the split characters a, b, and c, use the following option:\n\n  SPLITCHAR=\"abc\"\n\nWhen multiple split characters are specified, each character in the list is treated as a separate \nsplit character unless the specified characters appear consecutively in the value. In that case, \nall of the specified split characters together are treated as a single split character.\nIf the value does not contain any of the specified split characters, a split does not occur."},"StatementOptionType":"V"},{"StatementOptionName":"SPLITCHARNODROP","StatementOptionHelp":{"#cdata":"Specifies that the split characters are included in the displayed value. \n          \nInteraction: This option has no effect unless SPLITCHAR= is also specified."},"StatementOptionType":"S"},{"StatementOptionName":"SPLITJUSTIFY=","StatementOptionHelp":{"#cdata":"[Syntax: SPLITJUSTIFY=LEFT | CENTER | RIGHT] \n          \nSpecifies the horizontal alignment of the value text that is being split. \n\nDefault: LEFT\n\nInteraction: This option has no effect unless you specify the SPLITCHAR= option."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"LEFT","@Value2":"CENTER","@Value3":"RIGHT"},"StatementOptionToolTips":{"@ToolTip1":"Specifies a left horizontal alignment of the value text that is being split.","@ToolTip2":"Specifies a center horizontal alignment of the value text that is being split.","@ToolTip3":"Specifies a right horizontal alignment of the value text that is being split."}},{"StatementOptionName":"TIP=","StatementOptionHelp":{"#cdata":"[Syntax: TIP=(variable-list)] \n          \nDisplays data tips using the data obtained from the specified variables. Data tips display information \nwhen the cursor is positioned over the graphics element. Provide a space-separated list of variables \nenclosed in parentheses. \n\nRequirement: You must specify the IMAGEMAP=ON option in the ODS GRAPHICS statement in order to generate \ndata tips. For example, add the following statement before your procedure:\n\n  ODS GRAPHICS / IMAGEMAP=ON; \n  \nInteraction: This option replaces all of the information that is displayed by default.\nTip: Use the TIPFORMAT and TIPLABEL options to assign formats and labels to the list of variables."},"StatementOptionType":"V"},{"StatementOptionName":"TIPFORMAT=","StatementOptionHelp":{"#cdata":"[Syntax: TIPFORMAT=(format-list)] \n          \nApplies formats to the list of data tip variables that you specify in the TIP= option.\n\nProvide a space-separated list of formats enclosed in parentheses. This option provides a way to \ncontrol the format of the variable data that appears in the data tips. \n\nA one-to-one correspondence exists between the format-list and the variable-list that is specified \nfor the TIP= option. A format must be provided for each variable, using the same order as the \nvariable-list. If you do not want to apply a format to a variable, use the AUTO keyword instead. \n\nDefault: The column format of the tip variable, or BEST6 if no format is assigned to a numeric column\nRequirement: A format or the keyword AUTO must be provided for each variable that is listed in the TIP= option.\nInteraction: This option has no effect unless TIP= is also specified.\nTip: Use the TIPLABEL option to assign labels to the list of variables. \nExample: tipformat=(auto F5.2)"},"StatementOptionType":"V"},{"StatementOptionName":"TIPLABEL=","StatementOptionHelp":{"#cdata":"[Syntax: TIPLABEL=(label-list)] \n          \nApplies labels to the list of data tip variables that you specify in the TIP= option. \n\nProvide a space-separated list of quoted “text strings” enclosed in parentheses. This option provides \na way to specify labels for the variable data that appears in the data tips. \n\nA one-to-one correspondence exists between the label-list and the variable-list that is specified for \nthe TIP= option. A label must be provided for each variable, using the same order as the variable-list. \nIf you do not want to apply a custom label to a variable, use the AUTO keyword instead.\n\nRequirement: A label or the keyword AUTO must be provided for each variable that is listed in the TIP= \noption. When AUTO is used, the label is obtained from the variable.\n\nInteraction: This option has no effect unless TIP= is also specified.\nTip: Use the TIPFORMAT option to assign formats to the list of variables. \nExample: tiplabel=(auto \"Class Weight\")"},"StatementOptionType":"V"},{"StatementOptionName":"TRANSPARENCY=","StatementOptionHelp":{"#cdata":"[Syntax: TRANSPARENCY= numeric-value] \n          \nSpecifies the degree of transparency for the plot components. Specify a value from 0.0 \n(completely opaque) to 1.0 (completely transparent).\n\nDefault:0.0"},"StatementOptionType":"V"},{"StatementOptionName":"UNISCALE=","StatementOptionHelp":{"#cdata":"[Syntax: UNISCALE= X | Y | ALL] \n          \nSpecifies that the X axis, Y axis, or both axes are scaled uniformly for all of the cells in the graph. \nBy default, no scaling is performed. If this option is used, then all variables on the specified axis \nmust be of the same type (all numeric or all character)."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"X","@Value2":"Y","@Value3":"ALL"},"StatementOptionToolTips":{"@ToolTip1":"Specifies that the X axis is scaled uniformly for all of the cells in the graph.","@ToolTip2":"Specifies that the Y axis is scaled uniformly for all of the cells in the graph.","@ToolTip3":"Specifies that both axes are scaled uniformly for all of the cells in the graph."}}]}}]}}}