{"Procedure":{"Name":"SIMLIN","ProductGroup":"SAS/ETS","ProcedureHelp":{"#cdata":"Syntax: PROC SIMLIN options ; \n    BY variables ; \n    ENDOGENOUS variables ; \n    EXOGENOUS variables ; \n    ID variables ; \n    LAGGED lag-var endogenous-var number ellipsis ; \n    OUTPUT OUT=SAS-data-set options ;\n\nThe SIMLIN procedure reads the coefficients for a set of linear structural equations, which \nare usually produced by the SYSLIN procedure. PROC SIMLIN then computes the reduced form and, \nif input data are given, uses the reduced form equations to generate predicted values. PROC \nSIMLIN is especially useful when dealing with sets of structural difference equations. The \nSIMLIN procedure can perform simulation or forecasting of the endogenous variables. \n\nThe SIMLIN procedure can be applied only to models that are: \n\n  o linear with respect to the parameters \n  o linear with respect to the variables \n  o square (as many equations as endogenous variables) \n  o nonsingular (the coefficients of the endogenous variables form an invertible matrix)"},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA= SAS-data-set] \n      \nSpecifies the SAS data set containing input data for the simulation. If the DATA= option is used, \nthe data set specified must supply values for all exogenous variables throughout the simulation. \nIf the DATA= option is not specified, no simulation of the system is performed, and only the reduced \nform and multipliers are computed."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"EST=","ProcedureOptionHelp":{"#cdata":"[Syntax: EST= SAS-data-set] \n      \nSpecifies the input data set containing the structural coefficients of the system. If EST= \nis omitted the most recently created SAS data set is used. The EST= data set is normally a \n\"TYPE=EST\" data set produced by the OUTEST= option of PROC SYSLIN. However, you can also \nbuild the EST= data set with a SAS DATA step."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"ESTPRINT","ProcedureOptionHelp":{"#cdata":"Prints the structural coefficients read from the EST= data set."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"INTERIM=","ProcedureOptionHelp":{"#cdata":"[Syntax: INTERIM= n] \n      \nRequests that interim multipliers be computed for interims 1 through n. If not specified, \nno interim multipliers are computed. This feature is available only if there are no lags \ngreater than 1."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NOPRINT","ProcedureOptionHelp":{"#cdata":"Suppresses all printed output."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NORED","ProcedureOptionHelp":{"#cdata":"Suppresses the printing of the reduced form coefficients."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"OUTEST=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUTEST= SAS-data-set] \n      \nSpecifies an output SAS data set to contain the reduced form coefficients and multipliers,\nin addition to the structural coefficients read from the EST= data set. The OUTEST= data set \nhas the same form as the EST= data set. If the OUTEST= option is not specified, the reduced \nform coefficients and multipliers are not written to a data set."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"START=","ProcedureOptionHelp":{"#cdata":"[Syntax: START= n] \n      \nSpecifies the observation number in the DATA= data set where the dynamic simulation \nis to be started. By default, the dynamic simulation starts with the first observation \nin the DATA= data set for which all variables (including lags) are not missing."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"TOTAL","ProcedureOptionHelp":{"#cdata":"Requests that the total multipliers be computed. This feature is available only if there \nare no lags greater than 1."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"TYPE=","ProcedureOptionHelp":{"#cdata":"[Syntax: TYPE= value] \n      \nSpecifies the type of estimates to be read from the EST= data set. The TYPE= value must \nmatch the value of the _TYPE_ variable for the observations that you want to select from \nthe EST= data set (TYPE=2SLS, for example)."},"ProcedureOptionType":"V"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY variables ; \n\nA BY statement can be used with PROC SIMLIN to obtain separate analyses for groups \nof observations defined by the BY variables."},"StatementOptions":null},{"StatementName":"ENDOGENOUS|ENDOG|ENDO","StatementHelp":{"#cdata":"Syntax: ENDOGENOUS variables ; \n\nList the names of the endogenous (jointly dependent) variables in the ENDOGENOUS statement. \nThe ENDOGENOUS statement can be abbreviated as ENDOG or ENDO."},"StatementOptions":null},{"StatementName":"EXOGENOUS|EXOG|EXO","StatementHelp":{"#cdata":"Syntax: EXOGENOUS variables ; \n\nList the names of the exogenous (independent) variables in the EXOGENOUS statement. \nThe EXOGENOUS statement can be abbreviated as EXOG or EXO."},"StatementOptions":null},{"StatementName":"ID","StatementHelp":{"#cdata":"Syntax: ID variables ; \n\nThe ID statement can be used to restrict the variables copied from the DATA= data set to the \nOUT= data set. Use the ID statement to list the variables you want copied to the OUT= data set \nbesides the exogenous, endogenous, lagged endogenous, and BY variables. If the ID statement \nis omitted, all the variables in the DATA= data set are copied to the OUT= data set."},"StatementOptions":null},{"StatementName":"LAGGED","StatementHelp":{"#cdata":"Syntax: LAGGED lag-var endogenous-var number ellipsis ; \n\nFor each lagged endogenous variable, specify the name of the lagged variable, the name of the endogenous\nvariable that was lagged, and the degree of the lag. Only one LAGGED statement is allowed. \n\nThe following is an example of the use of the LAGGED statement: \n\n   proc simlin est=e;\n      endog y1 y2;\n      lagged y1lag1 y1 1  y2lag1 y2 1  y2lag3 y2 3;\n   run; \n   \nThis statement specifies that the variable Y1LAG1 contains the values of the endogenous variable \nY1 lagged one period; the variable Y2LAG1 refers to the values of Y2 lagged one period; and the \nvariable Y2LAG3 refers to the values of Y2 lagged three periods."},"StatementOptions":null},{"StatementName":"OUTPUT","StatementHelp":{"#cdata":"Syntax: OUTPUT OUT= SAS-data-set options ; \n\nThe OUTPUT statement specifies that predicted and residual values be put in an output data set.\nA DATA= input data set must be supplied if the OUTPUT statement is used, and only one OUTPUT \nstatement is allowed."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"OUT=","StatementOptionHelp":{"#cdata":"[Syntax: OUT= SAS-data-set] \n          \nNames the output SAS data set to contain the predicted values and residuals. If OUT= is not \nspecified, the output data set is named using the DATAn convention."},"StatementOptionType":"DV"},{"StatementOptionName":"PREDICTED=|P=","StatementOptionHelp":{"#cdata":"[Syntax: PREDICTED= names] \n          \nNames the variables in the output data set that contain the predicted values of the simulation. \nThese variables correspond to the endogenous variables in the order in which they are specified \nin the ENDOGENOUS statement. Specify up to as many names as there are endogenous variables. If \nyou specify names on the PREDICTED= option for only some of the endogenous variables, predicted \nvalues for the remaining variables are not output. The names must not match any variable name in \nthe input data set."},"StatementOptionType":"V"},{"StatementOptionName":"RESIDUAL=|R=","StatementOptionHelp":{"#cdata":"[Syntax: RESIDUAL= names] \n          \nNames the variables in the output data set that contain the residual values from the simulation. \nThe residuals are the differences between the actual values of the endogenous variables from the \nDATA= data set and the predicted values from the simulation. These variables correspond to the \nendogenous variables in the order in which they are specified in the ENDOGENOUS statement. Specify \nup to as many names as there are endogenous variables. The names must not match any variable name \nin the input data set."},"StatementOptionType":"V"}]}}]}}}