{"Procedure":{"Name":"SORT","ProductGroup":"BASE","ProcedureHelp":{"#cdata":"Syntax: PROC SORT <collating-sequence-option> <other option(s)>;  \n      BY <DESCENDING> variable-1 <...<DESCENDING> variable-n>; \n      \nThe SORT procedure orders SAS data set observations by the values of one or more \ncharacter or numeric variables. The SORT procedure either replaces the original \ndata set or creates a new data set. PROC SORT produces only an output data set."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"ASCII","ProcedureOptionHelp":{"#cdata":"Sorts character variables using the ASCII collating sequence."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"DANISH|NORWEGIAN","ProcedureOptionHelp":{"#cdata":"Sorts characters according to the Danish and Norwegian convention."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"EBCDIC","ProcedureOptionHelp":{"#cdata":"Sorts character variables using the EBCDIC collating sequence."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"POLISH","ProcedureOptionHelp":{"#cdata":"Sorts characters according to the Polish convention."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"FINNISH|SWEDISH","ProcedureOptionHelp":{"#cdata":"Sorts characters according to the Finnish and Swedish convention."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NATIONAL","ProcedureOptionHelp":{"#cdata":"Sorts character variables using an alternate collating sequence, as defined by your installation, \nto reflect a country's National Use Differences."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"SORTSEQ=","ProcedureOptionHelp":{"#cdata":"[Syntax: SORTSEQ= collating-sequence] \n      \nSpecifies the collating sequence. The collating-sequence can be a collating-sequence-option, \na translation table, an encoding, or the keyword LINGUISTIC."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"ASCII","@Value2":"DANISH","@Value3":"EBCDIC","@Value4":"FINNISH","@Value5":"ITALIAN","@Value6":"NORWEGIAN","@Value7":"POLISH","@Value8":"REVERSE","@Value9":"SPANISH","@Value10":"SWEDISH","@Value11":"LINGUISTIC|UCA"},"ProcedureOptionToolTips":{"@ToolTip1":"ASCII translation table","@ToolTip2":"DANISH translation table","@ToolTip3":"EBCDIC translation table","@ToolTip4":"FINNISH translation table","@ToolTip5":"ITALIAN translation table","@ToolTip6":"NORWEGIAN translation table","@ToolTip7":"POLISH translation table","@ToolTip8":"REVERSE translation table","@ToolTip9":"SPANISH translation table","@ToolTip10":"SWEDISH translation table","@ToolTip11":"Specifies linguistic collation, which sorts characters according to rules of the specified language."},"SubOptionsKeywords":"\n        ALTERNATE_HANDLING=|SHIFTED|CASE_FIRST=|UPPER|LOWER|COLLATION=|\n        BIG5HAN|DIRECT|GB2312HAN|PHONEBOOK|PINYIN|POSIX|STROKE|TRADITIONAL|LOCALE=|\n        NUMERIC_COLLATION=|ON|OFF|STRENGTH=|LEVEL=|PRIMARY|SECONDARY|TERTIARY|QUARTERNARY|IDENTICAL\n      "},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA= SAS-data-set] \n      \nIdentifies the input SAS data set."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"DATECOPY","ProcedureOptionHelp":{"#cdata":"Copies the SAS internal date and time when the SAS data set was created and the \ndate and time when it was last modified before the sort to the resulting sorted \ndata set. Note that the operating environment date and time are not preserved."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"DUPOUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: DUPOUT=SAS-data-set] \n      \nSpecifies the output data set to which duplicate observations are written."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"EQUALS","ProcedureOptionHelp":{"#cdata":"Maintains the relative order of the observations within the input data set in the \noutput data set."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOEQUALS","ProcedureOptionHelp":{"#cdata":"Does not necessarily maintain the relative order of the observations within the input data set in the \noutput data set."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"FORCE","ProcedureOptionHelp":{"#cdata":"Sorts and replaces an indexed data set when the OUT= option is not specified."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NODUPKEY","ProcedureOptionHelp":{"#cdata":"Checks for and eliminates observations with duplicate BY values."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NODUPRECS|NODUP","ProcedureOptionHelp":{"#cdata":"Checks for and eliminates duplicate observations.\n      \nNote: This option has been removed from the SAS 9.4 documentation. Consider using the NODUPKEY option instead."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"OUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUT=SAS-data-set] \n      \nNames the output data set. If SAS-data-set does not exist, then PROC SORT creates it."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"OVERWRITE","ProcedureOptionHelp":{"#cdata":"Enables the input data set to be deleted before the replacement output data set \nis populated with observations."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"PRESORTED","ProcedureOptionHelp":{"#cdata":"Before sorting, checks within the input data set to determine whether the sequence \nof observations are in order."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"REVERSE","ProcedureOptionHelp":{"#cdata":"Sorts character variables using a collating sequence that is reversed from the normal \ncollating sequence."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"SORTSIZE=|SIZE=","ProcedureOptionHelp":{"#cdata":"Specifies the maximum amount of memory that is available to PROC SORT."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"MAX"},"ProcedureOptionToolTips":{"@ToolTip1":"Specifies the amount of memory in bytes, where n is a real number.","@ToolTip2":"Specifies the amount of memory in kilobytes, where n is a real number.","@ToolTip3":"Specifies the amount of memory in megabytes, where n is a real number","@ToolTip4":"Specifies the amount of memory in gigabytes, where n is a real number.","@ToolTip5":"Specifies that all available memory can be used."}},{"ProcedureOptionName":"TAGSORT","ProcedureOptionHelp":{"#cdata":"Stores only the BY variables and the observation numbers in temporary files."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"THREADS","ProcedureOptionHelp":{"#cdata":"Enables the activation of multi-threaded sorting."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOTHREADS","ProcedureOptionHelp":{"#cdata":"Prevents the activation of multi-threaded sorting."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOUNIQUEKEY|NOUNIKEY|NOUNIKEYS|NOUNIQUEKEYS","ProcedureOptionHelp":{"#cdata":"Checks for and eliminates observations from the output data set that have a unique \nsort key. A sort key is unique when the observation containing the key is the only \nobservation within a BY group. An observation has a unique sort key when it is the \nonly observation within a BY group.\n\nNote: Unlike NODUPKEY, which writes one observation of a BY group to the output data \nset and discards all other observations from the BY group, the NOUNIQUEKEY maintains \nBY group integrity. Either all observations of a BY group are written to the output \ndata set when the BY group consists of two or more observations, or all observations \nof the BY group are discarded when the BY group consists of a single observation. \n \nInteractions:If the NOUNIQUEREC and NOUNIQUEKEY options are specified then NOUNIQUEREC \nwill be ignored and processing will proceed as if only NOUNIQUEKEY had been specified. \n\nThe NODUP category (NODUPKEY, NODUPREC) of options and the NOUNIQUE category of options \n(NOUNIQUEREC, NOUNIQUEKEY) are not compatible. If any of the NODUP category of options \nand the NOUNIQUE category of options are specified together, an error will be printed \nto the SAS log. \n\nTip:The UNIQUEOUT= option can be used only with the NOUNIQUEKEY or NOUNIQUEREC options. \nIt cannot be combined with either the NODUPREC or NODUPKEY option."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOUNIQUEREC|NOUNIREC|NOUNIRECS|NOUNIQUERECS","ProcedureOptionHelp":{"#cdata":"Checks for and eliminates observations from the output data set that are adjacently \nunique. PROC SORT only writes to the output data set observations that it determines \nare not unique. For example, during output, observation B is compared to observation \nA that precedes it and then to observation C that follows it. If observation B has \nvariable values that differ from observation A’s or observation C’s variable values, \nthen observation B is considered unique and is not written to the output data set.\nWhen the UNIQUEOUT= option is specified with NOUNIQUEREC, then unique observations \nare written to the data set specified by the UNIQUEOUT= option. \n\nNote: The NOUNIQUEREC option might not function as expected. Only observations that \nPROC SORT determines are unique are eliminated from the output data set. Because \nobservations within a BY group can be arranged in any order, equivalent observations \nare not guaranteed to be grouped together. Therefore, an observation determined to \nbe unique from other adjacent observations might not be truly unique within the BY \ngroup. To eliminate only observations that are truly unique within all BY groups in \nthe output data set, consider using the NOUNIQEKEY option when sorting BY all variables. \nThe NOUNIQUEREC option is analogous to the NODUPREC option. Use these two options with \ncaution. \n \nInteractions:If the NOUNIQUEREC and NOUNIQUEKEY options are both specified, the \nNOUNIQUEREC option will be ignored and processing will proceed as if only NOUNIQUEKEY \nhad been specified. \n\nThe NODUP category (NODUPKEY, NODUPREC) of options and the NOUNIQUE category of \noptions (NOUNIQUEREC, NOUNIQUEKEY) not compatible. If any of the NODUP category \nof options and the NOUNIQUE category of options are specified together, an error \nwill be printed to the SAS log. \n\nTip:The UNIQUEOUT= option can be used only with the NOUNIQUEKEY or NOUNIQUEREC \noptions. It cannot be combined with either the NODUPREC or NODUPKEY option."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"UNIQUEOUT=|UNIOUT","ProcedureOptionHelp":{"#cdata":"Syntax: UNIQUEOUT= SAS-data-set \n\nSpecifies the output data set for observations eliminated by the NOUNIQUEREC \nand NOUNIQUEKEY options.\n \nInteraction:The DUPOUT= and UNIOUT= options are not compatible and cannot be \nspecified simultaneously. \n\nTip:The UNIQUEOUT= option can be used only with the NOUNIQUEKEY or NOUNIQUEREC \noptions. It cannot be combined with either the NODUPREC or NODUPKEY option."},"ProcedureOptionType":"V"}],"#comment":{}},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n>; \n      \nSpecifies the sorting variables."},"StatementOptions":{"StatementOption":{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"}}},{"StatementName":"KEY|KEYS","StatementHelp":{"#cdata":"Syntax: KEY variable(s) </ option> ; \n      \nSpecifies sorting keys and variables."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ASCENDING","StatementOptionHelp":{"#cdata":"Sorts in ascending order the variable or variables that it follows."},"StatementOptionType":"S"},{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Reverses the sort order for the variable that it follows in the statement so that \nobservations are sorted from the largest value to the smallest value. The \nDESCENDING keyword modifies all the variables that it precede on the KEY \nstatement."},"StatementOptionType":"S"}]}}]}}}