{"Procedure":{"Name":"SPECTRA","ProductGroup":"SAS/ETS","ProcedureHelp":{"#cdata":"Syntax: PROC SPECTRA options ; \n    BY variables ; \n    VAR variables ; \n    WEIGHTS <weights> <kernel> ; \n    \nThe SPECTRA procedure performs spectral and cross-spectral analysis of time series. You can \nuse spectral analysis techniques to look for periodicities or cyclical patterns in data. \n\nThe SPECTRA procedure produces estimates of the spectral and cross-spectral densities of \na multivariate time series. Estimates of the spectral and cross-spectral densities of a \nmultivariate time series are produced using a finite Fourier transform to obtain periodograms \nand cross-periodograms. The periodogram ordinates are smoothed by a moving average to produce \nestimated spectral and cross-spectral densities. PROC SPECTRA can also test whether or not the \ndata are white noise."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"A","ProcedureOptionHelp":{"#cdata":"Outputs the amplitude variables (A_nn _mm) of the cross-spectrum."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"ADJMEAN|CENTER","ProcedureOptionHelp":{"#cdata":"Subtracts the series mean before performing the Fourier decomposition. This sets the first \nperiodogram ordinate to 0 rather than 2n times the squared mean. This option is commonly \nused when the periodograms are to be plotted to prevent a large first periodogram ordinate \nfrom distorting the scale of the plot."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"ALTW","ProcedureOptionHelp":{"#cdata":"Specifies that the quadrature spectrum estimate is computed at the boundaries in the same \nway as the spectral density estimate and the cospectrum estimate are computed."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"COEF","ProcedureOptionHelp":{"#cdata":"Outputs the Fourier cosine and sine coefficients of each series."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"CROSS","ProcedureOptionHelp":{"#cdata":"Is used with the P and S options to output cross-periodograms and cross-spectral densities \nwhen more than one variable is listed in the VAR statement."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nNames the SAS data set that contains the input data. If the DATA= option is omitted, the most \nrecently created SAS data set is used."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"K","ProcedureOptionHelp":{"#cdata":"Outputs the squared coherency variables (K_nn _mm ) of the cross-spectrum. The K_nn _mm variables \nare identically 1 unless weights are given in the WEIGHTS statement and the S option is specified."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"OUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUT=SAS-data-set] \n      \nNames the output data set created by PROC SPECTRA to store the results. If the OUT= option \nis omitted, the output data set is named by using the DATAn convention."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"P","ProcedureOptionHelp":{"#cdata":"Outputs the periodogram variables. The variables are named P_nn, where nn is an index of the \noriginal variable with which the periodogram variable is associated. When both the P and CROSS \noptions are specified, the cross-periodogram variables RP_nn_mm and IP_nn_mm are also output."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"PH","ProcedureOptionHelp":{"#cdata":"Outputs the phase variables (PH_nn _mm) of the cross-spectrum."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"S","ProcedureOptionHelp":{"#cdata":"Outputs the spectral density estimates. The variables are named S_nn, where nn is an index \nof the original variable with which the estimate variable is associated. When both the S \nand CROSS options are specified, the cross-spectral variables CS_nn _mm and QS_nn _mm are \nalso output."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"WHITETEST","ProcedureOptionHelp":{"#cdata":"Prints two tests of the hypothesis that the data are white noise."},"ProcedureOptionType":"S"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY variables ; \n\nA BY statement can be used with PROC SPECTRA to obtain separate analyses for groups of \nobservations defined by the BY variables."},"StatementOptions":null},{"StatementName":"VAR|VARS","StatementHelp":{"#cdata":"Syntax: VAR variables ; \n\nThe VAR statement specifies one or more numeric variables that contain the time series \nto analyze. The order of the variables in the VAR statement list determines the index, \nnn, used to name the output variables. The VAR statement is required."},"StatementOptions":null},{"StatementName":"WEIGHTS|WEIGHT","StatementHelp":{"#cdata":"Syntax: WEIGHTS weight-constants | kernel-specification ; \n\nThe WEIGHTS statement specifies the relative weights used in the moving average applied to the \nperiodogram ordinates to form the spectral density estimates. A WEIGHTS statement must be used \nto produce smoothed spectral density estimates. You can specify the relative weights in two ways: \nyou can specify them explicitly, for example\n\n  weights 1 2 3 2 1;\n\nor you can specify them implicitly by using the kernel specification. You can specify five  \ndifferent kernels in the WEIGHTS statement. The syntax for the statement is\n\n  WEIGHTS [PARZEN][BART][TUKEY][TRUNCAT][QS] [c e] ; \n\nwhere c ≥ 0 and e ≥ 0 are used to compute the bandwidth parameter as l(q)=cq^e \n\nand q is the number of periodogram ordinates + 1: \n\n     q=floor(n/2)+1\n\nIf the WEIGHTS statement is not used, only the periodogram is produced."},"StatementOptions":null}]}}}