{"Procedure":{"Name":"STDRATE","ProductGroup":"SAS/STAT","ProcedureHelp":{"#cdata":"Syntax: PROC STDRATE <options> ; \n    BY variables ; \n    POPULATION options ; \n    REFERENCE options ; \n    STRATA variables   </ option> ;\n\n[New procedure in SAS/STAT 12.1]\n\nThe STDRATE procedure computes directly standardized rates and risks for study populations. For two \nstudy populations with the same reference population, PROC STDRATE compares directly standardized \nrates or risks from these two populations. For homogeneous effects across strata, PROC STDRATE computes \nMantel-Haenszel estimates. The STDRATE procedure also computes indirectly standardized rates and \nrisks, including SMR. \n\nThe attributable fraction measures the excess event rate or risk fraction in the exposed population \nthat can be attributed to the exposure. The rate or risk ratio statistic is required in the attributable \nfraction computation, and the STDRATE procedure estimates the ratio by using either SMR or the rate ratio \nstatistic in the Mantel-Haenszel estimates. \n\nAlthough the STDRATE procedure provides useful summary standardized statistics, standardization is not \na substitute for individual comparisons of stratum-specific estimates. PROC STDRATE provides summary \nstatistics, such as rate and risk estimates and their confidence limits, in each stratum. In addition, \nPROC STDRATE also displays these stratum-specific statistics by using ODS Graphics. \n\nNote that the term standardization has different meanings in other statistical applications. For example, \nthe STDIZE procedure standardizes numeric variables in a SAS data set by subtracting a location measure \nand dividing by a scale measure."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"ALPHA=","ProcedureOptionHelp":{"#cdata":"Syntax: ALPHA=α \n      \nRequests that confidence limits be constructed with confidence level 100(1-α)%, where 0 < α < 1. \nThe default is ALPHA=0.05. These confidence limits include confidence limits for the stratum-specific \nrates or risks, standardized rate and risk, standardized morbidity/mortality ratio, and population \nattributable rate and risk."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"CL=","ProcedureOptionHelp":{"#cdata":"Syntax: CL=GAMMA <(TYPE=AVERAGE | CONSERVATIVE)> | LOGNORMAL | NONE | NORMAL | POISSON \n\nSpecifies the method to construct confidence limits for SMR and standardized rate and risk. \n\nThe default is CL=NORMAL."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"GAMMA","@Value2":"LOGNORMAL","@Value3":"NONE","@Value4":"NORMAL","@Value5":"POISSON"},"ProcedureOptionToolTips":{"@ToolTip1":"Syntax: GAMMA <(TYPE=AVERAGE | CONSERVATIVE)>          Requests confidence limits based on a gamma distribution for METHOD=DIRECT and METHOD=MH. This value  applies only when STAT=RATE. You can specify the TYPE=CONSERVATIVE suboption to request conservative  confidence limits that are based on a gamma distribution and were developed by Fay and Feuer (1997),  or you can specify the TYPE=AVERAGE suboption to request modified confidence limits proposed by  Tiwari, Clegg, and Zou (2006).","@ToolTip2":"Requests confidence limits based on a lognormal distribution.","@ToolTip3":"Suppresses construction of confidence limits.","@ToolTip4":"Requests confidence limits based on a normal distribution.","@ToolTip5":"Requests confidence limits based on a Poisson distribution. This value applies only when  METHOD=INDIRECT."},"SubOptionsKeywords":"TYPE="},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"Syntax: DATA=SAS-data-set \n      \nNames the required SAS data set that contains the event information in the study populations."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"EFFECT=","ProcedureOptionHelp":{"#cdata":"Syntax: EFFECT <=DIFF | RATIO> \n      \nDisplays a table of the effect estimate and associated confidence limits. This option applies only \nwhen METHOD=DIRECT with two study populations and when METHOD=MH, where two study populations are \nrequired. \n\nEFFECT and EFFECT=RATIO display a test on the ratio effect of estimates between the study populations, \nand the EFFECT=DIFF option displays a test on the difference effect."},"ProcedureOptionType":"S|V","ProcedureOptionValues":{"@Value1":"DIFF","@Value2":"RATIO"},"ProcedureOptionToolTips":{"@ToolTip1":"Displays a test on the difference effect","@ToolTip2":"Displays a test on the ratio effect of estimates between the study populations."}},{"ProcedureOptionName":"METHOD=|M=","ProcedureOptionHelp":{"#cdata":"Syntax: METHOD= DIRECT | INDIRECT <(AF)> | MH <(AF)> \n  M= DIRECT | INDIRECT <(AF)> | MH <(AF)> \n  \nSpecifies the required method for standardization. METHOD=DIRECT requests direct standardization, \nMETHOD=INDIRECT requests indirect standardization, and METHOD=MH requests Mantel-Haenszel estimation. \n\nThe AF suboption requests the attributable fraction that measures the excess event rate or risk \nfraction in the exposed population that is attributable to the exposure. This suboption also \nrequests the population attributable fraction that measures the excess event rate or risk fraction \nin the total population that is attributable to the exposure."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"DIRECT","@Value2":"INDIRECT","@Value3":"MH"},"ProcedureOptionToolTips":{"@ToolTip1":"Requests direct standardization","@ToolTip2":"Syntax: INDIRECT <(AF)>  Requests indirect standardization.   The AF suboption requests the attributable fraction that measures the excess event rate or risk  fraction in the exposed population that is attributable to the exposure. This suboption also  requests the population attributable fraction that measures the excess event rate or risk fraction  in the total population that is attributable to the exposure.","@ToolTip3":"Syntax: MH <(AF)>                                 Requests Mantel-Haenszel estimation.  The AF suboption requests the attributable fraction that measures the excess event rate or risk  fraction in the exposed population that is attributable to the exposure. This suboption also  requests the population attributable fraction that measures the excess event rate or risk fraction  in the total population that is attributable to the exposure."}},{"ProcedureOptionName":"PLOTS=","ProcedureOptionHelp":{"#cdata":"Syntax: PLOTS <( global-options )> <= plot-request> \nPLOTS <( global-options )> <= ( plot-request < …plot-request> ) > \n\nSpecifies options that control the details of the plots. The default is PLOTS=RATE for STAT=RATE \nand PLOTS=RISK for STAT=RISK. \n\nYou can specify the following global-options: \n\n  DISPLAY=INDEX | LEVEL \n    specifies tick mark values for the strata axis. DISPLAY=LEVEL displays strata levels on the \n    strata axis, and DISPLAY=INDEX displays strata indices of sequential strata identification \n    numbers on the strata axis. The default is DISPLAY=LEVEL. \n  \n  ONLY \n    suppresses the default plots and displays only plots that are specifically requested. \n  \n  STRATUM=HORIZONTAL | VERTICAL \n    controls the orientation of the plots. STRATUM=VERTICAL places the strata information on the \n    vertical axis, and STRATUM=HORIZONTAL places the strata information on the horizontal axis. \n    The default is STRATUM=VERTICAL."},"ProcedureOptionType":"S|V","ProcedureOptionValues":{"@Value1":"ALL","@Value2":"DIST|DISTRIBUTION","@Value3":"EFFECT","@Value4":"NONE","@Value5":"RATE","@Value6":"RISK","@Value7":"SMR"},"ProcedureOptionToolTips":{"@ToolTip1":"Produces all appropriate plots.","@ToolTip2":"Displays a plot of the proportions for stratum-specific exposed time or sample size.","@ToolTip3":"Displays a plot of the stratum-specific effect estimates and associated confidence limits.  This option applies only when METHOD=DIRECT with two study populations and when METHOD=MH,  where two study populations are required. If the EFFECT=DIFF option is specified, the  stratum-specific rate or risk difference effects are displayed. Otherwise, the stratum- specific rate or risk ratio effects are displayed.","@ToolTip4":"Suppresses all plots. ","@ToolTip5":"Displays a plot of the stratum-specific rates and associated confidence limits. This option  applies only when STAT=RATE. If a confidence limits method is specified in the STATS(CL=)  option in the STRATA statement, that method is used to compute the confidence limits.  Otherwise, the normal approximation is used.","@ToolTip6":"Displays a plot of the stratum-specific rates and associated confidence limits. This option  applies only when STAT=RISK. If a confidence limits method is specified in the STATS(CL=)  option in the STRATA statement, that method is used to compute the confidence limits.  Otherwise, the normal approximation is used.","@ToolTip7":"Displays a plot of the stratum-specific SMR estimates and associated confidence limits. This  option applies only when METHOD=INDIRECT. If a method is specified in the SMR(CL=) option  in the STRATA statement, that method is used to compute the confidence limits. Otherwise,  the normal approximation is used."},"SubOptionsKeywords":"DISPLAY=|ONLY|STRATUM="},{"ProcedureOptionName":"SIDES=|SIDED=|SIDE=","ProcedureOptionHelp":{"#cdata":"Specifies the number of sides (or tails) and direction of the statistical tests and test-based confidence intervals."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"2","@Value2":"L","@Value3":"U"},"ProcedureOptionToolTips":{"@ToolTip1":"(The default) specifies two-sided tests and confidence intervals for means.","@ToolTip2":"Specifies lower one-sided tests, in which the alternative hypothesis indicates a mean less than the  null value, and lower one-sided confidence intervals between minus infinity and the upper confidence  limit.","@ToolTip3":"Specifies upper one-sided tests, in which the alternative hypothesis indicates a mean greater than  the null value, and upper one-sided confidence intervals between the lower confidence limit and  infinity."}},{"ProcedureOptionName":"REFDATA=","ProcedureOptionHelp":{"#cdata":"Syntax: REFDATA=SAS-data-set \n      \nNames the required SAS data set that contains the event information in the reference population."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"STAT=","ProcedureOptionHelp":{"#cdata":"Syntax: STAT=RATE <( MULT =c )> | STAT=RISK \n\nSpecifies the statistic for standardization. \n\nThe default is STAT=RATE."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"RATE","@Value2":"RISK"},"ProcedureOptionToolTips":{"@ToolTip1":"Syntax: RATE <( MULT=c )>           Computes standardized rates.   The MULT= suboption in the STAT=RATE option specifies a power of 10 constant c, and requests that  rates per c population-time units be displayed in the output tables and graphics. The default is  MULT=100000, which specifies rates per 100,000 population-time units.","@ToolTip2":"Computes standardized risks."},"SubOptionsKeywords":"MULT="}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nYou can specify a BY statement with PROC STDRATE to obtain separate analyses on \nobservations in groups defined by the BY variables. When a BY statement appears, \nthe procedure expects the input data set to be sorted in the order of the BY \nvariables. The variables are one or more variables in the input data set."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"The NOTSORTED option does not mean that the data are unsorted but rather that the data are \narranged in groups (according to values of the BY variables) and that these groups are not \nnecessarily in alphabetical or increasing numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"POPULATION","StatementHelp":{"#cdata":"Syntax: POPULATION <options> ; \n\nThe required POPULATION statement specifies the information in the study data set."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"EVENT=","StatementOptionHelp":{"#cdata":"Syntax: EVENT=variable \n          \nSpecifies the variable for the number of events in the study data set."},"StatementOptionType":"V"},{"StatementOptionName":"GROUP=","StatementOptionHelp":{"#cdata":"Syntax: GROUP <( ORDER=DATA | FORMATTED | INTERNAL )> =variable\n          \nSpecifies the variable whose values identify the various populations. This option is required when \nMETHOD=MH and also applies when METHOD=DIRECT in the PROC STDRATE statement. \n\nThe optional ORDER= suboption specifies the order in which the values of the variable are to be \ndisplayed. You can specify the following values for the ORDER= suboption: \n\n  DATA\n    sorts by the order in which the values appear in the input data set. \n  FORMATTED\n    sorts by their external formatted values. \n  INTERNAL\n    sorts by the unformatted values, which yields the same order that the SORT procedure does. \n\nBy default, ORDER=INTERNAL. For ORDER=FORMATTED and ORDER=INTERNAL, the sort order is machine-dependent."},"StatementOptionType":"S|V","SubOptionsKeywords":"ORDER="},{"StatementOptionName":"POPEVENT=","StatementOptionHelp":{"#cdata":"Syntax: POPEVENT=number \n          \nSpecifies the total number of events in the study data set. This option applies only when \nMETHOD=INDIRECT is specified in the PROC STDRATE statement and the total number of events \nis not available in the study data set."},"StatementOptionType":"V"},{"StatementOptionName":"RATE=","StatementOptionHelp":{"#cdata":"Syntax: RATE <( MULT=c )> = variable \n          \nSpecifies the variable for the observed rate in the study data set. This option applies only \nwhen STAT=RATE is specified in the PROC STDRATE statement. The MULT=c suboption specifies a \npower of 10 constant c and requests that the rates per c population-time units be read from \nthe data set. The default is the value of the MULT= suboption used in the STAT=RATE option \nin the PROC STDRATE statement."},"StatementOptionType":"S|V","SubOptionsKeywords":"MULT="},{"StatementOptionName":"RISK=","StatementOptionHelp":{"#cdata":"Syntax: RISK=variable \n          \nSpecifies the variable for the observed risk in the study data set. This option applies only \nwhen STAT=RISK is specified in the PROC STDRATE statement."},"StatementOptionType":"V"},{"StatementOptionName":"TOTAL=","StatementOptionHelp":{"#cdata":"Syntax: TOTAL=variable \n          \nSpecifies the variable for either the population-time (STAT=RATE) or the number of observations \n(STAT=RISK) in the study data set."},"StatementOptionType":"V"}]}},{"StatementName":"REFERENCE","StatementHelp":{"#cdata":"Syntax: REFERENCE <options> ; \n\nThe REFERENCE statement specifies the information in the reference data set. This statement \nis required when METHOD=DIRECT or METHOD=INDIRECT is specified in the PROC STDRATE statement. \n\nWhen METHOD=INDIRECT is specified in the PROC STDRATE statement, the overall reference population \nrate and risk are needed to compute indirect standardized rate and risk, respectively. If the \ninformation is not available in the reference data set, you can specify the following options for \noverall reference population rate and risk:\n  \n  REFEVENT=number\n    specifies the total number of events in the reference data set. \n  REFRATE <( MULT=c )> = number\n    specifies the crude rate in the reference data set. This option applies only when STAT=RATE \n    is specified in the PROC STDRATE statement. The MULT=c suboption specifies a power of 10 \n    constant c, and the number is the crude rate per c population-time units in the data set. \n    The default is the value of the MULT= suboption in the STAT=RATE option in the PROC STDRATE \n    statement. \n  REFRISK=number\n    specifies the crude risk in the reference data set. This option applies only when STAT=RISK \n    is specified in the PROC STDRATE statement. \n  REFTOTAL=number\n    specifies either the total population-time (STAT=RATE) or the total number of observations \n    (STAT=RISK) in the reference data set."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"EVENT=","StatementOptionHelp":{"#cdata":"Syntax: EVENT=variable \n          \nSpecifies the variable for the number of events in the reference data set."},"StatementOptionType":"V"},{"StatementOptionName":"RATE=","StatementOptionHelp":{"#cdata":"Syntax: RATE <( MULT=c )> = variable \n          \nSpecifies the variable for the observed rate in the reference data set. This option applies only \nwhen STAT=RATE is specified in the PROC STDRATE statement. The MULT=c suboption specifies a \npower of 10 constant c and requests that the rates per c population-time units be read from \nthe data set. The default is the value of the MULT= suboption used in the STAT=RATE option \nin the PROC STDRATE statement."},"StatementOptionType":"S|V","SubOptionsKeywords":"MULT="},{"StatementOptionName":"RISK=","StatementOptionHelp":{"#cdata":"Syntax: RISK=variable \n          \nSpecifies the variable for the observed risk in the reference data set. This option applies only \nwhen STAT=RISK is specified in the PROC STDRATE statement."},"StatementOptionType":"V"},{"StatementOptionName":"TOTAL=","StatementOptionHelp":{"#cdata":"Syntax: TOTAL=variable \n          \nSpecifies the variable for either the population-time (STAT=RATE) or the number of observations \n(STAT=RISK) in the reference data set."},"StatementOptionType":"V"},{"StatementOptionName":"REFEVENT=","StatementOptionHelp":{"#cdata":"Syntax: REFEVENT=variable \n          \nSpecifies the total number of events in the reference data set."},"StatementOptionType":"V"},{"StatementOptionName":"REFRATE=","StatementOptionHelp":{"#cdata":"Syntax: REFRATE <( MULT=c )> = variable \n          \nSpecifies the crude rate in the reference data set. This option applies only when STAT=RATE \nis specified in the PROC STDRATE statement. The MULT=c suboption specifies a power of 10 \nconstant c and requests that the rates per c population-time units be read from the data \nset. The default is the value of the MULT= suboption used in the STAT=RATE option in the \nPROC STDRATE statement."},"StatementOptionType":"S|V","SubOptionsKeywords":"MULT="},{"StatementOptionName":"REFRISK=","StatementOptionHelp":{"#cdata":"Syntax: REFRISK=variable \n          \nSpecifies the crude risk in the reference data set. This option applies only \nwhen STAT=RISK is specified in the PROC STDRATE statement."},"StatementOptionType":"V"},{"StatementOptionName":"REFTOTAL=","StatementOptionHelp":{"#cdata":"Syntax: REFTOTAL=variable \n          \nSpecifies either the total population-time (STAT=RATE) or the total number of observations \n(STAT=RISK) in the reference data set."},"StatementOptionType":"V"}]}},{"StatementName":"STRATA","StatementHelp":{"#cdata":"Syntax: STRATA variables </ options> ; \n\nThe STRATA statement names variables that form the strata in the standardization. The combinations \nof categories of STRATA variables define the strata in the population. \n\nThe STRATA variables are one or more variables in all input data sets. These variables can be either \ncharacter or numeric. The formatted values of the STRATA variables determine the levels. Thus, you can \nuse formats to group values into levels.  \n\nWhen the STRATA statement is not specified or the statement is specified without variables, all \nobservations in a data set are treated as though they are from a single stratum."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"EFFECT","StatementOptionHelp":{"#cdata":"Displays a table of the stratum-specific effect estimates and associated confidence limits. \nThis option applies only when METHOD=DIRECT with two study populations and when METHOD=MH, \nwhere two study populations are required. If the EFFECT=DIFF option in the PROC STDRATE \nstatement is specified, the stratum-specific rate or risk difference effects are displayed. \nOtherwise, the stratum-specific rate or risk ratio effects are displayed."},"StatementOptionType":"S"},{"StatementOptionName":"MISSING","StatementOptionHelp":{"#cdata":"Treats missing values as a valid (nonmissing) category for all STRATA variables. When \nPROC STDRATE determines levels of a STRATA variable, an observation with missing values \nfor that STRATA variable is excluded, unless the MISSING option is specified."},"StatementOptionType":"S"},{"StatementOptionName":"ORDER=","StatementOptionHelp":{"#cdata":"Syntax ORDER=DATA | FORMATTED | INTERNAL\n          \nSpecifies the order in which the values of the categorical variables are to be displayed. \n\nBy default, ORDER=INTERNAL. For ORDER=FORMATTED and ORDER=INTERNAL, the sort order is machine-dependent."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"DATA","@Value2":"FORMATTED","@Value3":"INTERNAL"},"StatementOptionToolTips":{"@ToolTip1":"Sorts by the order in which the values appear in the input data set.","@ToolTip2":"Sorts by their external formatted values.","@ToolTip3":"Sorts by the unformatted values, which yields the same order that the SORT procedure does."}},{"StatementOptionName":"STATS","StatementOptionHelp":{"#cdata":"Syntax: STATS <( CL=LOGNORMAL | NONE | NORMAL | POISSON )> \n          \nDisplays tables for stratum-specific statistics such as stratum-specific rates and risks. You can \nspecify the following values of the CL= suboption to request confidence limits for the rate or risk \nestimate in each stratum: \n\n  LOGNORMAL \n    requests confidence limits based on a lognormal approximation. \n  NONE \n    suppresses confidence limits. \n  NORMAL \n    requests confidence limits based on a normal approximation and also displays the standard error \n    for the rate estimate in each stratum. \n  POISSON \n    requests confidence limits based on a Poisson distribution for stratum-specific rates. This values \n    applies only when STAT=RATE in the PROC STDRATE statement. \n\nThe default is CL=NORMAL."},"StatementOptionType":"S","SubOptionsKeywords":"CL="},{"StatementOptionName":"SMR","StatementOptionHelp":{"#cdata":"Syntax: SMR <( CL=LOGNORMAL | NONE | NORMAL | POISSON )> \n          \nDisplays tables for stratum-specific SMR estimates. This option applies only when METHOD=INDIRECT \nis specified in the PROC STDRATE statement. You can specify the following values of the CL= suboption \nto request confidence limits for the SMR estimate in each stratum: \n\n  LOGNORMAL \n    requests confidence limits based on a lognormal approximation. \n  NONE \n    suppresses confidence limits. \n  NORMAL \n    requests confidence limits based on a normal approximation and also displays the standard error \n    for the rate estimate in each stratum. \n  POISSON \n    requests confidence limits based on a Poisson distribution for stratum-specific rates. This values \n    applies only when STAT=RATE in the PROC STDRATE statement. \n\nThe default is CL=NORMAL."},"StatementOptionType":"S","SubOptionsKeywords":"CL="}]}}]}}}