{"Procedure":{"Name":"SURVEYSELECT","#comment":{},"ProductGroup":"SAS/STAT","ProcedureHelp":{"#cdata":"Syntax: PROC SURVEYSELECT options ;\n    CONTROL variables ;\n    FREQ variable ;\n    ID variables ;\n    SAMPLINGUNIT | CLUSTER variables < / options > ;\n    SIZE variable ;\n    STRATA variables < / options > ;\n\nThe SURVEYSELECT procedure provides a variety of methods for selecting probability-based \nrandom samples. The procedure can select a simple random sample or can sample according to \na complex multistage sample design that includes stratification, clustering, and unequal \nprobabilities of selection. With probability sampling, each unit in the survey population \nhas a known, positive probability of selection. This property of probability sampling avoids \nselection bias and enables you to use statistical theory to make valid inferences from the \nsample to the survey population. \n\nPROC SURVEYSELECT provides the following equal probability sampling methods: \n  o simple random sampling (without replacement) \n  o unrestricted random sampling (with replacement) \n  o systematic random sampling \n  o sequential random sampling \n  o Bernoulli sampling\n\nThis procedure also provides the following probability proportional to size (PPS) methods: \n  o PPS sampling without replacement \n  o PPS sampling with replacement \n  o PPS systematic sampling \n  o PPS algorithms for selecting two units per stratum \n  o sequential PPS sampling with minimum replacement"},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"CERTSIZE","ProcedureOptionHelp":{"#cdata":"Requests certainty selection, where the certainty size values are provided in the secondary \ninput data set."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"CERTSIZE=","ProcedureOptionHelp":{"#cdata":"[Syntax: CERTSIZE=certain | CERTSIZE=SAS-data-set | CERTSIZE=P] \n      \nSpecifies the certainty size value, or names a SAS data set that contains certainty size values for \nthe strata; or specifies the certainty proportion p."},"ProcedureOptionType":"S|V"},{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n\nNames the SAS data set from which PROC SURVEYSELECT selects the sample."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"JTPROBS","ProcedureOptionHelp":{"#cdata":"Includes joint probabilities of selection in the OUT= output data set."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"MAXSIZE","ProcedureOptionHelp":{"#cdata":"Requests adjustment of size measures according to the stratum maximum size values provided in the \nsecondary input data set."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"MAXSIZE=","ProcedureOptionHelp":{"#cdata":"[Syntax: MAXSIZE=max | MAXSIZE=SAS-data-set] \n      \nSpecifies the maximum size value, or names a SAS data set that contains the maximum size values \nfor the strata."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"METHOD=|M=","ProcedureOptionHelp":{"#cdata":"Specifies the method for sample selection."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"PPS","@Value2":"PPS_BREWER","@Value3":"PPS_MURTHY","@Value4":"PPS_SAMPFORD","@Value5":"PPS_SEQ","@Value6":"PPS_SYS","@Value7":"PPS_WR","@Value8":"SEQ","@Value9":"SRS","@Value10":"SYS","@Value11":"URS"},"ProcedureOptionToolTips":{"@ToolTip1":"Requests selection with probability proportional to size and without replacement.","@ToolTip2":"Requests selection according to Brewer’s method.","@ToolTip3":"Requests selection according to Murthy’s method.","@ToolTip4":"Requests selection according to Sampford’s method.","@ToolTip5":"Requests sequential selection with probability proportional to size and with minimum  replacement.","@ToolTip6":"Requests systematic selection with probability proportional to size.","@ToolTip7":"Requests selection with probability proportional to size and with replacement.","@ToolTip8":"Requests sequential selection according to Chromy’s method.","@ToolTip9":"Requests simple random sampling, which is selection with equal probability and without  replacement.","@ToolTip10":"Requests systematic random sampling.","@ToolTip11":"Requests unrestricted random sampling, which is selection with equal probability and  with replacement."}},{"ProcedureOptionName":"MINSIZE","ProcedureOptionHelp":{"#cdata":"Requests adjustment of size measures according to the stratum minimum size values provided in the \nsecondary input data set."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"MINSIZE=","ProcedureOptionHelp":{"#cdata":"[Syntax: MINSIZE=min | MINSIZE=SAS-data-set] \n      \nSpecifies the minimum size value, or names a SAS data set that contains the minimum size values \nfor the strata."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"NMAX=","ProcedureOptionHelp":{"#cdata":"[Syntax: NMAX=n] \n      \nSpecifies the maximum stratum sample size n for the SAMPRATE= option."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NMIN=","ProcedureOptionHelp":{"#cdata":"[Syntax: NMIN=n] \n      \nSpecifies the minimum stratum sample size n for the SAMPRATE= option. When you specify \nthe SAMPRATE= option, PROC SURVEYSELECT calculates the stratum sample size by multiplying \nthe total number of units in the stratum by the specified sampling rate. If this sample \nsize is less than the value NMIN=n, then PROC SURVEYSELECT selects n units. \n\nThe minimum sample size n must be a positive integer. The NMIN= option is available only \nwith the SAMPRATE= option, which can be used with equal probability selection methods \n(METHOD=SRS, METHOD=URS, METHOD=SYS, and METHOD=SEQ)."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NOPRINT","ProcedureOptionHelp":{"#cdata":"Suppresses the display of all output."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"OUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUT=SAS-data-set] \n      \nNames the output data set that contains the sample."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"OUTALL","ProcedureOptionHelp":{"#cdata":"Includes all observations from the input data set in the output data set."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"OUTHITS","ProcedureOptionHelp":{"#cdata":"Includes a separate observation in the output data set for each selection when the same unit is \nselected more than once."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"OUTSEED","ProcedureOptionHelp":{"#cdata":"Includes the initial seed for each stratum in the output data set."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"OUTSIZE","ProcedureOptionHelp":{"#cdata":"Includes additional design and sampling frame parameters in the output data set."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"OUTSORT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUTSORT=SAS-data-set] \n      \nNames an output data set that contains the sorted input data set."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"REPS=","ProcedureOptionHelp":{"#cdata":"[Syntax: REPS=nreps] \n      \nSpecifies the number of sample replicates. The value of nreps must be a positive integer."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SAMPRATE=|RATE=","ProcedureOptionHelp":{"#cdata":"Syntax: SAMPRATE=r | SAMPRATE=(values) | SAMPRATE=SAS-data-set\n      \nSpecifies the sampling rate, or stratum sampling rates (separated with blanks or commas), or\nnames a SAS data set that contains stratum sampling rates."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SAMPSIZE=|N=","ProcedureOptionHelp":{"#cdata":"Syntax: SAMPSIZE=n | SAMPSIZE=(values) | SAMPSIZE=SAS-data-set\n      \nSpecifies the sample size, or sample sizes for the strata (separated with blanks or commas), or\nnames a SAS data set that contains the sample sizes for the strata."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SEED=","ProcedureOptionHelp":{"#cdata":"Syntax: SEED=number  | SEED=SAS-data-set\n      \nSpecifies the initial seed for random number generation, or names a SAS data set that contains \ninitial seeds for the strata."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SELECTALL","ProcedureOptionHelp":{"#cdata":"Requests that PROC SURVEYSELECT select all stratum units when the stratum sample size exceeds the \ntotal number of units in the stratum."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"SORT=","ProcedureOptionHelp":{"#cdata":"Specifies the type of sorting by CONTROL variables."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"NEST","@Value2":"SERP"},"ProcedureOptionToolTips":{"@ToolTip1":"Requests nested sorting.","@ToolTip2":"Requests hierarchic serpentine sorting."}},{"ProcedureOptionName":"STATS","ProcedureOptionHelp":{"#cdata":"Includes selection probabilities and sampling weights in the OUT= output data set for equal probability\nselection methods when you do not specify a STRATA statement."},"ProcedureOptionType":"V"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"STRATA|STRATUM","StatementHelp":{"#cdata":"Syntax: STRATA variables </ options> ; \n\nYou can specify a STRATA statement to partition the input data set into nonoverlapping groups \ndefined by the STRATA variables."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ALLOC=|ALLOCATE=","StatementOptionHelp":{"#cdata":"Specifies the method for allocating the total sample size among the strata."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"PROPORTIONAL","@Value2":"OPTIMAL","@Value3":"NEYMAN","@Value4":"(<values>)","@Value5":"<SAS-data-set>"},"StatementOptionToolTips":{"@ToolTip1":"Requests proportional allocation, which allocates the total sample size in proportion to the stratum  sizes, where the stratum size is the number of sampling units in the stratum.","@ToolTip2":"Requests optimal allocation, which allocates the total sample size among the strata in proportion to  stratum sizes, stratum variances, and stratum costs.","@ToolTip3":"Requests Neyman allocation, which allocates the total sample size among the strata in proportion to  the stratum sizes and variances.","@ToolTip4":"Lists stratum allocation proportions. You can separate values with blanks or commas.","@ToolTip5":"Names a SAS data set that contains stratum allocation proportions."}},{"StatementOptionName":"COST","StatementOptionHelp":{"#cdata":"Indicates that stratum costs are included in the secondary input data set."},"StatementOptionType":"S"},{"StatementOptionName":"COST=|COSTS=","StatementOptionHelp":{"#cdata":"[Syntax: COST=(values) | SAS-data-set] \n\nCOST=(values)         \nSpecifies stratum costs, which are required if you specify the ALLOC=OPTIMAL option. You can \nseparate values with blanks or commas. \n\nCOST=SAS-data-set \nNames a SAS data set that contains the stratum costs. You provide the stratum costs in the COST= \ndata set variable _COST_."},"StatementOptionType":"V"},{"StatementOptionName":"NOSAMPLE|NOSAMP","StatementOptionHelp":{"#cdata":"Requests that SURVEYSELECT allocate the total sample size among the strata but not select the sample."},"StatementOptionType":"S"},{"StatementOptionName":"VAR","StatementOptionHelp":{"#cdata":"Indicates that stratum variances are included in the secondary input data set."},"StatementOptionType":"S"},{"StatementOptionName":"VAR=","StatementOptionHelp":{"#cdata":"[Syntax: VAR=(values) | SAS-data-set] \n\nVAR=(values)          \nLists stratum variances, which are required if you specify ALLOC=OPTIMAL or ALLOC=NEYMAN. You can \nseparate values with blanks or commas. \n\nVAR=SAS-data-set \nNames a SAS data set that contains the stratum variances."},"StatementOptionType":"V"}]}},{"StatementName":"SAMPLINGUNIT|CLUSTER","StatementHelp":{"#cdata":"Syntax: SAMPLINGUNIT | CLUSTER variables < / options > ; \n      \nThe SAMPLINGUNIT statement names variables that identify the sampling units as groups \nof observations (clusters). The combinations of categories of SAMPLINGUNIT variables \ndefine the sampling units. If there is a STRATA statement, sampling units are nested \nwithin strata. \n\nWhen you use a SAMPLINGUNIT statement to define units (clusters), PROC SURVEYSELECT \nselects a sample of these units by using the selection method and design parameters \nthat you specify in the PROC SURVEYSELECT statement. If you do not use a SAMPLINGUNIT \nstatement, then PROC SURVEYSELECT uses the input data set observations as sampling \nunits by default. \n\nThe SAMPLINGUNIT variables are one or more variables in the DATA= input data set. \nThese variables can be either character or numeric. The formatted values of the \nSAMPLINGUNIT variables determine the SAMPLINGUNIT variable levels. Thus, you can \nuse formats to group values into levels."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"PRESORTED","StatementOptionHelp":{"#cdata":"Requests that PROC SURVEYSELECT not sort the input data set by the SAMPLINGUNIT \nvariables within strata. By default, the procedure sorts the input data set by \nthe SAMPLINGUNIT variables, which groups the observations into sampling units \nand orders the units by the SAMPLINGUNIT variables."},"StatementOptionType":"S"},{"StatementOptionName":"PPS","StatementOptionHelp":{"#cdata":"Computes a sampling unit’s size measure as the number of observations in the sampling \nunit. The procedure then uses these size measures to select a sample according to the \nPPS selection method that you specify with the METHOD= option in the PROC SURVEYSELECT \nstatement. \n\nThis option has no effect when you specify a SIZE statement. When you specify a SIZE \nstatement, the procedure computes sampling unit size by summing the size measures of \nall observations that belong to the sampling unit."},"StatementOptionType":"S"}]}},{"StatementName":"CONTROL","StatementHelp":{"#cdata":"Syntax: CONTROL variables ; \n      \nThe CONTROL statement names variables for sorting the input data set before sample selection. The\nCONTROL variables can be character or numeric. If you also specify a STRATA statement, PROC\nSURVEYSELECT sorts by CONTROL variables within strata."},"StatementOptions":null},{"StatementName":"FREQ","StatementHelp":{"#cdata":"Syntax: FREQ variable ;\n      \nThe FREQ statement names a numeric variable that contains the frequency of occurrence of each observation.\nIf you use a FREQ statement, PROC SURVEYSELECT assumes that an observation represents n observations,\nwhere n is the value of the FREQ variable for the observation. The FREQ statement is not available when\nyou specify a SAMPLINGUNIT statement."},"StatementOptions":null},{"StatementName":"SIZE","StatementHelp":{"#cdata":"Syntax: SIZE variable ;\n      \nThe SIZE statement names one and only one size measure variable, which contains the sampling unit \nsize measures that are used for selection with probability proportional to size."},"StatementOptions":null},{"StatementName":"ID","StatementHelp":{"#cdata":"Syntax: ID variables ;\n      \nThe ID statement names one or more variables from the DATA= input data set to \ninclude in the OUT= output data set of selected units. If there is no ID statement, \nPROC SURVEYSELECT includes all variables from the input data set in the output data \nset. The ID variables can be either character or numeric."},"StatementOptions":null}]}}}