{"Procedure":{"Name":"SURVEYFREQ","#comment":{},"ProductGroup":"SAS/STAT","ProcedureHelp":{"#cdata":"Syntax: PROC SURVEYFREQ <options> ; \n    BY variables ; \n    CLUSTER variables ; \n    REPWEIGHTS variables </ options> ; \n    STRATA variables </ option> ; \n    TABLES requests </ options> ; \n    WEIGHT variable ; \n\nThe SURVEYFREQ procedure produces one-way to n-way frequency and crosstabulation tables \nfrom sample survey data. These tables include estimates of population totals, population \nproportions, and their standard errors. Confidence limits, coefficients of variation, and \ndesign effects are also available. The procedure provides a variety of options to customize \nthe table display. \n\nFor one-way frequency tables, PROC SURVEYFREQ provides Rao-Scott chi-square goodness-of-fit \ntests, which are adjusted for the sample design. You can test a null hypothesis of equal \nproportions for a one-way frequency table, or you can input custom null hypothesis proportions \nfor the test. For two-way tables, PROC SURVEYFREQ provides design-adjusted tests of independence, \nor no association, between the row and column variables. These tests include the Rao-Scott \nchi-square test, the Rao-Scott likelihood ratio test, the Wald chi-square test, and the Wald \nlog-linear chi-square test. For 2x2 tables, PROC SURVEYFREQ computes estimates and confidence \nlimits for risks (row proportions), the risk difference, the odds ratio, and relative risks. \n\nPROC SURVEYFREQ computes variance estimates based on the sample design used to obtain the \nsurvey data. The design can be a complex multistage survey design with stratification, \nclustering, and unequal weighting. PROC SURVEYFREQ provides a choice of variance estimation \nmethods, which include Taylor series linearization, balanced repeated replication (BRR), and \nthe jackknife."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nNames the SAS data set to be analyzed by PROC SURVEYFREQ."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"MISSING","ProcedureOptionHelp":{"#cdata":"Treats missing values as a valid (nonmissing) category for all categorical variables, \nwhich include TABLES, STRATA, and CLUSTER variables."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOMCAR","ProcedureOptionHelp":{"#cdata":"Includes observations with missing values of TABLES variables in the variance computation \nas not missing completely at random (NOMCAR) for Taylor series variance estimation."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"ORDER=","ProcedureOptionHelp":{"#cdata":"Specifies the order of the variable levels in the frequency and crosstabulation \ntables, which you request in the TABLES statement. The ORDER= option also controls \nthe order of the STRATA variable levels in the Stratum Information table."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"DATA","@Value2":"FORMATTED","@Value3":"FREQ","@Value4":"INTERNAL"},"ProcedureOptionToolTips":{"@ToolTip1":"Levels ordered by the order of appearance in the input data set.","@ToolTip2":"Levels ordered by the external formatted value, except for numeric variables with no explicit format,  which are sorted by their unformatted (internal) value.","@ToolTip3":"Levels ordered by the descending frequency count; levels with the most observations come first in the order.","@ToolTip4":"Levels ordered by the unformatted value."}},{"ProcedureOptionName":"NOSUMMARY","ProcedureOptionHelp":{"#cdata":"Suppresses the display of the \"Data Summary\" table, which PROC SURVEYFREQ produces by default."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"PAGE","ProcedureOptionHelp":{"#cdata":"Displays only one table per page. Otherwise, PROC SURVEYFREQ displays\nmultiple tables per page as space permits."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"RATE=|R=","ProcedureOptionHelp":{"#cdata":"[Syntax: RATE=value | SAS-data-set] \n      \nSpecifies the sampling rate as a nonnegative value, or identifies an input data set that gives the stratum\nsampling rates in a variable named _RATE_."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"TOTAL=|N=","ProcedureOptionHelp":{"#cdata":"[Syntax: TOTAL=value | SAS-data-set] \n      \nSpecifies the total number of primary sampling units (PSUs) in the study population as a positive \nvalue, or identifiesan input data set that gives the stratum population totals in a variable named \n_TOTAL_."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"VARHEADER=","ProcedureOptionHelp":{"#cdata":"Specifies the variable identification to use in the displayed output."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"LABEL","@Value2":"NAME","@Value3":"NAMELABEL"},"ProcedureOptionToolTips":{"@ToolTip1":"Displays the variable label.","@ToolTip2":"Displays the variable name.","@ToolTip3":"Displays both the variable name and label, with the label in parentheses following the name—that is,  Name (Label)."}},{"ProcedureOptionName":"VARMETHOD=","ProcedureOptionHelp":{"#cdata":"Syntax: VARMETHOD=BRR < (method-options) > | JACKKNIFE < (method-options) > | TAYLOR ;\n      \nSpecifies the variance estimation method."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"BRR","@Value2":"JACKKNIFE","@Value3":"TAYLOR"},"ProcedureOptionToolTips":{"@ToolTip1":"[Syntax: BRR<(method-options)>]           Requests variance estimation by balanced repeated replication (BRR).  You can specify the following method-options in parentheses after the VARMETHOD=BRR option.    DFADJ    computes the degrees of freedom as the number of nonmissing strata for the individual    table request.    FAY <=value>   requests Fay’s method, which is a modification of the BRR method.    HADAMARD=SAS-data-set    names a SAS data set that contains the Hadamard matrix for BRR replicate construction.    OUTWEIGHTS=SAS-data-set    names a SAS data set to store the replicate weights that PROC SURVEYFREQ creates for BRR    variance estimation.    PRINTH    displays the Hadamard matrix used to construct replicates for BRR.    REPS=number    specifies the number of replicates for BRR variance estimation. The value of number must be an    integer greater than 1.","@ToolTip2":"[Syntax: JACKKNIFE<(method-options)>]                                  Requests variance estimation by the delete-1 jackknife method. You can specify the following method-options in parentheses after the VARMETHOD=JACKKNIFE option:     DFADJ    computes the degrees of freedom by using the number of nonmissing strata and clusters for the    individual table request.    OUTJKCOEFS=SAS-data-set    names a SAS data set to store the jackknife coefficients.    OUTWEIGHTS=SAS-data-set    names a SAS data set to store the replicate weights that PROC SURVEYFREQ creates for jackknife    variance estimation.","@ToolTip3":"Requests Taylor series variance estimation. This is the default method if you do not specify the VARMETHOD= option or a REPWEIGHTS statement."},"SubOptionsKeywords":"OUTWEIGHTS=|OUTJKCOEFS=|DFADJ|REPS=|PRINTH|OUTWEIGHTS=|HADAMARD=|FAY|DFADJ"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nYou can specify a BY statement with PROC SURVEYFREQ to obtain separate analyses of \nobservations in groups that are defined by the BY variables. \n\nNote that using a BY statement provides completely separate analyses of the BY groups. \nIt does not provide a statistically valid domain (subpopulation) analysis, where the \ntotal number of units in the subpopulation is not known with certainty. You should \ninclude the domain variable(s) in your TABLES request to obtain domain analysis."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"CLUSTER|CLUSTERS","StatementHelp":{"#cdata":"Syntax: CLUSTER variables ;\n      \nThe CLUSTER statement names variables that identify the first-stage clusters, \nor primary sampling units (PSUs), in a clustered sample design."},"StatementOptions":null},{"StatementName":"REPWEIGHTS|REPWEIGHT","StatementHelp":{"#cdata":"Syntax: REPWEIGHTS variables < / options > ; \n      \nThe REPWEIGHTS statement names variables that provide replicate weights for BRR or jackknife \nvariance estimation, which you request with the VARMETHOD=BRR or VARMETHOD=JACKKNIFE option \nin the PROC SURVEYFREQ statement."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DF=","StatementOptionHelp":{"#cdata":"[Syntax: DF=df] \n          \nSpecifies the degrees of freedom for the analysis. The value of df must be a positive number."},"StatementOptionType":"V"},{"StatementOptionName":"JKCOEFS=","StatementOptionHelp":{"#cdata":"[Syntax: JKCOEFS=value | (values) | SAS-data-set] \n\nJKCOEFS=value\nSpecifies the jackknife coefficient for VARMETHOD=JACKKNIFE. The coefficient value must be a \nnonnegative number less than one.\n\nJKCOEFS=(values)          \nSpecifies jackknife coefficients for VARMETHOD=JACKKNIFE, where each coefficient corresponds to an \nindividual replicate identified by a REPWEIGHTS variable. You can separate values with blanks or commas.\n\nJKCOEFS=SAS-data-set\nNames a SAS data set that contains the jackknife coefficients for VARMETHOD=JACKKNIFE."},"StatementOptionType":"V"}]}},{"StatementName":"STRATA|STRATUM","StatementHelp":{"#cdata":"Syntax: STRATA variables < / option > ;\n      \nThe STRATA statement names variables that form the strata in a stratified sample design."},"StatementOptions":{"StatementOption":{"StatementOptionName":"LIST","StatementOptionHelp":{"#cdata":"Displays a \"Stratum Information\" table, which lists all strata together with the corresponding \nvalues of the STRATA variables."},"StatementOptionType":"S"}}},{"StatementName":"TABLES|TABLE","StatementHelp":{"#cdata":"Syntax: TABLES requests </ options> ;\n      \nThe TABLES statement requests one-way to n-way frequency and crosstabulation tables \nand statistics for these tables."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=α] \n          \nSets the level for confidence limits. The value of α must be between 0 and 1, and the \ndefault is 0.05."},"StatementOptionType":"V"},{"StatementOptionName":"CHISQ","StatementOptionHelp":{"#cdata":"Syntax: CHISQ < (options) >\n          \nRequests the Rao-Scott chi-square test. This is a design-adjusted test that is computed by applying\na design correction to the weighted Pearson chi-square statistic. By default, PROC SURVEYFREQ\nprovides a first-order Rao-Scott chi-square test.\n\nYou can specify the following options in parentheses after the CHISQ option:\n  FIRSTORDER\n    requests a first-order Rao-Scott chi-square test. This is the default for the CHISQ option; if you\n    do not specify CHISQ(SECONDORDER), the procedure provides a first-order Rao-Scott test.\n  MODIFIED\n    uses the null hypothesis proportions to compute the Rao-Scott design correction. By default (if\n    you do not specify CHISQ(MODIFIED)), the procedure uses proportion estimates to compute\n    the design correction for all first-order tests and for second-order tests for one-way tables. For\n    second-order tests for two-way tables, the procedure always uses null hypothesis proportions to\n    compute the design correction.\n  SECONDORDER\n    requests a second-order (Satterthwaite) Rao-Scott chi-square test."},"StatementOptionType":"S","SubOptionsKeywords":"FIRSTORDER|MODIFIED|SECONDORDER"},{"StatementOptionName":"CHISQ1","StatementOptionHelp":{"#cdata":"Requests the Rao-Scott modified chi-square test."},"StatementOptionType":"S"},{"StatementOptionName":"CL","StatementOptionHelp":{"#cdata":"[Syntax: CL < (options) >] \n          \nRequests confidence limits for the percentages (proportions) in the crosstabulation table. \n\nYou can specify the following options in parentheses following the CL option: \n\n  ADJUST=NO |YES \n  controls the degrees-of-freedom adjustment to the effective sample size for the modified \n  Clopper-Pearson and Wilson confidence limits. By default, ADJUST=YES.\n\n  PSMALL <= p> \n  uses the alternative confidence limit type that you specify with the TYPE= option for extreme \n  (small or large) proportion values. \n\n  The PSMALL value p defines the range of extreme proportion values, where those proportions \n  less than or equal to p or greater than or equal to (1 – p) are considered to be extreme, \n  and those proportions between p and (1 – p) are not extreme. \n\n  TRUNCATE=NO | YES \n  controls the truncation of the effective sample size for the modified Clopper-Pearson and \n  Wilson confidence limits. By default, TRUNCATE=YES truncates the effective sample size if \n  it is larger than the original sample size. \n\n  TYPE=name \n  specifies the type of confidence limits to compute for proportions. If you do not specify \n  the TYPE= option, PROC SURVEYFREQ computes Wald confidence limits (TYPE=WALD) by default. \n\n    CLOPPERPEARSON | CP \n    requests modified Clopper-Pearson (exact) confidence limits for proportions.  \n\n    LOGIT -- requests logit confidence limits for proportions. \n\n    WALD --  requests standard Wald (\"linear\") confidence limits for proportions. This is the default \n    confidence limit type if you do not specify the TYPE= option.  \n\n    WILSON | SCORE -- requests modified Wilson (score) confidence limits for proportions."},"StatementOptionType":"S","SubOptionsKeywords":"TYPE=|TRUNCATE=|PSMALL|ADJUST="},{"StatementOptionName":"CLWT","StatementOptionHelp":{"#cdata":"Requests confidence limits for the weighted frequencies, or totals, in the crosstabulation table."},"StatementOptionType":"S"},{"StatementOptionName":"COL|COLUMN","StatementOptionHelp":{"#cdata":"Displays the column percentage, or estimated proportion of the column total, \nfor each cell in a two-way table."},"StatementOptionType":"S"},{"StatementOptionName":"CV","StatementOptionHelp":{"#cdata":"Displays the coefficient of variation for each percentage, or proportion estimate, \nin the crosstabulation table."},"StatementOptionType":"S"},{"StatementOptionName":"CVWT","StatementOptionHelp":{"#cdata":"Displays the coefficient of variation for each weighted frequency, or estimated total, \nin the crosstabulation table."},"StatementOptionType":"V"},{"StatementOptionName":"DEFF","StatementOptionHelp":{"#cdata":"Displays the design effect for each overall percentage (proportion) estimate in the \ncrosstabulation table."},"StatementOptionType":"S"},{"StatementOptionName":"DF=","StatementOptionHelp":{"#cdata":"[Syntax: DF=df] \n          \nSpecifies the degrees of freedom for the analysis. The value of df must be \na nonnegative number."},"StatementOptionType":"V"},{"StatementOptionName":"EXPECTED","StatementOptionHelp":{"#cdata":"Displays expected weighted frequencies for the table cells in a two-way table."},"StatementOptionType":"S"},{"StatementOptionName":"LRCHISQ","StatementOptionHelp":{"#cdata":"Requests the Rao-Scott likelihood ratio chi-square test."},"StatementOptionType":"S"},{"StatementOptionName":"LRCHISQ1","StatementOptionHelp":{"#cdata":"Requests the Rao-Scott modified likelihood ratio chi-square test."},"StatementOptionType":"S"},{"StatementOptionName":"NOCELLPERCENT|NOCELLPCT","StatementOptionHelp":{"#cdata":"Suppresses the display of overall cell percentages in the crosstabulation table, as well as the \nstandard errors of the percentages."},"StatementOptionType":"S"},{"StatementOptionName":"NOFREQ","StatementOptionHelp":{"#cdata":"Suppresses the display of cell frequencies in the crosstabulation table."},"StatementOptionType":"S"},{"StatementOptionName":"NOPERCENT|NOPCT","StatementOptionHelp":{"#cdata":"Suppresses the display of all percentages in the crosstabulation table. The NOPERCENT option\nalso suppresses the display of standard errors of the percentages."},"StatementOptionType":"S"},{"StatementOptionName":"NOPRINT","StatementOptionHelp":{"#cdata":"Suppresses the display of frequency and crosstabulation tables but displays all \nrequested statistical tests."},"StatementOptionType":"V"},{"StatementOptionName":"NOSPARSE","StatementOptionHelp":{"#cdata":"Suppresses the display of variable levels with zero frequency in two-way tables."},"StatementOptionType":"S"},{"StatementOptionName":"NOSTD","StatementOptionHelp":{"#cdata":"Suppresses the display of all standard errors in the crosstabulation table."},"StatementOptionType":"S"},{"StatementOptionName":"NOTOTAL","StatementOptionHelp":{"#cdata":"Suppresses the display of row totals, column totals, and overall totals in the \ncrosstabulation table."},"StatementOptionType":"S"},{"StatementOptionName":"NOWT","StatementOptionHelp":{"#cdata":"Suppresses the display of weighted frequencies in the crosstabulation table. The NOWT option \nalso suppresses the display of standard errors of the weighted frequencies."},"StatementOptionType":"V"},{"StatementOptionName":"OR|RESRISK","StatementOptionHelp":{"#cdata":"Requests estimates of the odds ratio, the column 1 relative risk, and the column \n2 relative risk for 2x2 tables. The OR option also provides confidence limits \nfor these statistics."},"StatementOptionType":"S"},{"StatementOptionName":"RISK|RISKDIFF","StatementOptionHelp":{"#cdata":"Requests risk statistics for 2x2 tables. The RISK option a\n          lso provides standard errors \nand confidence limits for these statistics."},"StatementOptionType":"S"},{"StatementOptionName":"RISK1","StatementOptionHelp":{"#cdata":"Requests column 1 risk statistics for 2x2 tables, together with their standard errors\nand confidence limits."},"StatementOptionType":"S"},{"StatementOptionName":"RISK2","StatementOptionHelp":{"#cdata":"Requests column 2 risk statistics for 2x2 tables, together with their standard errors \nand confidence limits."},"StatementOptionType":"S"},{"StatementOptionName":"ROW","StatementOptionHelp":{"#cdata":"Syntax: ROW < option > \n          \ndisplays the row percentage (estimated proportion of the row total) for each cell in a two-way table.\nThe ROW option also provides the standard errors of the row percentages. See the section “Row and\nColumn Proportions” on page 7633 for more information. This option has no effect for one-way tables.\n\nYou can specify the following option in parentheses after the ROW option:\n\n  DEFF\n  displays the design effect for each row percentage in the crosstabulation table."},"StatementOptionType":"S","SubOptionsKeywords":"DEFF"},{"StatementOptionName":"TESTP=","StatementOptionHelp":{"#cdata":"[Syntax: TESTP=(values)] \n          \nSpecifies null hypothesis proportions, or test percentages, for one-way chi-square tests. \nYou can separate values with blanks or commas. Specify values in probability form as numbers \nbetween 0 and 1, where the proportions sum to 1. Or specify values in percentage form as \nnumbers between 0 and 100, where the percentages sum to 100."},"StatementOptionType":"V"},{"StatementOptionName":"VAR","StatementOptionHelp":{"#cdata":"Displays the variance estimate for each percentage in the crosstabulation table."},"StatementOptionType":"S"},{"StatementOptionName":"VARWT","StatementOptionHelp":{"#cdata":"Displays the variance estimate for each weighted frequency, or estimated total, \nin the crosstabulation table."},"StatementOptionType":"S"},{"StatementOptionName":"WCHISQ","StatementOptionHelp":{"#cdata":"Requests the Wald chi-square test for two-way tables."},"StatementOptionType":"S"},{"StatementOptionName":"WLLCHISQ","StatementOptionHelp":{"#cdata":"Requests the Wald log-linear chi-square test for two-way tables."},"StatementOptionType":"S"},{"StatementOptionName":"WTFREQ|WT","StatementOptionHelp":{"#cdata":"Displays totals (weighted frequencies) and their standard errors when you do not \nspecify a WEIGHT or REPWEIGHTS statement."},"StatementOptionType":"S"}],"ProcedureOption":{"ProcedureOptionName":"PLOTS=","ProcedureOptionHelp":{"#cdata":"Syntax: PLOTS < (global-plot-options) > < =plot-request < (plot-options) > >\nPLOTS < (global-plot-options) > < =(plot-request < (plot-options) > < . . . plot-request < (plot-options) > >) >\n\nControls the plots that are produced through ODS Graphics. Plot-requests identify the plots, and\nplot-options control the appearance and content of the plots. You can specify plot-options in parentheses\nafter a plot-request. A global-plot-option applies to all plots for which it is available unless it is altered\nby a specific plot-option. You can specify global-plot-options in parentheses after the PLOTS option. \n\nIn addition to the plot-options that are available for each plot-request, you can specify the following\nglobal-plot-option in parentheses after the PLOTS option:\n\n  ONLY\n  suppresses the default plots and requests only the plots that are specified as plot-requests."},"ProcedureOptionType":"S|V","ProcedureOptionValues":{"@Value1":"ALL","@Value2":"MOSAICPLOT","@Value3":"NONE","@Value4":"ODDSRATIOPLOT","@Value5":"RELRISKPLOT","@Value6":"RISKDIFFPLOT","@Value7":"WTFREQPLOT"},"ProcedureOptionToolTips":{"@ToolTip1":"Requests all plots that are associated with the specified analyses.","@ToolTip2":"Syntax: MOSAICPLOT < (plot-option) >  Requests a mosaic plot. Mosaic plots are available for crosstabulation tables. For multiway tables, PROC SURVEYFREQ provides a mosaic plot for each two-way table layer.   You can specify the following plot-option in parentheses after the MOSAICPLOT plot-request:   SQUARE   produces a square mosaic plot, where the height of the Y axis equals the width of the X axis.   In a square mosaic plot, the scale of the relative weighted frequencies is the same on both   axes. By default, PROC SURVEYFREQ produces a rectangular mosaic plot.","@ToolTip3":"Suppresses all plots.","@ToolTip4":"Syntax: ODDSRATIOPLOT < (plot-options) > requests a plot of odds ratios with confidence limits. Odds ratio plots are available for multiway 2x2 tables and display the odds ratio (with confidence limits) for each 2x2 table layer. To produce an odds ratio plot, you must also specify the OR option in the TABLES statement for a multiway 2x2 table.   The following plot-options are available:    CLDISPLAY=SERIF | LINE | BAR < width >     controls the appearance of the confidence limit error bars.    CCOLUMN=1 | 2     specifies the 2x2 table column to use to compute the risk (proportion).    LOGBASE=2 | E | 10     applies to the odds ratio plot (ODDSRATIOPLOT) and the relative risk plot (RELRISKPLOT).    NPANELPOS=n     divides the plot into multiple panels that display at most |n| statistics (odds ratios,      relative risks, or risk differences) per panel.    ORDER=ASCENDING | DESCENDING     displays the statistics (odds ratios, relative risks, or risk differences) in sorted order.    RANGE=(< min > <, max >) | CLIP     specifies the range of values to display.    STATS      displays the values of the statistics and their confidence limits on the right side of the plot.","@ToolTip5":"Syntax: RELRISKPLOT < (plot-options) > requests a plot of relative risks with confidence limits. Relative risk plots are available for multiway 2x2 tables and display the relative risk (with confidence limits) for each 2x2 table layer. To produce a relative risk plot, you must also specify the OR option in the TABLES statement for a multiway 2x2 table.   The following plot-options are available:    CLDISPLAY=SERIF | LINE | BAR < width >     controls the appearance of the confidence limit error bars.    CCOLUMN=1 | 2     specifies the 2x2 table column to use to compute the risk (proportion).    LOGBASE=2 | E | 10     applies to the odds ratio plot (ODDSRATIOPLOT) and the relative risk plot (RELRISKPLOT).    NPANELPOS=n     divides the plot into multiple panels that display at most |n| statistics (odds ratios,      relative risks, or risk differences) per panel.    ORDER=ASCENDING | DESCENDING     displays the statistics (odds ratios, relative risks, or risk differences) in sorted order.    RANGE=(< min > <, max >) | CLIP     specifies the range of values to display.    STATS      displays the values of the statistics and their confidence limits on the right side of the plot.","@ToolTip6":"Syntax: RISKDIFFPLOT < (plot-options) >                                  Requests a plot of risk differences with confidence limits. Risk difference plots are available for multiway 2x2 tables and display the risk difference (with confidence limits) for each 2x2 table layer. To produce a risk difference plot, you must also specify the RISK, RISK1, or RISK2 option in the TABLES statement for a multiway 2x2 table.   The following plot-options are available:    CLDISPLAY=SERIF | LINE | BAR < width >     controls the appearance of the confidence limit error bars.    CCOLUMN=1 | 2     specifies the 2x2 table column to use to compute the risk (proportion).    LOGBASE=2 | E | 10     applies to the odds ratio plot (ODDSRATIOPLOT) and the relative risk plot (RELRISKPLOT).    NPANELPOS=n     divides the plot into multiple panels that display at most |n| statistics (odds ratios,      relative risks, or risk differences) per panel.    ORDER=ASCENDING | DESCENDING     displays the statistics (odds ratios, relative risks, or risk differences) in sorted order.    RANGE=(< min > <, max >) | CLIP     specifies the range of values to display.    STATS      displays the values of the statistics and their confidence limits on the right side of the plot.","@ToolTip7":"Syntax: WTFREQPLOT < (plot-options) >                                  Requests a weighted frequency plot. Weighted frequency plots are available for frequency and crosstabulation tables. For multiway tables, PROC SURVEYFREQ provides a two-way weighted frequency plot for each two-way table layer.   You can specify the following plot-options in parentheses after the WTFREQPLOT plot-request:    CLBAR=NO | YES     controls the confidence limit error bars in the plots.   GROUPBY=COLUMN | ROW     specifies the primary grouping for two-way weighted frequency plots.   NPANELPOS=n     divides a two-way weighted frequency plot into multiple panels that display at most |n| sections     per panel.   ORIENT=HORIZONTAL | VERTICAL     controls the orientation of the weighted frequency plot.   SCALE=WTFREQ | PERCENT     specifies the scale of the frequencies to display.   TWOWAY=CLUSTER | GROUPHORIZONTAL | GROUPVERTICAL | STACKED     specifies the layout for two-way weighted frequency plots.   TYPE=BARCHART | DOTPLOT     specifies the type of the weighted frequency plot."},"SubOptionsKeywords":"ONLY|CLDISPLAY=|COLUMN=|LOGBASE=|NPANELPOS=|ORDER=|RANGE=|STATS|CLBAR=|GROUPBY=|ORIENT=|SCALE=|TWOWAY=|TYPE="}}},{"StatementName":"WEIGHT|WGT","StatementHelp":{"#cdata":"Syntax: WEIGHT variable;\n      \nThe WEIGHT statement names the variable that contains the sampling weights. This variable must \nbe numeric, and the sampling weights must be positive numbers."},"StatementOptions":null}]}}}