{"Procedure":{"Name":"TEXTMINE","ProductGroup":"CAS","ProcedureHelp":{"#cdata":"Syntax: PROC TEXTMINE DATA=CAS-libref.data-table < options > ;\n    VARIABLES variable ;\n    TARGET variable ;\n    DOC_ID variable ;\n    PARSE < parse-options > ;\n    SELECT label-list /<GROUP=group-option > KEEP | IGNORE ;\n    SVD < svd-options > ;\n    \nThe TEXTMINE procedure integrates natural language processing and statistical analysis to analyze largescale\ntextual data in SAS Viya. PROC TEXTMINE supports a wide range of fundamental text analysis\nfeatures, which include tokenizing, stemming, part-of-speech tagging, noun group extraction, default or\ncustomized stop lists and start lists, entity parsing, multiword tokens, synonym lists, term weighting, termby-\ndocument matrix creation, and dimension reduction by term filtering and singular value decomposition\n(SVD)."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"Syntax: DATA=CAS-libref.data-table\n      \nNames the input data table for PROC TEXTMINE to use. The default is the most recently created data\ntable. CAS-libref.data-table is a two-level name, where\n\n  CAS-libref refers to a collection of information that is defined in the LIBNAME statement and\n    includes the caslib, which includes a path to the data, and a session identifier, which\n    defaults to the active session but which can be explicitly defined in the LIBNAME\n    statement.\n    \n  data-table specifies the name of the input data table."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"LANGUAGE=","ProcedureOptionHelp":{"#cdata":"Syntax: LANGUAGE=language\n      \nNames the language that is used by the documents in the input SAS data table. Languages supported in\nthe current release are Chinese, Dutch, English, Finnish, French, German, Italian, Japanese, Korean,\nPortuguese, Russian, Spanish, and Turkish. By default, LANGUAGE=ENGLISH."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"NTHREADS=","ProcedureOptionHelp":{"#cdata":"Syntax: NTHREADS=nthreads\n      \nSpecifies the number of threads to be used. By default, the number of threads is the same as the number\nof CPUs on the CAS server."},"ProcedureOptionType":"V"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"DOC_ID","StatementHelp":{"#cdata":"Syntax: DOC_ID variable ;\n      \nThe DOC_ID statement specifies the variable that contains the ID of each document. In the input data table,\neach row corresponds to one document. The ID of each document must be unique; it can be either a number\nor a string of characters."},"StatementOptions":null},{"StatementName":"PARSE","StatementHelp":{"#cdata":"Syntax: PARSE < parse-options > ;\n      \nThe PARSE statement specifies the options for parsing the input documents and creating the term-bydocument\nmatrix."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"CELLWGT=","StatementOptionHelp":{"#cdata":"Syntax: CELLWGT=LOG | NONE\n          \nSpecifies how the elements in the term-by-document matrix are weighted. You can specify the following\nvalues:\n\n  LOG weights cells by using the log formulation. \n  NONE specifies that no cell weight be applied."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"LOG","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Weights cells by using the log formulation.","@ToolTip2":"Specifies that no cell weight be applied."}},{"StatementOptionName":"ENTITIES=","StatementOptionHelp":{"#cdata":"Syntax: ENTITIES=STD | NONE\n          \nDetermines whether to use the standard LITI file for entity extraction.\n\nBy default, ENTITIES=NONE."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"STD","@Value2":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Uses the standard LITI file for entity extraction. A term such as “George W. Bush” is recognized as an entity and given the corresponding entity role and attribute. For this term, the entity role is PERSON and the attribute is Entity. Although the entity is treated as the single term, “george w. bush,” the individual tokens “george,” “w,” and “bush” are also included.","@ToolTip2":"Does not use the standard LITI file for entity extraction."}},{"StatementOptionName":"MULTITERM=","StatementOptionHelp":{"#cdata":"Syntax: MULTITERM=CAS-libref.data-table\n          \nSpecifies the inpur SAS data table that contains a list of multiword terms. CAS-libref.data-table is a\ntwo-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies\nthe name of the input data table."},"StatementOptionType":"V"},{"StatementOptionName":"NONOUNGROUPS|NONG","StatementOptionHelp":{"#cdata":"Suppresses standard noun group extraction. By default, the TEXTMINE procedure extracts noun\ngroups, returns noun phrases without determiners or prepositions, and (unless the NOSTEMMING\noption is specified) stems noun group elements."},"StatementOptionType":"S"},{"StatementOptionName":"NOSTEMMING","StatementOptionHelp":{"#cdata":"Suppresses stemming of words. By default, words are stemmed; that is, terms such as “advises” and\n“advising” are mapped to the parent term “advise.” The TEXTMINE procedure uses dictionary-based\nstemming (also known as lemmatization)."},"StatementOptionType":"S"},{"StatementOptionName":"NOTAGGING","StatementOptionHelp":{"#cdata":"Suppresses tagging of terms. By default, terms are tagged and the TEXTMINE procedure identifies\na term’s part of speech based on context clues. The identified part of speech is provided in the Role\nvariable of the OUTTERMS= data table."},"StatementOptionType":"S"},{"StatementOptionName":"OUTCHILD=","StatementOptionHelp":{"#cdata":"Syntax: OUTCHILD=CAS-libref.data-table\n          \nSpecifies the output data table to contain a compressed representation of the sparse term-by-document\nmatrix. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session\nidentifier, and data-table specifies the name of the output data table."},"StatementOptionType":"V"},{"StatementOptionName":"OUTCONFIG=","StatementOptionHelp":{"#cdata":"Syntax: OUTCONFIG=CAS-libref.data-table\n          \nSpecifies the output data table to contain configuration information that is used for the current run of\nPROC TEXTMINE. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib\nand session identifier, and data-table specifies the name of the output data table."},"StatementOptionType":"V"},{"StatementOptionName":"OUTPARENT=","StatementOptionHelp":{"#cdata":"Syntax: OUTPARENT=CAS-libref.data-table\n          \nSpecifies the output data table to contain a compressed representation of the sparse term-by-document\nmatrix. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session\nidentifier, and data-table specifies the name of the output data table."},"StatementOptionType":"V"},{"StatementOptionName":"OUTPOS=","StatementOptionHelp":{"#cdata":"Syntax: OUTPOS=CAS-libref.data-table\n          \nSpecifies the output data table to contain the position information about the child terms’ occurrences\nin the document collection. CAS-libref.data-table is a two-level name, where CAS-libref refers to\nthe caslib and session identifier, and data-table specifies the name of the output data table."},"StatementOptionType":"V"},{"StatementOptionName":"OUTTERMS=","StatementOptionHelp":{"#cdata":"Syntax: OUTTERMS=CAS-libref.data-table\n          \nSpecifies the output data table to contain the summary information about the terms in the document\ncollection. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session\nidentifier, and data-table specifies the name of the output data table."},"StatementOptionType":"V"},{"StatementOptionName":"REDUCEF=","StatementOptionHelp":{"#cdata":"Syntax: REDUCEF=n\n          \nRemoves terms that are not in at least n documents. The value of n must be a positive integer. By\ndefault, REDUCEF=4."},"StatementOptionType":"V"},{"StatementOptionName":"SHOWDROPPEDTERMS","StatementOptionHelp":{"#cdata":"Includes the terms that have a keep status of N in the OUTTERMS= data table and the OUTCHILD=\ndata table."},"StatementOptionType":"S"},{"StatementOptionName":"START=","StatementOptionHelp":{"#cdata":"Syntax: START=CAS-libref.data-table\n          \nSpecifies the input data table that contains the terms that are to be kept for the analysis. CAS-libref.datatable\nis a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table\nspecifies the name of the input data table."},"StatementOptionType":"V"},{"StatementOptionName":"STOP=","StatementOptionHelp":{"#cdata":"Syntax: STOP=CAS-libref.data-table\n          \nspecifies the input data table that contains the terms to exclude from the analysis. CAS-libref.data-table\nis a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies\nthe name of the input data table."},"StatementOptionType":"V"},{"StatementOptionName":"SYNONYM=|SYN=","StatementOptionHelp":{"#cdata":"Syntax: SYNONYM=CAS-libref.data-table | SYN=CAS-libref.data-table\n          \nSpecifies the input data table that contains user-defined synonyms to be used in the analysis. CASlibref.\ndata-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and\ndata-table specifies the name of the input data table."},"StatementOptionType":"V"},{"StatementOptionName":"TERMWGT=","StatementOptionHelp":{"#cdata":"Syntax: TERMWGT=ENTROPY | MI | NONE\n          \nSpecifies how terms are weighted."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ENTROPY","@Value2":"MI","@Value3":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Uses the entropy formulation to weight terms.","@ToolTip2":"Uses the mutual information formulation to weight terms (you must also specify the TARGET statement).","@ToolTip3":"Requests that no term weight be applied."}}]}},{"StatementName":"SELECT","StatementHelp":{"#cdata":"Syntax: SELECT label-list /<GROUP=group-option > KEEP | IGNORE ;\n      \nThe SELECT statement enables you to specify the parts of speech or entities or attributes that you want to\ninclude in or exclude from your analysis. Exclusion by the SELECT statement is different from exclusion\nthat is indicated by the _keep variable in the OUTTERMS= data table. Terms that are excluded by the\nSELECT statement cannot be included in the OUTTERMS= data table, whereas terms that have _keep=N\ncan be included in the OUTTERMS= data table if the SHOWDROPPEDTERMS option is specified. Terms\nexcluded by the SELECT statement are excluded from the OUTPOS= data table, but terms that have _keep=N\nare included in OUTPOS= data table. \n\nlabel-list\n  specifies one or more labels that are either parts of speech or entities or attributes. Each label must\n  be surrounded by double quotation marks and separated by spaces from other labels. Labels are\n  case-insensitive. Terms that have these labels are either ignored during parsing (when the IGNORE\n  option is specified) or kept in the parsing results in the OUTPOS= and OUTTERMS= data tables\n  (when the KEEP option is specified)."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"IGNORE","StatementOptionHelp":{"#cdata":"Ignores during parsing all terms whose labels are specified in the label-list, but keeps all other terms in\nthe parsing results (the OUTPOS= and OUTTERMS= data tables)."},"StatementOptionType":"S"},{"StatementOptionName":"KEEP","StatementOptionHelp":{"#cdata":"Keeps in the parsing results (the OUTPOS= and OUTTERMS= data tables) only the terms whose labels\nare specified in the label-list."},"StatementOptionType":"S"},{"StatementOptionName":"GROUP=","StatementOptionHelp":{"#cdata":"Syntax: GROUP=“ATTRIBUTES” | “ENTITIES” | “POS”\n          \nSpecifies whether the labels are attributes, entities, or parts of speech. The group type must be\nsurrounded by double quotation marks and is case-insensitive. All labels that are specified in the\nlabel-list in the same SELECT statement should belong to the specified group. If you need to select\nlabels from more than one group, you can use multiple SELECT statements (one for each group that\nyou need to select from). You cannot specify multiple SELECT statements for the same group. By\ndefault, “Num” and “Punct” in the “ATTRIBUTES” group are ignored, but this default is overridden\nby a SELECT statement that specifies GROUP=“ATTRIBUTES”. By default, GROUP=“POS”."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"\"ATTRIBUTES\"","@Value2":"\"ENTITIES\"","@Value3":"\"POS\""},"StatementOptionToolTips":{"@ToolTip1":"Specifies that labels are attributes.","@ToolTip2":"Specifies that labels are entities.","@ToolTip3":"Specifies that labels are parts of speech (POS)."}}]}},{"StatementName":"SVD","StatementHelp":{"#cdata":"Syntax: SVD < svd-options > ;\n      \nThe SVD statement specifies the options for calculating a truncated singular value decomposition (SVD) of\nthe large, sparse term-by-document matrix that is created during the parsing phase of PROC TEXTMINE."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"COL=","StatementOptionHelp":{"#cdata":"Syntax: COL=variable\n          \nSpecifies the variable that contains the column indices of the term-by-document matrix. You must\nspecify this option when you run PROC TEXTMINE in SVD-only mode (that is, when you specify the\nSVD statement but not the PARSE statement)."},"StatementOptionType":"V"},{"StatementOptionName":"ENTRY=","StatementOptionHelp":{"#cdata":"Syntax: ENTRY=variable\n          \nSpecifies the variable that contains the entries of the term-by-document matrix. You must specify\nthis option when you run PROC TEXTMINE in SVD-only mode (that is, when you specify the SVD\nstatement but not the PARSE statement)."},"StatementOptionType":"V"},{"StatementOptionName":"EXACTWEIGHT","StatementOptionHelp":{"#cdata":"Requests that the weights aggregated during topic derivation not be rounded. By default, the calculated\nweights are rounded to the nearest 0.001."},"StatementOptionType":"V"},{"StatementOptionName":"IN_TERMS=","StatementOptionHelp":{"#cdata":"Syntax: IN_TERMS=CAS-libref.data-table\n          \nSpecifies the input data table that contains information about the terms in the document collection.\nCAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier,\nand data-table specifies the name of the input data table"},"StatementOptionType":"V"},{"StatementOptionName":"K=","StatementOptionHelp":{"#cdata":"Syntax: K=k\n          \nSpecifies the number of columns in the matrices U, V, and S. This value is the number of dimensions\nof the data table after SVD is performed. If the value of k is too large, then the TEXTMINE procedure\nruns for an unnecessarily long time. This option takes precedence over the MAX_K= option. This\noption also controls the number of topics that are extracted from the text corpus when the ROTATION=\noption is specified."},"StatementOptionType":"V"},{"StatementOptionName":"MAX_K=","StatementOptionHelp":{"#cdata":"Syntax: MAX_K=n\n          \nSpecifies the maximum value that the TEXTMINE procedure should return as the recommended value\nof k (the number of columns in the matrices U, V, and S) when the RESOLUTION= option is specified\n(to recommend the value of k). The TEXTMINE procedure attempts to calculate k dimensions (as\nopposed to recommending it) when it performs SVD. This option is ignored if the K= option has been\nspecified. This option also controls the number of topics that are extracted from the text corpus when\nthe ROTATION= option is specified."},"StatementOptionType":"V"},{"StatementOptionName":"NOCUTOFFS","StatementOptionHelp":{"#cdata":"Uses all weights in the U matrix to form the document projections. When topics are requested, weights\nbelow the term cutoff (as calculated in the OUTTOPICS= data table) are set to 0 before the projection\nis formed."},"StatementOptionType":"S"},{"StatementOptionName":"NUMLABELS=","StatementOptionHelp":{"#cdata":"Syntax: NUMLABELS=n\n          \nSpecifies the number of terms to use in the descriptive label for each topic. The descriptive label\nprovides a quick synopsis of the discovered topics. The labels are stored in the OUTTOPICS= data\ntable. By default, NUMLABELS=5."},"StatementOptionType":"V"},{"StatementOptionName":"OUTDOCPRO=","StatementOptionHelp":{"#cdata":"Syntax: OUTDOCPRO=CAS-libref.data-table <KEEPVARIABLES=variable-list><NONORMDOC>\nSyntax: OUTDOCPRO=CAS-libref.data-table <KEEPVARS=variable-list><NONORMDOC>\n\nSpecifies the output data table to contain the projections of the columns of the term-by-document matrix\nonto the columns of U. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib\nand session identifier, and data-table specifies the name of the output data table.\n\nYou can copy the variables from the data table that is specified in the DATA= option in the PROC\nTEXTMINE statement to the data table that is specified in this option. You can specify the following\nsuboptions:\n  KEEPVARIABLES=variable-list\n    attaches the content of the variables that are specified in the variable-list to the output. These\n    variables must appear in the data table that is specified in the DATA= option in the PROC\n    TEXTMINE statement.\n  NONORMDOC\n    suppresses normalization of the columns that contain the projections of documents to have a unit\n    norm."},"StatementOptionType":"V","SubOptionsKeywords":"KEEPVARIABLES=|NONORMDOC"},{"StatementOptionName":"OUTTOPICS=","StatementOptionHelp":{"#cdata":"Syntax: OUTTOPICS=CAS-libref.data-table\n          \nSpecifies the output data table to contain the topics that are discovered. CAS-libref.data-table is a\ntwo-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies\nthe name of the output data table."},"StatementOptionType":"V"},{"StatementOptionName":"RESOLUTION=|RES=","StatementOptionHelp":{"#cdata":"Syntax: RESOLUTION=LOW | MED | HIGH | RES=LOW | MED | HIGH\n          \nSpecifies how to calculate the recommended number of dimensions (resolution) for the singular value\ndecomposition. If you specify this option, you must also specify the MAX_K= option. A lowresolution\nsingular value decomposition returns fewer dimensions than a high-resolution singular value\ndecomposition. This option recommends the value of k (the number of columns in the matrices U, V,\nand S) heuristically based on the value specified in the MAX_K= option. Assume that the MAX_K=\noption is set to n and a singular value decomposition that has n dimensions accounts for t% of the total\nvariance.\n\nBy default, RESOLUTION=HIGH."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"LOW","@Value2":"MED","@Value3":"HIGH"},"StatementOptionToolTips":{"@ToolTip1":"Recommends a k that explains (2/3) * t% of the total variance.","@ToolTip2":"Recommends a k that explains (5/6) * t% of the total variance.","@ToolTip3":"Always recommends the maximum number of dimensions; that is, k = n."}},{"StatementOptionName":"ROTATION=","StatementOptionHelp":{"#cdata":"Syntax: ROTATION=VARIMAX | PROMAX\n          \nSpecifies the type of rotation to be used in order to maximize the explanatory power of each topic."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"VARIMAX","@Value2":"PROMAX"},"StatementOptionToolTips":{"@ToolTip1":"Does an orthogonal rotation on the original left singular vectors and generates uncorrelated topics.","@ToolTip2":"Does an oblique rotation on the original left singular vectors and generates topics that might be correlated."}},{"StatementOptionName":"ROW=","StatementOptionHelp":{"#cdata":"Syntax: ROW=variable\n          \nSpecifies the variable that contains the row indices of the term-by-document matrix. You must specify\nthis option when you run PROC TEXTMINE in SVD-only mode (that is, when you specify the SVD\nstatement but not the PARSE statement)."},"StatementOptionType":"V"},{"StatementOptionName":"SVDS=","StatementOptionHelp":{"#cdata":"Syntax: SVDS=CAS-libref.data-table\n          \nSpecifies the output data table to contain the calculated singular values. CAS-libref.data-table is a\ntwo-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies\nthe name of the output data table."},"StatementOptionType":"V"},{"StatementOptionName":"SVDU=","StatementOptionHelp":{"#cdata":"Syntax: SVDU=CAS-libref.data-table\n          \nSpecifies the data table to contain the calculated left singular vectors. CAS-libref.data-table is a twolevel\nname, where CAS-libref refers to the caslib and session identifier, and data-table specifies the\nname of the output data table."},"StatementOptionType":"V"},{"StatementOptionName":"SVDV=","StatementOptionHelp":{"#cdata":"Syntax: SVDV=CAS-libref.data-table\n          \nSpecifies the data table to contain the calculated right singular vectors. CAS-libref.data-table is a\ntwo-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies\nthe name of the output data table."},"StatementOptionType":"V"},{"StatementOptionName":"TOL=","StatementOptionHelp":{"#cdata":"Syntax: TOL=Є\n          \nSpecifies the maximum allowable tolerance for the singular value."},"StatementOptionType":"V"}]}},{"StatementName":"TARGET","StatementHelp":{"#cdata":"Syntax: TARGET variable ;\n      \nThis statement specifies the variable that contains the information about the category that a document belongs\nto. The target variable can be any nominal or ordinal variable; it is used in calculating mutual information\nterm weighting."},"StatementOptions":null},{"StatementName":"VARIABLES|VAR","StatementHelp":{"#cdata":"Syntax: VARIABLES variable ; | VAR variable ;\n      \nThis statement specifies the variable that contains the text to be processed."},"StatementOptions":null}]}}}