{"Procedure":{"Name":"TMSCORE","ProductGroup":"CAS","ProcedureHelp":{"#cdata":"Syntax: PROC TMSCORE DATA=CAS-libref.data-table < options > ;\n    VARIABLES variable ;\n    DOC_ID variable ;\n    \nThe TMSCORE procedure scores textual data in SAS Viya. In text mining, scoring is the process of applying\nparsing and singular value decomposition (SVD) projections to new textual data. The TMSCORE procedure\nperforms this scoring of new documents, and its primary outputs are the Outparent data table (which holds\nthe parsing results of the term-by-document matrix) and the Outdocpro data table (which holds the reduced\ndimensional representation of the score collection). PROC TMSCORE uses some of the output data tables of\nthe TEXTMINE procedure as input data to ensure consistency between scoring and training. During scoring,\nthe new textual data must be parsed using the same settings that the training data were parsed with, indexed\nusing only the subset of terms that were used during training, and projected onto the reduced-dimensional\nsubspace of the singular value decomposition that was derived from the training data. To facilitate this\nprocess, you specify the CONFIG=, TERMS=, and SVDU= options in PROC TEXTMINE to create three\ndata tables (Outconfig, Outterms, and Svdu, respectively), and then you specify those three data tables as\ninputs to PROC TMSCORE."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=|DOC=","ProcedureOptionHelp":{"#cdata":"Syntax: DATA=CAS-libref.data-table\n      \nNames the input data table for PROC TMSCORE to use. CAS-libref.data-table is a two-level name, where\n\n  CAS-libref refers to a collection of information that is defined in the LIBNAME statement and\n    includes the caslib, which includes a path to the data, and a session identifier, which\n    defaults to the active session but which can be explicitly defined in the LIBNAME\n    statement.\n    \n  data-table specifies the name of the input data table."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"CONFIG=","ProcedureOptionHelp":{"#cdata":"Syntax: CONFIG=CAS-libref.data-table\n      \nSpecifies the input data table that contains configuration information for PROC TMSCORE. CASlibref.\ndata-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and\ndata-table specifies the name of the input data table."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"OUTPARENT=","ProcedureOptionHelp":{"#cdata":"Syntax: OUTPARENT=CAS-libref.data-table\n      \nSpecifies the output data table to contain a compressed representation of the sparse term-by-document\nfrequency matrix. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and\nsession identifier, and data-table specifies the name of the output data table."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SVDDOCPRO=","ProcedureOptionHelp":{"#cdata":"Syntax: SVDDOCPRO=CAS-libref.data-table\n      \nSpecifies the output data table to contain the reduced dimensional projections for each document.\nCAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier,\nand data-table specifies the name of the output data table."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"SVDU=","ProcedureOptionHelp":{"#cdata":"Syntax: SVDU=CAS-libref.data-table\n      \nSpecifies the input data table that contains the U matrix, which is created during training by PROC\nTEXTMINE. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and\nsession identifier, and data-table specifies the name of the input data table."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"TERMS=","ProcedureOptionHelp":{"#cdata":"Syntax: TERMS=CAS-libref.data-table\n      \nSpecifies the input data table of terms to be used by PROC TMSCORE. CAS-libref.data-table is a\ntwo-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies\nthe name of the input data table."},"ProcedureOptionType":"V"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"DOC_ID","StatementHelp":{"#cdata":"Syntax: DOC_ID variable ;\n      \nThis statement specifies the variable that contains the ID of each document. The ID of each document must\nbe unique; it can be either a number or a string of characters."},"StatementOptions":null},{"StatementName":"VARIABLES|VAR","StatementHelp":{"#cdata":"Syntax: VARIABLES variable ; | VAR variable ;\n      \nThis statement specifies the variable that contains the text to be processed."},"StatementOptions":null}]}}}