{"Procedure":{"Name":"TRANS","ProductGroup":"SAS/OR","ProcedureHelp":{"#cdata":"Syntax: PROC TRANS options ;\n    HEADNODE variables ;\n    SUPPLY variable ;\n    TAILNODE variable ; \n  \nTransportation networks are a special type of network, called bipartite networks, that \nhave only supply and demand nodes and arcs directed from supply nodes to demand nodes. \nFor these networks, data can be given most efficiently in a rectangular or matrix form. \nThe TRANS procedure takes cost, capacity, and lower bound data in this form. The observations \nin these data sets correspond to supply nodes, and the variables correspond to demand nodes. \n\nThe TRANS procedure puts the solution in a single output data set. As with the other \noptimization procedures, the TRANS procedure defines a macro variable, named _ORTRANS, \nthat has a character string that describes the solution status."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"CAPACITY=","ProcedureOptionHelp":{"#cdata":"[Syntax: CAPACITY=SAS-data-set] \n      \nNames the SAS data set that contains the capacity on each arc in the transportation network. \nThese data specify the maximum allowable flow on each network arc. If the CAPACITY= option is \nomitted, then the value of the DEFCAPACITY= option is used for each arc in the network."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"COST=","ProcedureOptionHelp":{"#cdata":"[Syntax: COST=SAS-data-set] \n      \nNames the SAS data set that contains the cost, supply, and demand data for the transportation \nnetwork. If the COST= option is omitted, the most recently created SAS data set is used."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"MINFLOW=","ProcedureOptionHelp":{"#cdata":"[Syntax: MINFLOW=SAS-data-set] \n      \nNames the SAS data set that contains the minimum flow data for the transportation network. \nThese data specify the minimum required flow on each arc in the network. If the MINFLOW= \noption is omitted, then the value of the DEFMINFLOW= option is used for each arc in the \nnetwork."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"OUT=","ProcedureOptionHelp":{"#cdata":"[Syntax: OUT=SAS-data-set] \n      \nSpecifies a name for the output data set. If the OUT= option is omitted, the SAS System \ncreates a data set and names it according to the DATAn convention."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"DEFCAPACITY=","ProcedureOptionHelp":{"#cdata":"[Syntax: DEFCAPACITY=c] \n      \nSpecifies the default capacity for the arcs in the network. The default value of c is +∞."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"DEFMINFLOW=","ProcedureOptionHelp":{"#cdata":"[Syntax: DEFMINFLOW=s] \n      \nSpecifies the default minimum flow for the arcs in the network. The default value \nof s is 0."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"DEMAND=","ProcedureOptionHelp":{"#cdata":"[Syntax: DEMAND=d] \n      \nGives the number of the observation that contains the number of units demanded \nat each destination node. The default value of d is 1.0."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"MAXIMUM","ProcedureOptionHelp":{"#cdata":"Tells the procedure to maximize rather than minimize the objective function."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"NOTHRUNET","ProcedureOptionHelp":{"#cdata":"Tells PROC TRANS to drain away any excess supply (the amount that total supply exceeds total \ndemand) or excess demand (the amount that total demand exceeds total supply). If total supply \nexceeds total demand and if a destination node demands d units of flow, then at least d units \nand maybe more will flow to that node. Similarly, if total demand exceeds total supply and if \na source node supplies s units of flow, then at least s units and possibly more will flow from \nthat node. If a transportation problem has unequal total supply and total demand, and you do \nnot specify either the THRUNET or NOTHRUNET option, then PROC TRANS assumes that the problem \nis infeasible and does not proceed with the optimization."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"THRUNET|ADDSUPPLY","ProcedureOptionHelp":{"#cdata":"Tells the procedure to force through the network any excess supply (the amount that total \nsupply exceeds total demand) or any excess demand (the amount that total demand exceeds \ntotal supply), as is required. If a transportation problem has unequal total supply and \ntotal demand, and you do not specify either THRUNET or NOTHRUNET, then PROC TRANS assumes \nthat the problem is infeasible and does not proceed with the optimization."},"ProcedureOptionType":"S"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"HEADNODE","StatementHelp":{"#cdata":"Syntax: HEADNODE variables ; \n      \nThe HEADNODE statement is a list of SAS variables in the COST= data set. Some\nor all of these variables are in the CAPACITY= data set and the MINFLOW= data\nset. The names of these SAS variables are also the names of the destination nodes \nin the transportation problem."},"StatementOptions":null},{"StatementName":"SUPPLY","StatementHelp":{"#cdata":"Syntax: SUPPLY variable ; \n      \nThe SUPPLY statement identifies the variable in the COST= data set that contains the \nnumber of units of supply at each supply node. The SUPPLY statement is required. \nValues of the SUPPLY variable must be numeric."},"StatementOptions":null},{"StatementName":"TAILNODE","StatementHelp":{"#cdata":"Syntax: TAILNODE variable ; \n      \nThe TAILNODEstatement identifies the variable in all input data sets that names each \nof the source nodes. This variable is included in the output data set. The TAILNODE \nstatement is required, and the values of the TAILNODE variable must be character."},"StatementOptions":null}]}}}