{"Procedure":{"Name":"UCM","#comment":{},"ProductGroup":"SAS/ETS","ProcedureHelp":{"#cdata":"Syntax: PROC UCM <options> ; \n    AUTOREG <options> ; \n    BLOCKSEASON options ; \n    BY variables ; \n    CYCLE <options> ; \n    DEPLAG options ; \n    ESTIMATE <options> ; \n    FORECAST <options> ; \n    ID variable options ; \n    IRREGULAR <options> ; \n    LEVEL <options> ; \n    MODEL dependent variable <= regressors> ; \n    NLOPTIONS options ; \n    OUTLIER options ; \n    RANDOMREG regressors </ options> ; \n    SEASON options ; \n    SLOPE <options> ; \n    SPLINEREG regressor <options> ; \n    SPLINESEASON options ; \n\nThe UCM procedure analyzes and forecasts equally spaced univariate time series data by using \nan unobserved components model (UCM). The UCMs are also called structural models in the time \nseries literature. A UCM decomposes the response series into components such as trend, seasonals, \ncycles, and the regression effects due to predictor series. The components in the model are \nsupposed to capture the salient features of the series that are useful in explaining and \npredicting its behavior. Harvey (1989) is a good reference for time series modeling that uses \nthe UCMs. Harvey calls the components in a UCM the \"stylized facts\" about the series under \nconsideration. Traditionally, the ARIMA models and, to some limited extent, the exponential \nsmoothing models have been the main tools in the analysis of this type of time series data. \nIt is fair to say that the UCMs capture the versatility of the ARIMA models while possessing \nthe interpretability of the smoothing models. A thorough discussion of the correspondence \nbetween the ARIMA models and the UCMs, and the relative merits of UCM and ARIMA modeling, \nis given in Harvey (1989). The UCMs are also very similar to another set of models, called \nthe dynamic models, that are popular in the Bayesian time series literature (West and Harrison \n1999). In SAS/ETS you can use PROC ARIMA for ARIMA modeling, PROC ESM for exponential smoothing \nmodeling , and use the Time Series Forecasting System for a point-and-click interface to ARIMA \nand exponential smoothing modeling."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nSpecifies the name of the SAS data set containing the time series. If the DATA= option is \nnot specified in the PROC UCM statement, the most recently created SAS data set is used."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"NOPRINT","ProcedureOptionHelp":{"#cdata":"Turns off all the printing for the procedure. The subsequent print options in the procedure \nare ignored."},"ProcedureOptionType":"S"},{"ProcedureOptionName":"PLOTS=","ProcedureOptionHelp":{"#cdata":"Controls the plots produced with ODS Graphics. When you specify only one plot request, \nyou can omit the parentheses around the plot request.\n      \nSyntax: \nPLOTS<(global-plot-options)> <= plot-request <(options)>> \nPLOTS<(global-plot-options)> <= (plot-request <(options)> <... plot-request <(options)>>)> \n  \nThe following global-plot-option is supported: \n\n  NOCLM \n  suppresses the confidence limits in all the component and forecast plots."},"ProcedureOptionType":"S|V","ProcedureOptionValues":{"@Value1":"ALL","@Value2":"NONE","@Value3":"FILTER","@Value4":"RESIDUAL","@Value5":"SMOOTH"},"ProcedureOptionToolTips":{"@ToolTip1":"Produces all plots appropriate for the particular analysis.","@ToolTip2":"Suppresses all plots.","@ToolTip3":"Syntax: FILTER(<filter-plot-options>)                                  Produces time series plots of the filtered component estimates. The following filter-plot-options  are available:     ALL    produces all the filtered component estimate plots appropriate for the particular analysis.     LEVEL    produces a time series plot of the filtered level component estimate, provided the model    contains the level component.     SLOPE    produces a time series plot of the filtered slope component estimate, provided the model    contains the slope component.     CYCLE    produces time series plots of the filtered cycle component estimates for all cycle components    in the model, if there are any.     SEASON    produces time series plots of the filtered season component estimates for all seasonal    components in the model, if there are any.     DECOMP    produces time series plots of the filtered estimates of the series decomposition.","@ToolTip4":"Syntax: RESIDUAL(<residual-plot-options>)                                  Produces the residuals plots. The following residual-plot-options are available:     ALL    produces all the residual diagnostics plots appropriate for the particular analysis.     ACF    produces the autocorrelation plot of residuals.     CUSUM    produces the plot of cumulative residuals against time.     CUSUMSQ    produces the plot of cumulative squared residuals against time.     HISTOGRAM    produces the histogram of residuals.     LOESS    produces a scatter plot of residuals against time, which has an overlaid loess-fit.     PACF    produces the partial-autocorrelation plot of residuals.     PANEL    produces a summary panel of the residual diagnostics consisting of the following:       o histogram of residuals     o normal quantile plot of residuals     o the residual-autocorrelation-plot     o the residual-partial-autocorrelation-plot     QQ    produces a normal quantile plot of residuals.     RESIDUAL    produces a needle plot of residuals against time.     WN    produces the plot of Ljung-Box white-noise test p-values at different lags (in log scale).","@ToolTip5":"Syntax: SMOOTH(<smooth-plot-options>)                                  Produces time series plots of the smoothed component estimates. The following smooth-plot-options  are available:     ALL    produces all the smoothed component estimate plots appropriate for the particular analysis.     LEVEL    produces time series plot of the smoothed level component estimate, provided the model    contains the level component.     SLOPE    produces time series plot of the smoothed slope component estimate, provided the model    contains the slope component.     CYCLE    produces time series plots of the smoothed cycle component estimates for all cycle components    in the model, if there are any.     SEASON    produces time series plots of the smoothed season component estimates for all season components    in the model, if there are any.     DECOMP    produces time series plots of the smoothed estimates of the series decomposition."},"SubOptionsKeywords":"DECOMP|SEASON|CYCLE|SLOPE|LEVEL|ALL|WN|RESIDUAL|QQ|PANEL|PACF|LOESS|HISTOGRAM|CUSUMSQ|CUSUM|ACF|NOCLM"},{"ProcedureOptionName":"PRINTALL","ProcedureOptionHelp":{"#cdata":"Turns on all the printing options for the procedure. The subsequent NOPRINT options in the \nprocedure are ignored."},"ProcedureOptionType":"S"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"AUTOREG","StatementHelp":{"#cdata":"Syntax: AUTOREG <options> ; \n\nThe AUTOREG statement specifies an autoregressive component in the model. An autoregressive \ncomponent is a special case of cycle that corresponds to the frequency of zero or π. It is \nmodeled separately for easier interpretation."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"NOEST=","StatementOptionHelp":{"#cdata":"Fixes the values of ρ and ρ²γ to those specified in the RHO= and VARIANCE= options."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"RHO","@Value2":"VARIANCE","@Value3":"RHO VARIANCE)"},"StatementOptionToolTips":{"@ToolTip1":"Fixes the value of ρ to the one specified in the RHO= option.","@ToolTip2":"Fixes the value of ρ²γ to the one specified in the VARIANCE= option.","@ToolTip3":"Fixes the values of ρ and ρ²γ to those specified in the RHO= and VARIANCE= options."}},{"StatementOptionName":"PLOT=","StatementOptionHelp":{"#cdata":"Requests plotting of the filtered or smoothed estimate of the autoreg component."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FILTER","@Value2":"SMOOTH","@Value3":"(FILTER SMOOTH)"},"StatementOptionToolTips":{"@ToolTip1":"Requests plotting of the filtered estimate of the autoreg component.","@ToolTip2":"Requests plotting of the smoothed estimate of the autoreg component.","@ToolTip3":"Requests plotting of the filtered and smoothed estimates of the autoreg component."}},{"StatementOptionName":"PRINT=","StatementOptionHelp":{"#cdata":"Requests printing of the filtered or smoothed estimate of the autoreg component."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FILTER","@Value2":"SMOOTH","@Value3":"(FILTER SMOOTH)"},"StatementOptionToolTips":{"@ToolTip1":"Requests printing of the filtered estimate of the autoreg component.","@ToolTip2":"Requests printing of the smoothed estimate of the autoreg component.","@ToolTip3":"Requests printing of the filtered and smoothed estimates of the autoreg component."}},{"StatementOptionName":"RHO=","StatementOptionHelp":{"#cdata":"[Syntax: RHO=value] \n          \nSpecifies an initial value for the damping factor ρ during the parameter estimation process. \nThe value of ρ must be in the interval (–1, 1), including –1 but excluding 1."},"StatementOptionType":"V"},{"StatementOptionName":"VARIANCE=","StatementOptionHelp":{"#cdata":"[Syntax: VARIANCE=value] \n            \nSpecifies an initial value for the disturbance variance, ρ²γ, during the parameter \nestimation process. Any nonnegative value, including zero, is an acceptable starting \nvalue."},"StatementOptionType":"V"}]}},{"StatementName":"BLOCKSEASON","StatementHelp":{"#cdata":"Syntax: BLOCKSEASON NBLOCKS = integer BLOCKSIZE = integer <options> ; \n\nThe BLOCKSEASON or BLOCKSEASONAL statement is used to specify a seasonal component γt that \nhas a special block structure. The seasonal γt is called a block seasonal of block size m \nand number of blocks k if its season length, s, can be factored as s=m*k and its seasonal effects \nhave a block form—that is, the first m seasonal effects are all equal to some number τ-1, the \nnext m effects are all equal to some number τ-2, and so on."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"BLOCKSIZE=","StatementOptionHelp":{"#cdata":"[Syntax: BLOCKSIZE=integer] \n          \nSpecifies the block size, m. This is a required option in this statement. The block size \ncan be any integer larger than or equal to two. Typical examples of block sizes are 24, \ncorresponding to the hours of the day when a day is being used as a block in hourly data, \nor 60, corresponding to the minutes in an hour when an hour is being used as a block in \ndata recorded by minutes, etc."},"StatementOptionType":"V"},{"StatementOptionName":"NBLOCKS=","StatementOptionHelp":{"#cdata":"[Syntax: NBLOCKS=integer] \n          \nSpecifies the number of blocks, k. This is a required option in this statement. The number \nof blocks can be any integer greater than or equal to two."},"StatementOptionType":"V"},{"StatementOptionName":"NOEST","StatementOptionHelp":{"#cdata":"Specifies the value of the disturbance variance parameter to the value specified in the \nVARIANCE= option."},"StatementOptionType":"S"},{"StatementOptionName":"OFFSET=","StatementOptionHelp":{"#cdata":"[Syntax: OFFSET=integer] \n          \nSpecifies the position of the first measurement within the block, if the first measurement \nis not at the start of a block. The OFFSET= value must be between one and the block size. \nThe default value is one. The first measurement refers to the start of the estimation span \nand the forecast span. If these spans differ, their starting measurements must be separated \nby an integer multiple of the block size."},"StatementOptionType":"V"},{"StatementOptionName":"PLOT=","StatementOptionHelp":{"#cdata":"Requests plots of the season component. When you specify only one plot request, you can omit the parentheses around the plot request."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FILTER","@Value2":"SMOOTH","@Value3":"F_ANNUAL","@Value4":"S_ANNUAL","@Value5":"(<FILTER> <SMOOTH> <F_ANNUAL> <S_ANNUAL>)"},"StatementOptionToolTips":{"@ToolTip1":"Requests plot of the filtered estimates of the season component, γt.","@ToolTip2":"Requests plot of the smoothed estimates of the season component, γt.","@ToolTip3":"Requests plot of the \"annual\" variation in the filtered estimates of the season component, γt.","@ToolTip4":"Requests plot of the \"annual\" variation in the smoothed estimates of the season component, γt.","@ToolTip5":"Requests plots for a combination of FILTER, SMOOTH, F_ANNUAL, and S_ANNUAL plot-requests."}},{"StatementOptionName":"PRINT=","StatementOptionHelp":{"#cdata":"Requests printing of the filtered or smoothed estimate of the block season component, γt."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FILTER","@Value2":"SMOOTH","@Value3":"(FILTER SMOOTH)"},"StatementOptionToolTips":{"@ToolTip1":"Requests printing of the filtered estimate of the block season component, γt.","@ToolTip2":"Requests printing of the smoothed estimate of the block season component, γt.","@ToolTip3":"Requests printing of the filtered and smoothed estimates of the block season component, γt."}},{"StatementOptionName":"TYPE=","StatementOptionHelp":{"#cdata":"Specifies the type of the block seasonal component. The default type is DUMMY."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"DUMMY","@Value2":"TRIG"},"StatementOptionToolTips":{"@ToolTip1":"DUMMY [No description available]","@ToolTip2":"TRIG [No description available]"}},{"StatementOptionName":"VARIANCE=","StatementOptionHelp":{"#cdata":"[Syntax: VARIANCE=value] \n          \nSpecifies an initial value for the disturbance variance, σ²ω, in the γt equation \nat the start of the parameter estimation process. Any nonnegative value, including \nzero, is an acceptable starting value."},"StatementOptionType":"V"}]}},{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY variables ; \n\nA BY statement can be used in the UCM procedure to process a data set in groups of observations \ndefined by the BY variables. The model specified using the MODEL and other component statements \nis applied to all the groups defined by the BY variables. When a BY statement appears, the procedure \nexpects the input data set to be sorted in order of the BY variables. The variables are one or more \nvariables in the input data set."},"StatementOptions":null},{"StatementName":"CYCLE","StatementHelp":{"#cdata":"Syntax: CYCLE <options> ; \nThe CYCLE statement is used to specify a cycle component, ψt, in the model. There can be multiple cycles\nin a model, each specified using a separate CYCLE statement."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"NOEST=","StatementOptionHelp":{"#cdata":"Fixes the values of the component parameters to those specified in the RHO=, PERIOD=, and \nVARIANCE= options. This option enables you to fix any combination of parameter values."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"PERIOD","@Value2":"RHO","@Value3":"VARIANCE","@Value4":"<PERIODZ> <RHO> <VARIANCE>)"},"StatementOptionToolTips":{"@ToolTip1":"Fixes the value of period to the one specified in the PERIOD= option.","@ToolTip2":"Fixes the value of ρ to the one specified in the RHO= option.","@ToolTip3":"Fixes the value of γ to the one specified in the VARIANCE= option.","@ToolTip4":"Fixes the values of period, ρ and/or variance to those specified in the RHO= and VARIANCE= options."}},{"StatementOptionName":"PERIOD=","StatementOptionHelp":{"#cdata":"[Syntax: PERIOD=value] \n          \nSpecifies an initial value for the cycle period during the parameter estimation process. \nPeriod value must be strictly greater than 2."},"StatementOptionType":"V"},{"StatementOptionName":"PLOT=","StatementOptionHelp":{"#cdata":"Requests plotting of the filtered or smoothed estimate of the cycle component."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FILTER","@Value2":"SMOOTH","@Value3":"(FILTER SMOOTH)"},"StatementOptionToolTips":{"@ToolTip1":"Requests plotting of the filtered estimate of the cycle component.","@ToolTip2":"Requests plotting of the smoothed estimate of the cycle component.","@ToolTip3":"Requests plotting of the filtered and smoothed estimates of the cycle component."}},{"StatementOptionName":"PRINT=","StatementOptionHelp":{"#cdata":"Requests printing of the filtered or smoothed estimate of the cycle component ψt."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FILTER","@Value2":"SMOOTH","@Value3":"(FILTER SMOOTH)"},"StatementOptionToolTips":{"@ToolTip1":"Requests printing of the filtered estimate of the cycle component ψt.","@ToolTip2":"Requests printing of the smoothed estimate of the cycle component ψt.","@ToolTip3":"Requests printing of the filtered and smoothed estimates of the cycle component ψt."}},{"StatementOptionName":"RHO=","StatementOptionHelp":{"#cdata":"[Syntax: RHO=value] \n          \nSpecifies an initial value for the damping factor ρ during the parameter estimation process. Any value\nof ρ in the interval (0, 1), including 1 but excluding zero, is an acceptable initial value for the damping factor."},"StatementOptionType":"V"},{"StatementOptionName":"VARIANCE=","StatementOptionHelp":{"#cdata":"[Syntax: VARIANCE=value] \n          \nSpecifies an initial value for the disturbance variance, σ²v, to be used during the \nparameter estimation process. Any nonnegative value, including zero, is an acceptable \nstarting value."},"StatementOptionType":"V"}]}},{"StatementName":"DEPLAG","StatementHelp":{"#cdata":"Syntax: DEPLAG LAGS = order <PHI = value ...> <NOEST> ; \n\nThe DEPLAG statement is used to specify the lags of the dependent variable to be included as\npredictors in the model."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"LAGS=","StatementOptionHelp":{"#cdata":"[Syntax: LAGS=order | LAGS=(lag, ..., lag ) ...(lag, ..., lag )] \n          \nIs a required option in this statement. LAGS=(l1, l2,..., lk) defines a model with \nspecified lags of the dependent variable included as predictors. LAGS=order is equivalent \nto LAGS=(1, 2, ..., order ). \n\nA concatenation of parenthesized lists specifies a factored model.\n"},"StatementOptionType":"V"},{"StatementOptionName":"NOEST","StatementOptionHelp":{"#cdata":"Fixes the values of the parameters to those specified in PHI= option."},"StatementOptionType":"S"},{"StatementOptionName":"PHI=","StatementOptionHelp":{"#cdata":"[Syntax: PHI=value ...] \n          \nLists starting values for the coefficients of the lagged dependent variable. The order \nof the values listed corresponds with the order of the lags specified in the LAGS= option."},"StatementOptionType":"V"}]}},{"StatementName":"ESTIMATE","StatementHelp":{"#cdata":"Syntax: ESTIMATE <options> ; \n\nThe ESTIMATE statement is an optional statement used to control the overall model-fitting environment.\nUsing this statement, you can control the span of observations used to fit the model by using the \nSKIPFIRST= and BACK= options. This can be useful in model diagnostics. You can request a variety of \ngoodness-of-fit statistics and other model diagnostic information including different residual diagnostic\nplots. Note that the ESTIMATE statement is not used to control the nonlinear optimization process itself.\nThat is done using the NLOPTIONS statement."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"BACK=|SKIPLAST=","StatementOptionHelp":{"#cdata":"[Syntax: BACK=integer] \n          \nIndicates that some ending part of the data needs to be ignored during the parameter estimation. \nThis can be useful when you want to study the forecasting performance of a model on the observed \ndata. BACK=10 results in skipping the last 10 measurements of the response series during the \nparameter estimation. The default is BACK=0."},"StatementOptionType":"V"},{"StatementOptionName":"EXTRADIFFUSE=","StatementOptionHelp":{"#cdata":"[Syntax: EXTRADIFFUSE=k] \n          \nEnables continuation of the diffuse filtering iterations for k additional iterations beyond the \nfirst instance where the initialization of the diffuse state would have otherwise taken place. \nIf the specified k is larger than the sample size, the diffuse iterations continue until the end \nof the sample. Note that one-step-ahead residuals are produced only after the diffuse state is \ninitialized. Delaying the initialization leads to a reduction in the number of one-step-ahead \nresiduals available for computing the residual diagnostic measures. This option is useful when \nyou want to ignore the first few one-step-ahead residuals that often have large variance."},"StatementOptionType":"V"},{"StatementOptionName":"NOPROFILE","StatementOptionHelp":{"#cdata":"Requests that the usual likelihood be optimized for parameter estimation."},"StatementOptionType":"S"},{"StatementOptionName":"OUTEST=","StatementOptionHelp":{"#cdata":"[Syntax: OUTEST=SAS-data-set] \n          \nSpecifies an output data set for the estimated parameters."},"StatementOptionType":"DV"},{"StatementOptionName":"PLOT=","StatementOptionHelp":{"#cdata":"Requests different residual diagnostic plots."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"ACF","@Value2":"CUSUM","@Value3":"CUSUMSQ","@Value4":"MODEL","@Value5":"HISTOGRAM","@Value6":"LOESS","@Value7":"PACF","@Value8":"PANEL","@Value9":"QQ","@Value10":"RESIDUAL","@Value11":"WN"},"StatementOptionToolTips":{"@ToolTip1":"Produces the residual-autocorrelation plot.","@ToolTip2":"Produces the plot of cumulative residuals against time.","@ToolTip3":"Produces the plot of cumulative squared residuals against time.","@ToolTip4":"Produces the plot of one-step-ahead forecasts in the estimation span.","@ToolTip5":"Produces the histogram of residuals.","@ToolTip6":"Produces a scatter plot of residuals against time, which has an overlaid loess-fit.","@ToolTip7":"Produces the residual-partial-autocorrelation plot.","@ToolTip8":"Produces a summary panel of the residual diagnostics consisting of:     o histogram of residuals   o normal quantile plot of residuals    o the residual-autocorrelation-plot    o the residual-partial-autocorrelation-plot","@ToolTip9":"Produces a normal quantile plot of residuals.","@ToolTip10":"Produces a needle plot of residuals against time.","@ToolTip11":"Produces a plot of p-values, in log-scale, at different lags for the Ljung-Box portmanteau  white noise test statistics."}},{"StatementOptionName":"PRINT=NONE","StatementOptionHelp":{"#cdata":"Suppresses all the printed output related to the model fitting, such as the parameter estimates, \nthe goodness-of-fit statistics, and so on."},"StatementOptionType":"V"},{"StatementOptionName":"PROFILE","StatementOptionHelp":{"#cdata":"Requests that the profile likelihood, obtained by concentrating out one of the disturbance \nvariances from the likelihood, be optimized for parameter estimation. By default, the profile \nlikelihood is not optimized if any of the disturbance variance parameters is held fixed to a \nnonzero value."},"StatementOptionType":"S"},{"StatementOptionName":"SKIPFIRST=","StatementOptionHelp":{"#cdata":"[Syntax: SKIPFIRST=integer] \n          \nIndicates that some early part of the data needs to be ignored during the parameter \nestimation. This can be useful if there is a reason to believe that the model being \nestimated is not appropriate for this portion of the data. SKIPFIRST=10 results in \nskipping the first 10 measurements of the response series during the parameter \nestimation. The default is SKIPFIRST=0."},"StatementOptionType":"V"}]}},{"StatementName":"FORECAST","StatementHelp":{"#cdata":"Syntax: FORECAST <options> ; \n\nThe FORECAST statement is an optional statement that is used to specify the overall \nforecasting environment for the specified model. It can be used to specify the span \nof observations, the historical period, to use to compute the forecasts of the future \nobservations. This is done using the SKIPFIRST= and BACK= options. The number of periods \nto forecast beyond the historical period, and the significance level of the forecast\nconfidence interval, is specified using the LEAD= and ALPHA= options. You can request \none-step-ahead series and component forecasts by using the PRINT= option. You can save \nthe series forecasts, and the model-based decomposition of the series, in a data set \nby using the OUTFOR= option."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=value] \n          \nSpecifies the significance level of the forecast confidence intervals; for example, ALPHA=0.05, \nwhich is the default, results in a 95% confidence interval."},"StatementOptionType":"V"},{"StatementOptionName":"BACK=|SKIPLAST=","StatementOptionHelp":{"#cdata":"[Syntax: BACK=integer] \n          \nSpecifies the holdout sample for the evaluation of the forecasting performance of the model. \nFor example, BACK=10 results in treating the last 10 observed values of the response series \nas unobserved. A post-sample-prediction-analysis table is produced for comparing the predicted \nvalues with the actual values in the holdout period. The default is BACK=0."},"StatementOptionType":"V"},{"StatementOptionName":"EXTRADIFFUSE=","StatementOptionHelp":{"#cdata":"[Syntax: EXTRADIFFUSE=k] \n          \nEnables continuation of the diffuse filtering iterations for k additional iterations beyond \nthe first instance where the initialization of the diffuse state would have otherwise taken \nplace. If the specified k is larger than the sample size, the diffuse iterations continue \nuntil the end of the sample."},"StatementOptionType":"V"},{"StatementOptionName":"LEAD=","StatementOptionHelp":{"#cdata":"[Syntax: LEAD=integer] \n          \nSpecifies the number of periods to forecast beyond the historical period defined by the \nSKIPFIRST= and BACK= options; for example, LEAD=10 results in the forecasting of 10 future \nvalues of the response series. The default is LEAD=12."},"StatementOptionType":"V"},{"StatementOptionName":"OUTFOR=","StatementOptionHelp":{"#cdata":"[Syntax: OUTFOR=SAS-data-set] \n          \nSpecifies an output data set for the forecasts. The output data set contains the ID variable \n(if specified), the response and predictor series, the one-step-ahead and out-of-sample response \nseries forecasts, the forecast confidence intervals, the smoothed values of the response series, \nand the smoothed forecasts produced as a result of the model-based decomposition of the series."},"StatementOptionType":"DV"},{"StatementOptionName":"PLOT=","StatementOptionHelp":{"#cdata":"Requests forecast and model decomposition plots."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"DECOMP","@Value2":"DECOMPVAR","@Value3":"FDECOMP","@Value4":"FDECOMPVAR","@Value5":"FORECASTS","@Value6":"TREND","@Value7":"(<DECOMP> <DECOMPVAR> <FDECOMP> <FDECOMPVAR> <FORECASTS> <TREND>)"},"StatementOptionToolTips":{"@ToolTip1":"Provides plot of the decomposition estimates.","@ToolTip2":"Provides plot of the variance of model decomposition estimates.","@ToolTip3":"Provides plot for the filtered decomposition estimates.","@ToolTip4":"Provides plot for the filtered decomposition estimates and their variances.","@ToolTip5":"Provides plot of the series forecasts.","@ToolTip6":"Provides plot of the smoothed trend.","@ToolTip7":"Requests a combination of forecast and model decomposition plots."}},{"StatementOptionName":"PRINT=","StatementOptionHelp":{"#cdata":"Controls the printing of the series forecasts and the printing of smoothed model decomposition \nestimates. By default, the series forecasts are printed only for the forecast horizon specified \nby the LEAD= option; that is, the one-step-ahead predicted values are not printed."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"DECOMP","@Value2":"FDECOMP","@Value3":"FORECASTS","@Value4":"NONE","@Value5":"(<DECOMP> <FDECOMP> <FORECASTS>)"},"StatementOptionToolTips":{"@ToolTip1":"Prints smoothed estimates of the following effects: trend, trend plus regression, trend plus  regression plus cycle, and sum of all components except the irregular.","@ToolTip2":"Prints filtered estimates of DECOMP effects.","@ToolTip3":"Requests printing of forecasts for the entire forecast span.","@ToolTip4":"Suppresses the printing of all the forecast output.","@ToolTip5":"Requests a combination of print options."}},{"StatementOptionName":"SKIPFIRST=","StatementOptionHelp":{"#cdata":"[Syntax: SKIPFIRST=integer] \n          \nIndicates that some early part of the data needs to be ignored during the forecasting \ncalculations. This can be useful if there is a reason to believe that the model being \nused for forecasting is not appropriate for this portion of the data. SKIPFIRST=10 \nresults in skipping the first 10 measurements of the response series during the forecast \ncalculations. The default is SKIPFIRST=0."},"StatementOptionType":"V"}]}},{"StatementName":"ID","StatementHelp":{"#cdata":"Syntax: ID variable INTERVAL=value <ALIGN=value> ;\n      \nThe ID statement names a numeric variable that identifies observations in the input and \noutput data sets. The ID variable’s values are assumed to be SAS date, time, or datetime \nvalues. In addition, the ID statement specifies the frequency associated with the time \nseries."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ALIGN=","StatementOptionHelp":{"#cdata":"Controls the alignment of SAS dates used to identify output observations. The ALIGN= option \nis used to align the ID variable with the beginning, middle, or end of the time ID interval \nspecified by the INTERVAL= option."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BEGINNING","@Value2":"MIDDLE","@Value3":"ENDING"},"StatementOptionToolTips":{"@ToolTip1":"Aligns the ID variable with the beginning of the time ID interval specified by the INTERVAL= option.","@ToolTip2":"Aligns the ID variable with the middle of the time ID interval specified by the INTERVAL= option.","@ToolTip3":"Aligns the ID variable with the end of the time ID interval specified by the INTERVAL= option."}},{"StatementOptionName":"INTERVAL=","StatementOptionHelp":{"#cdata":"Specifies the time interval between observations. This option is required in the ID statement."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"DAY","@Value2":"HOUR","@Value3":"MINUTE","@Value4":"SECOND","@Value5":"WEEK","@Value6":"MONTH","@Value7":"YEAR","@Value8":"QTR","@Value9":"TENDAY","@Value10":"SEMIMONTH","@Value11":"SEMIYEAR"},"StatementOptionToolTips":{"@ToolTip1":"DAY interval","@ToolTip2":"HOUR interval","@ToolTip3":"MINUTE interval","@ToolTip4":"SECOND interval","@ToolTip5":"WEEK interval","@ToolTip6":"MONTH interval","@ToolTip7":"YEAR interval","@ToolTip8":"QTR interval","@ToolTip9":"TENDAY interval","@ToolTip10":"SEMIMONTH interval","@ToolTip11":"SEMIYEAR interval"}}]}},{"StatementName":"IRREGULAR","StatementHelp":{"#cdata":"Syntax: IRREGULAR <options> ; \n\nThe IRREGULAR statement includes an irregular component in the model. There can be \nat most one IRREGULAR statement in the model specification. The irregular component \ncorresponds to the overall random error, εt, in the model. By default the irregular \ncomponent is modeled as white noise—that is, as a sequence of independent, identically \ndistributed, zero-mean, Gaussian random variables. However, you can also model it as \nan autoregressive moving-average (ARMA) \nprocess."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"NOEST","StatementOptionHelp":{"#cdata":"Fixes the value of σ²ε to the value specified in the VARIANCE= option."},"StatementOptionType":"S"},{"StatementOptionName":"PLOT=","StatementOptionHelp":{"#cdata":"Requests plotting of the filtered or smoothed estimate of the irregular component."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FILTER","@Value2":"SMOOTH","@Value3":"(<FILTER> <SMOOTH>)"},"StatementOptionToolTips":{"@ToolTip1":"Requests plotting of the filtered estimate of the irregular component.","@ToolTip2":"Requests plotting of the smoothed estimate of the irregular component.","@ToolTip3":"Requests plotting of the filtered and smoothed estimates of the irregular component."}},{"StatementOptionName":"PRINT=","StatementOptionHelp":{"#cdata":"Requests printing of the filtered or smoothed estimate of the irregular component."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FILTER","@Value2":"SMOOTH","@Value3":"(<FILTER> <SMOOTH>)"},"StatementOptionToolTips":{"@ToolTip1":"Requests printing of the filtered estimate of the irregular component.","@ToolTip2":"Requests printing of the smoothed estimate of the irregular component.","@ToolTip3":"Requests printing of the filtered and smoothed estimates of the irregular component."}},{"StatementOptionName":"VARIANCE=","StatementOptionHelp":{"#cdata":"[Syntax: VARIANCE=value] \n          \nSpecifies an initial value for σ²є during the parameter estimation process. \nAny nonnegative value, including zero, is an acceptable starting value."},"StatementOptionType":"V"},{"StatementOptionName":"AR=","StatementOptionHelp":{"#cdata":"[Syntax: AR= Φ-1 Φ-2 ...Φ-p] \n          \n[ARMA Specification Option]\n\nLists the starting values of the coefficients of a nonseasonal autoregressive polynomial."},"StatementOptionType":"V"},{"StatementOptionName":"MA=","StatementOptionHelp":{"#cdata":"[Syntax: MA= θ-1 θ-2 ...θ-q] \n          \n[ARMA Specification Option]\n\nLists the starting values of the coefficients of a nonseasonal moving-average polynomial."},"StatementOptionType":"V"},{"StatementOptionName":"NOEST=","StatementOptionHelp":{"#cdata":"[Syntax: NOEST=(&lt;VARIANCE&gt; &lt;AR&gt; &lt;SAR&gt; &lt;MA&gt; &lt;SMA&gt;)] \n          \n[ARMA Specification Option]\n\nFixes the values of the ARMA parameters and the value of the white noise variance to those \nspecified in the AR=, SAR=, MA=, SMA=, or VARIANCE= options."},"StatementOptionType":"V"},{"StatementOptionName":"P=","StatementOptionHelp":{"#cdata":"[Syntax: P=integer] \n          \n[ARMA Specification Option]\n\nSpecifies the order of the nonseasonal autoregressive polynomial. The order can be any \nnonnegative integer; the default value is 0. In practice the order is a small integer \nsuch as 1, 2, or 3."},"StatementOptionType":"V"},{"StatementOptionName":"Q=","StatementOptionHelp":{"#cdata":"[Syntax: Q=integer] \n          \n[ARMA Specification Option]\n\nSpecifies the order of the nonseasonal moving-average polynomial. The order can be any \nnonnegative integer; the default value is 0. In practice the order is a small integer \nsuch as 1, 2, or 3."},"StatementOptionType":"V"},{"StatementOptionName":"S=","StatementOptionHelp":{"#cdata":"[Syntax: S=integer] \n          \n[ARMA Specification Option]\n\nSpecifies the season length used during the specification of the seasonal autoregressive \nor seasonal moving-average polynomial. The season length can be any positive integer; for \nexample, S=4 might be an appropriate value for a quarterly series. The default value is S=1."},"StatementOptionType":"V"},{"StatementOptionName":"SAR=","StatementOptionHelp":{"#cdata":"[Syntax: SAR= Φ-1 ph-2 ...Φ-P] \n          \n[ARMA Specification Option]\n\nLists the starting values of the coefficients of a seasonal autoregressive polynomial."},"StatementOptionType":"V"},{"StatementOptionName":"SMA=","StatementOptionHelp":{"#cdata":"[Syntax: SMA= θ-1 θ-2 ...θ-Q] \n          \n[ARMA Specification Option]\n\nLists the starting values of the coefficients of a seasonal moving-average polynomial."},"StatementOptionType":"V"},{"StatementOptionName":"SP=","StatementOptionHelp":{"#cdata":"[Syntax: SP=integer] \n          \n[ARMA Specification Option]\n\nSpecifies the order of the seasonal autoregressive polynomial. The order can be any nonnegative \ninteger; the default value is 0. In practice the order is a small integer such as 1 or 2."},"StatementOptionType":"V"},{"StatementOptionName":"SQ=","StatementOptionHelp":{"#cdata":"[Syntax: SQ=integer] \n          \n[ARMA Specification Option]\n\nSpecifies the order of the seasonal moving-average polynomial. The order can be any nonnegative \ninteger; the default value is 0. In practice the order is a small integer such as 1 or 2."},"StatementOptionType":"V"}],"#comment":{}}},{"StatementName":"LEVEL","StatementHelp":{"#cdata":"Syntax: LEVEL <options> ; \n      \nThe LEVEL statement is used to include a level component in the model. The level component, \neither by itself or together with a slope component (see the SLOPE statement), forms the trend \ncomponent, µt, of the model."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"CHECKBREAK","StatementOptionHelp":{"#cdata":"Turns on the checking of breaks in the level component."},"StatementOptionType":"S"},{"StatementOptionName":"NOEST","StatementOptionHelp":{"#cdata":"Fixes the value of σ²η to the value specified in the VARIANCE= option."},"StatementOptionType":"S"},{"StatementOptionName":"PLOT=","StatementOptionHelp":{"#cdata":"Requests plotting of the filtered or smoothed estimate of the level component."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FILTER","@Value2":"SMOOTH","@Value3":"(<FILTER> <SMOOTH>)"},"StatementOptionToolTips":{"@ToolTip1":"Requests plotting of the filtered estimate of the level component.","@ToolTip2":"Requests plotting of the smoothed estimate of the level component.","@ToolTip3":"Requests plotting of the filtered and smoothed estimates of the level component."}},{"StatementOptionName":"PRINT=","StatementOptionHelp":{"#cdata":"Requests printing of the filtered or smoothed estimate of the irregular component."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FILTER","@Value2":"SMOOTH","@Value3":"(<FILTER> <SMOOTH>)"},"StatementOptionToolTips":{"@ToolTip1":"Requests printing of the filtered estimate of the level component.","@ToolTip2":"Requests printing of the smoothed estimate of the level component.","@ToolTip3":"Requests printing of the filtered and smoothed estimates of the level component."}},{"StatementOptionName":"VARIANCE=","StatementOptionHelp":{"#cdata":"[Syntax: VARIANCE=value] \n          \nSpecifies an initial value for σ²η, the disturbance variance in the µt equation at the \nstart of the parameter estimation process. Any nonnegative value, including zero, is an \nacceptable starting value."},"StatementOptionType":"V"}]}},{"StatementName":"MODEL","StatementHelp":{"#cdata":"Syntax: MODEL dependent <= regressors> ; \n\nThe MODEL statement specifies the response variable and, optionally, the predictor or \nregressor variables for the UCM model. This is a required statement in the UCM procedure. \nThe predictors specified in the MODEL statement are assumed to have a linear and time-invariant \nrelationship with the response. The predictors that have time-varying regression coefficients \nare specified separately in the RANDOMREG statement. Similarly, the predictors that have a \nnonlinear effect on the response variable are specified separately in the SPLINEREG statement. \nOnly one MODEL statement can be specified."},"StatementOptions":null},{"StatementName":"NLOPTIONS","StatementHelp":{"#cdata":"Syntax: NLOPTIONS <options> ; \n\nPROC UCM uses the nonlinear optimization (NLO) subsystem to perform the nonlinear \noptimization of the likelihood function during the estimation of model parameters. \nYou can use the NLOPTIONS statement to control different aspects of this optimization \nprocess. For most problems the default settings of the optimization process are \nadequate. However, in some cases it might be useful to change the optimization \ntechnique or to change the maximum number of iterations. This can be done by using \nthe TECH= and MAXITER= options in the NLOPTIONS statement as follows: \n\n  nloptions tech=dbldog maxiter=200;"},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ABSCONV=|ABSTOL=","StatementOptionHelp":{"#cdata":"[Syntax: ABSCONV= | ABSTOL=r] \n          \nSpecifies an absolute function convergence criterion. The default value of r is the negative \nsquare root of the largest double-precision value, which serves only as a protection against \noverflows."},"StatementOptionType":"V"},{"StatementOptionName":"ABSFCONV=|ABSFTOL=","StatementOptionHelp":{"#cdata":"[Syntax: ABSFCONV=r[n] | ABSFTOL=r[n]] \n          \nSpecifies an absolute function convergence criterion. The default value is r=0. The optional \ninteger value n specifies the number of successive iterations for which the criterion must be \nsatisfied before the process can be terminated."},"StatementOptionType":"V"},{"StatementOptionName":"ABSGCONV=|ABSGTOL=","StatementOptionHelp":{"#cdata":"[Syntax: ABSGCONV=r[n] | ABSGTOL=r[n]] \n          \nSpecifies an absolute gradient convergence criterion. The default value is r=1E-5. \nThe optional integer value n specifies the number of successive iterations for which \nthe criterion must be satisfied before the process can be terminated."},"StatementOptionType":"V"},{"StatementOptionName":"ABSXCONV=|ABSXTOL=","StatementOptionHelp":{"#cdata":"[Syntax: ABSXCONV= | ABSXTOL=r[n]] \n          \nSpecifies the absolute parameter convergence criterion. The default is r=1E-8 for the \nNMSIMP technique and r=0 otherwise. The optional integer value n specifies the number of \nsuccessive iterations for which the criterion must be satisfied before the process can \nterminate."},"StatementOptionType":"V"},{"StatementOptionName":"DAMPSTEP=","StatementOptionHelp":{"#cdata":"[Syntax: DAMPSTEP<=r>] \n          \nSpecifies that the initial step length value a⁰ for each line search (used by the QUANEW, \nHYQUAN, CONGRA, or NEWRAP technique) cannot be larger than r times the step length value used \nin the former iteration. If the DAMPSTEP option is specified but r is not specified, the default \nis r=2. The DAMPSTEP=r option can prevent the line-search algorithm from repeatedly stepping into\nregions where some objective functions are difficult to compute or where they could lead to floating \npoint overflows during the computation of objective functions and their derivatives. The DAMPSTEP=r \noption can save time-costly function calls during the line searches of objective functions that \nresult in very small steps."},"StatementOptionType":"S|V"},{"StatementOptionName":"FCONV=|FTOL=","StatementOptionHelp":{"#cdata":"[Syntax: FCONV= | FTOL=r[n]] \n          \nSpecifies a relative function convergence criterion."},"StatementOptionType":"V"},{"StatementOptionName":"FCONV2=|FTOL2=","StatementOptionHelp":{"#cdata":"[Syntax: FCONV2= | FTOL2=r[n]] \n          \nSpecifies another function convergence criterion."},"StatementOptionType":"V"},{"StatementOptionName":"FSIZE=","StatementOptionHelp":{"#cdata":"[Syntax:FSIZE=r] \n          \nSpecifies the FSIZE parameter of the relative function and relative gradient termination \ncriteria. The default value is r=0."},"StatementOptionType":"V"},{"StatementOptionName":"GCONV=|GTOL=","StatementOptionHelp":{"#cdata":"[Syntax: GCONV=r | GTOL=r] \n          \nSpecifies a relative gradient convergence criterion. The default value is r=1E-8. \nThe optional integer value n specifies the number of successive iterations for which \nthe criterion must be satisfied before the process can terminate."},"StatementOptionType":"V"},{"StatementOptionName":"HESCAL=|HS=","StatementOptionHelp":{"#cdata":"Specifies the scaling version of the Hessian matrix used in NRRIDG, TRUREG, NEWRAP, or \nDBLDOG optimization."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"0","@Value2":"1","@Value3":"2","@Value4":"3"},"StatementOptionToolTips":{"@ToolTip1":"Specifies that no scaling is done.","@ToolTip2":"Specifies the Moré (1978) scaling update","@ToolTip3":"Specifies the Dennis, Gay, and Welsch (1981) scaling update","@ToolTip4":"Specifies that di is reset in each iteration"}},{"StatementOptionName":"INHESSIAN=|INHESS=","StatementOptionHelp":{"#cdata":"[Syntax: INHESSIAN[=r]] \n          \nSpecifies how the initial estimate of the approximate Hessian is defined for the \nquasi-Newton techniques QUANEW and DBLDOG."},"StatementOptionType":"S|V"},{"StatementOptionName":"INSTEP=","StatementOptionHelp":{"#cdata":"[Syntax: INSTEP=r] \n          \nReduces the length of the first trial step during the line search of the first iterations."},"StatementOptionType":"V"},{"StatementOptionName":"LINESEARCH=|LIS=","StatementOptionHelp":{"#cdata":"[Syntax: LINESEARCH= | LIS=i] \n          \n Specifies the line-search method for the CONGRA, QUANEW, and NEWRAP optimization techniques."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"1","@Value2":"2","@Value3":"3","@Value4":"4","@Value5":"5","@Value6":"6","@Value7":"7","@Value8":"8"},"StatementOptionToolTips":{"@ToolTip1":"Specifies a line-search method that needs the same number of function and gradient calls  for cubic interpolation and cubic extrapolation; this method is similar to one used by  the Harwell subroutine library.","@ToolTip2":"Specifies a line-search method that needs more function calls than gradient calls for quadratic  and cubic interpolation and cubic extrapolation; this method is implemented as shown in Fletcher  (1987) and can be modified to an exact line search by using the LSPRECISION= option.","@ToolTip3":"Specifies a line-search method that needs the same number of function and gradient calls for  cubic interpolation and cubic extrapolation; this method is implemented as shown in Fletcher  (1987) and can be modified to an exact line search by using the LSPRECISION= option.","@ToolTip4":"Specifies a line-search method that needs the same number of function and gradient calls for  stepwise extrapolation and cubic interpolation","@ToolTip5":"Specifies a line-search method that is a modified version of LIS=4.","@ToolTip6":"Specifies golden section line search (Polak 1971), which uses only function values for linear  approximation.","@ToolTip7":"Specifies bisection line search (Polak 1971), which uses only function values for linear  approximation.","@ToolTip8":"Specifies Armijo line-search technique (Polak 1971), which uses only function values for  linear approximation."}},{"StatementOptionName":"LSPRECISION=|LSP=","StatementOptionHelp":{"#cdata":"[Syntax: LSPRECISION= | LSP=r] \n          \nSpecifies the degree of accuracy that should be obtained by the line-search algorithms \nLIS=2 and LIS=3. The default LSPRECISION= values are: \n\n  o For TECH=QUANEW UPDATE=DBFGS, BFGS: r = 0.4\n  o For TECH=QUANEW UPDATE=DDFP, DFP: r = 0.06 \n  o For TECH=CONGRA UPDATE=all r = 0.1\n  o For TECH=NEWRAP NO UPDATE: r = 0.9"},"StatementOptionType":"V"},{"StatementOptionName":"MAXFUNC=|MAXFU=","StatementOptionHelp":{"#cdata":"[Syntax: MAXFUNC= | MAXFU=i] \n          \nRequires the number of function calls to be no larger than i. The default values are: \n\n  o For TECH= TRUREG, NRRIDG, NEWRAP: i=125 \n  o For TECH= DBLDOG, QUANEW: i=500 \n  o For TECH= CONGRA: i=1000\n  o For TECH= NMSIMP: i=3000 \n  \nNote that the optimization can terminate only after completing a full iteration. \nTherefore, the number of function calls that is actually performed can exceed the \nnumber that is specified by the MAXFUNC= option."},"StatementOptionType":"V"},{"StatementOptionName":"MAXITER=|MAXIT=","StatementOptionHelp":{"#cdata":"[Syntax: MAXITER= | MAXIT=i[n]] \n          \n Requires the number of iterations to be no larger than i. The default values are: \n \n  o For TECH= TRUREG, NRRIDG, NEWRAP: i=50 \n  o For TECH= QUANEW, DBLDOG: i=200 \n  o For TECH= CONGRA: i=400\n  o For TECH= NMSIMP: i=1000 \n  \nThese default values are also valid when i is specified as a missing value."},"StatementOptionType":"V"},{"StatementOptionName":"MAXSTEP=","StatementOptionHelp":{"#cdata":"[Syntax: MAXSTEP=r[n]] \n          \nSpecifies an upper bound for the step length of the line-search algorithms during \nthe first n iterations."},"StatementOptionType":"V"},{"StatementOptionName":"MAXTIME=","StatementOptionHelp":{"#cdata":"[Syntax: MAXTIME=r] \n          \nRequires the CPU time to be no larger than r. The default value of the MAXTIME= option \nis the largest double floating-point number on your computer. Note that the time specified \nby the MAXTIME= option is checked only once at the end of each iteration. Therefore, the \nactual running time can be much longer than that specified by the MAXTIME= option. The \nactual running time includes the rest of the time needed to finish the iteration and the \ntime needed to generate the output of the results."},"StatementOptionType":"V"},{"StatementOptionName":"MINITER=|MINIT=","StatementOptionHelp":{"#cdata":"[Syntax: MINITER= | MINIT=i] \n          \nSpecifies the minimum number of iterations. The default value is 0. If you request more \niterations than are actually needed for convergence to a stationary point, the optimization \nalgorithms can behave strangely. For example, the effect of rounding errors can prevent the \nalgorithm from continuing for the required number of iterations."},"StatementOptionType":"V"},{"StatementOptionName":"NOPRINT","StatementOptionHelp":{"#cdata":"Suppresses the output."},"StatementOptionType":"S"},{"StatementOptionName":"PALL","StatementOptionHelp":{"#cdata":"[Displays all optional output for optimization."},"StatementOptionType":"S"},{"StatementOptionName":"PHISTORY","StatementOptionHelp":{"#cdata":"Displays the optimization history."},"StatementOptionType":"S"},{"StatementOptionName":"PHISTPARMS","StatementOptionHelp":{"#cdata":"Display parameter estimates in each iteration."},"StatementOptionType":"S"},{"StatementOptionName":"PINIT","StatementOptionHelp":{"#cdata":"Displays the initial values and derivatives (if available)."},"StatementOptionType":"S"},{"StatementOptionName":"PSHORT","StatementOptionHelp":{"#cdata":"Restricts the amount of default output."},"StatementOptionType":"S"},{"StatementOptionName":"PSUMMARY","StatementOptionHelp":{"#cdata":"Restricts the amount of default displayed output to a short form of iteration history and \nnotes, warnings, and errors."},"StatementOptionType":"S"},{"StatementOptionName":"RESTART=|REST=","StatementOptionHelp":{"#cdata":"[Syntax: RESTART= | REST=i > 0] \n          \nSpecifies that the QUANEW or CONGRA algorithm is restarted with a steepest descent/ascent \nsearch direction after, at most, i iterations, i > 0."},"StatementOptionType":"V"},{"StatementOptionName":"SOCKET=","StatementOptionHelp":{"#cdata":"Specifies the fileref that contains the information needed for remote monitoring."},"StatementOptionType":"V"},{"StatementOptionName":"TECHNIQUE=|TECH=","StatementOptionHelp":{"#cdata":"[Syntax: TECHNIQUE= | TECH=name] \n          \nSpecifies the optimization technique."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"CONGRA","@Value2":"DBLDOG","@Value3":"NMSIMP","@Value4":"NEWRAP","@Value5":"NRRIDG","@Value6":"QUANEW","@Value7":"TRUREG","@Value8":"NONE"},"StatementOptionToolTips":{"@ToolTip1":"Chooses one of four different conjugate-gradient optimization algorithms, which can be more  precisely defined with the UPDATE= option and modified with the LINESEARCH= option.","@ToolTip2":"Performs a version of double-dogleg optimization, which uses the gradient to update an approximation  of the Cholesky factor of the Hessian.","@ToolTip3":"Performs a Nelder-Mead simplex optimization.","@ToolTip4":"Performs a usually stable but, for large problems, memory- and time-consuming Newton-Raphson  optimization technique. The algorithm combines a line-search algorithm with ridging, and it  can be modified with the LINESEARCH= option.","@ToolTip5":"Performs a usually stable but, for large problems, memory- and time-consuming Newton-Raphson  optimization technique. This algorithm does not perform a line search.","@ToolTip6":"Chooses one of four different quasi-Newton optimization algorithms that can be more precisely  defined with the UPDATE= option and modified with the LINESEARCH= option.","@ToolTip7":"Performs a usually very stable but, for large problems, memory- and time-consuming trust-region  optimization technique. The algorithm is implemented similar to Gay (1983) and Moré and Sorensen  (1983).","@ToolTip8":"Does not perform any optimization. This option is similar to METHOD=NONE, but TECH=NONE also  computes and displays residuals and goodness of fit statistics."}},{"StatementOptionName":"UPDATE=|UPD=","StatementOptionHelp":{"#cdata":"Specifies the update method for the quasi-Newton, double-dogleg, or conjugate-gradient \noptimization technique."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"BFGS","@Value2":"DBFGS","@Value3":"DDFP","@Value4":"DFP","@Value5":"PB","@Value6":"FR","@Value7":"PR","@Value8":"CD"},"StatementOptionToolTips":{"@ToolTip1":"Performs the original Broyden, Fletcher, Goldfarb, and Shanno (BFGS) update of the inverse  Hessian matrix.","@ToolTip2":"Performs the dual BFGS update of the Cholesky factor of the Hessian matrix. This is the  default update method.","@ToolTip3":"Performs the dual Davidon, Fletcher, and Powell (DFP) update of the Cholesky factor of  the Hessian matrix.","@ToolTip4":"Performs the original DFP update of the inverse Hessian matrix.","@ToolTip5":"Performs the automatic restart update method of Powell (1977) and Beale (1972).","@ToolTip6":"Performs the Fletcher-Reeves update (Fletcher 1987).","@ToolTip7":"Performs the Polak-Ribiere update (Fletcher 1987).","@ToolTip8":"Performs a conjugate-descent update of Fletcher (1987)."}},{"StatementOptionName":"XCONV=|XTOL=","StatementOptionHelp":{"#cdata":"[Syntax: XCONV= | XTOL=r[n]] \n          \nSpecifies the relative parameter convergence criterion. For all techniques except NMSIMP, \ntermination requires a small relative parameter change in subsequent iterations. The default \nvalue is r=1E-8 for the NMSIMP technique and r=0 otherwise. The optional integer value n \nspecifies the number of successive iterations for which the criterion must be satisfied \nbefore the process can be terminated. "},"StatementOptionType":"V"},{"StatementOptionName":"XSIZE=","StatementOptionHelp":{"#cdata":"[Syntax: XSIZE=r > 0] \n          \nSpecifies the XSIZE parameter of the relative parameter termination criterion. The default \nvalue is r=0."},"StatementOptionType":"V"}]}},{"StatementName":"OUTLIER","StatementHelp":{"#cdata":"Syntax: OUTLIER <options> ; \n\nThe OUTLIER statement enables you to control the reporting of the additive outliers (AO) and level \nshifts (LS) in the response series. The AOs are searched by default. You can turn on the search for \nLSs by using the CHECKBREAK option in the LEVEL statement."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=significance-level] \n          \nSpecifies the significance level for reporting the outliers. The default is 0.05."},"StatementOptionType":"V"},{"StatementOptionName":"MAXNUM=","StatementOptionHelp":{"#cdata":"[Syntax: MAXNUM=number] \n          \nLimits the number of outliers to search. The default is MAXNUM=5."},"StatementOptionType":"V"},{"StatementOptionName":"MAXPCT=","StatementOptionHelp":{"#cdata":"[Syntax: MAXPCT=number] \n          \nIs similar to the MAXNUM= option. In the MAXPCT= option you can limit the number of outliers \nto search for according to a percentage of the series length. The default is MAXPCT=1. When \nboth of these options are specified, the minimum of the two search numbers is used."},"StatementOptionType":"V"},{"StatementOptionName":"PRINT=","StatementOptionHelp":{"#cdata":"Enables you to control the printed output of the outlier search."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"SHORT","@Value2":"DETAIL"},"StatementOptionToolTips":{"@ToolTip1":"Produces an outlier summary table containing the most significant outliers, either AO or LS,  discovered in the outlier search.","@ToolTip2":"Produces, in addition to the outlier summary table, separate tables containing the AO and LS  structural break chi² statistics computed at each time point in the estimation span."}}]}},{"StatementName":"RANDOMREG","StatementHelp":{"#cdata":"Syntax: RANDOMREG regressors </ options > ; \n\nThe RANDOMREG statement is used to specify regressors with time-varying regression coefficients. \nEach regression coefficient is assumed to evolve as a random walk."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"NOEST","StatementOptionHelp":{"#cdata":"Fixes the value of σ² to the value specified in the VARIANCE= option."},"StatementOptionType":"S"},{"StatementOptionName":"PLOT=","StatementOptionHelp":{"#cdata":"Requests plotting of the filtered or smoothed estimate of the time-varying regression coefficient."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FILTER","@Value2":"SMOOTH","@Value3":"(<FILTER> <SMOOTH>)"},"StatementOptionToolTips":{"@ToolTip1":"Requests plotting of the filtered estimate of the time-varying regression coefficient.","@ToolTip2":"Requests plotting of the smoothed estimate of the time-varying regression coefficient.","@ToolTip3":"Requests plotting of the filtered and smoothed estimates of the time-varying regression   coefficient."}},{"StatementOptionName":"PRINT=","StatementOptionHelp":{"#cdata":"Requests printing of the filtered or smoothed estimate of the time-varying regression coefficient."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FILTER","@Value2":"SMOOTH","@Value3":"(<FILTER> <SMOOTH>)"},"StatementOptionToolTips":{"@ToolTip1":"Requests printing of the filtered estimate of the time-varying regression coefficient.","@ToolTip2":"Requests printing of the smoothed estimate of the time-varying regression coefficient.","@ToolTip3":"Requests printing of the filtered and smoothed estimates of the time-varying regression  coefficient."}},{"StatementOptionName":"VARIANCE=","StatementOptionHelp":{"#cdata":"[Syntax: VARIANCE=value] \n          \nSpecifies an initial value for σ² during the parameter estimation process. Any nonnegative \nvalue, including zero, is an acceptable starting value."},"StatementOptionType":"V"}]}},{"StatementName":"SEASON","StatementHelp":{"#cdata":"Syntax: SEASON LENGTH = integer <options> ; \n\nThe SEASON or SEASONAL statement is used to specify a seasonal component, γt, in the model. \nA seasonal component can be one of the two types, DUMMY or TRIG."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DROPHARMONICS=|DROPH=","StatementOptionHelp":{"#cdata":"[Syntax: DROPHARMONICS|DROPH=number-list |  n TO m BY p] \n          \nEnables you to drop some harmonics γ-j,t from the full set of harmonics used to obtain \na trigonometric seasonal. The drop list can include any integer between 1 and [s/2], s \nbeing the season length."},"StatementOptionType":"V"},{"StatementOptionName":"KEEPHARMONICS=|KEEPH=","StatementOptionHelp":{"#cdata":"[Syntax: KEEPHARMONICS|KEEPH=number-list |  n TO m BY p] \n          \nEnables you to keep only the harmonics γ-j,t listed in the option to obtain a trigonometric \nseasonal. The keep list can include any integer between 1 and [s/2], s being the season length."},"StatementOptionType":"V"},{"StatementOptionName":"LENGTH=","StatementOptionHelp":{"#cdata":"[Syntax: LENGTH=integer] \n          \nSpecifies the season length, s. This is a required option in this statement. The season \nlength can be any integer greater than or equal to 2. Typical examples of season lengths \nare 12, corresponding to the monthly seasonality, or 4, corresponding to the quarterly \nseasonality."},"StatementOptionType":"V"},{"StatementOptionName":"NOEST","StatementOptionHelp":{"#cdata":"Fixes the value of the disturbance variance parameter to the value specified in the VARIANCE= option."},"StatementOptionType":"S"},{"StatementOptionName":"PLOT=","StatementOptionHelp":{"#cdata":"Requests plots of the season component. When you specify only one plot request, you can omit the parentheses around the plot request."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FILTER","@Value2":"SMOOTH","@Value3":"F_ANNUAL","@Value4":"S_ANNUAL","@Value5":"(<FILTER> <SMOOTH> <F_ANNUAL> <S_ANNUAL>)"},"StatementOptionToolTips":{"@ToolTip1":"Requests plot of the filtered estimates of the season component, γt.","@ToolTip2":"Requests plot of the smoothed estimates of the season component, γt.","@ToolTip3":"Requests plot of the \"annual\" variation in the filtered estimates of the season component, γt.","@ToolTip4":"Requests plot of the \"annual\" variation in the smoothed estimates of the season component, γt.","@ToolTip5":"Requests plots for a combination of FILTER, SMOOTH, F_ANNUAL, and S_ANNUAL plot-requests."}},{"StatementOptionName":"PRINT=HARMONICS","StatementOptionHelp":{"#cdata":"Requests printing of the summary of harmonics present in the seasonal component. This option \nis valid only for the trigonometric seasonal component."},"StatementOptionType":"V"},{"StatementOptionName":"PRINT=","StatementOptionHelp":{"#cdata":"Requests printing of the filtered or smoothed estimate of the seasonal component, γt."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FILTER","@Value2":"SMOOTH","@Value3":"(<FILTER SMOOTH>)"},"StatementOptionToolTips":{"@ToolTip1":"Requests printing of the filtered estimate of the seasonal component, γt.","@ToolTip2":"Requests printing of the smoothed estimate of the seasonal component, γt.","@ToolTip3":"Requests printing of the filtered and smoothed estimates of the seasonal component, γt."}},{"StatementOptionName":"TYPE=","StatementOptionHelp":{"#cdata":"Specifies the type of the seasonal component. The default type is DUMMY."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"DUMMY","@Value2":"TRIG"},"StatementOptionToolTips":{"@ToolTip1":"DUMMY [No description available]","@ToolTip2":"TRIG [No description available]"}},{"StatementOptionName":"VARIANCE=","StatementOptionHelp":{"#cdata":"[Syntax: VARIANCE=value] \n          \nSpecifies an initial value for the disturbance variance, σ²ω, σ in the γt equation\nat the start of the parameter estimation process. Any nonnegative value, including \nzero, is an acceptable starting value."},"StatementOptionType":"V"}]}},{"StatementName":"SLOPE","StatementHelp":{"#cdata":"Syntax: SLOPE <options> ; \n\nThe SLOPE statement is used to include a slope component in the model. The slope component cannot \nbe used without the level component (see the LEVEL statement). The level and slope specifications \njointly define the trend component of the model. A SLOPE statement without the accompanying LEVEL\nstatement is ignored."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"NOEST","StatementOptionHelp":{"#cdata":"Fixes the value of the disturbance variance, σ²ξ, to the value specified in the VARIANCE= option."},"StatementOptionType":"S"},{"StatementOptionName":"PLOT=","StatementOptionHelp":{"#cdata":"Requests plotting of the filtered or smoothed estimate of the slope component."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FILTER","@Value2":"SMOOTH","@Value3":"(<FILTER> <SMOOTH>)"},"StatementOptionToolTips":{"@ToolTip1":"Requests plotting of the filtered estimate of the slope component.","@ToolTip2":"Requests plotting of the smoothed estimate of the slope component.","@ToolTip3":"Requests plotting of the filtered and smoothed estimates of the slope component."}},{"StatementOptionName":"PRINT=","StatementOptionHelp":{"#cdata":"Requests printing of the filtered or smoothed estimate of the slope component, βt."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FILTER","@Value2":"SMOOTH","@Value3":"(<FILTER> <SMOOTH>)"},"StatementOptionToolTips":{"@ToolTip1":"Requests printing of the filtered estimate of the slope component.","@ToolTip2":"Requests printing of the smoothed estimate of the slope component.","@ToolTip3":"Requests printing of the filtered and smoothed estimates of the slope component."}},{"StatementOptionName":"VARIANCE=","StatementOptionHelp":{"#cdata":"[Syntax: VARIANCE=value] \n          \nSpecifies an initial value for the disturbance variance, σ²ξ, in the βt equation at the start of the \nparameter estimation process. Any nonnegative value, including zero, is an acceptable starting value."},"StatementOptionType":"V"}]}},{"StatementName":"SPLINEREG","StatementHelp":{"#cdata":"Syntax: SPLINEREG regressor <options> ; \n\nThe SPLINEREG statement is used to specify a regressor that has a nonlinear relationship with\nthe dependent series that can be approximated by a given β-spline. If the specified spline has \ndegree d and is based on n internal knots, then it is known that it can be written as a linear \ncombination of (n + d + 1) regressors that are derived from the original regressor. The span of \nthese (n + d + 1) derived regressors includes constant; therefore, to avoid multicollinearity \nwith the level component, one of these regressors is dropped. Specifying the SPLINEREG statement \nis equivalent to specifying a RANDOMREG statement with these derived regressors. There can be \nmultiple SPLINEREG statements. You must specify at least one interior knot, either using the \nNKNOTS= option or the KNOTS= option."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DEGREE=","StatementOptionHelp":{"#cdata":"[Syntax: DEGREE=integer] \n          \nSpecifies the degree of the spline. It can be any integer larger than or equal to zero. The \ndefault value is 3. The polynomial degree should be a small integer, usually 0, 1, 2, or 3. \nLarger values are rarely useful. If you have any doubt as to what degree to specify, use the \ndefault."},"StatementOptionType":"V"},{"StatementOptionName":"KNOTS=","StatementOptionHelp":{"#cdata":"[Syntax: KNOTS=number-list |  n TO m BY p] \n          \nSpecifies the interior knots or break points. The values in the knot list must be \nnondecreasing and must lie between the minimum and the maximum of the spline regressor \nvalues in the input data set. The first time you specify a value in the knot list, it \nindicates a discontinuity in the th (from DEGREE=n) derivative of the transformation \nfunction at the value of the knot. The second mention of a value indicates a discontinuity \nin the th derivative of the transformation function at the value of the knot. Knots can \nbe repeated any number of times for decreasing smoothness at the break points, but the \nvalues in the knot list can never decrease. \n\nYou cannot use the KNOTS= option with the NKNOTS= option. You should keep the number of \nknots small."},"StatementOptionType":"V"},{"StatementOptionName":"NKNOTS=","StatementOptionHelp":{"#cdata":"[Syntax: NKNOTS=m] \n          \nCreates m knots, the first at the 100/(m+1) percentile, the second at the 200/(m+1) \npercentile, and so on. Knots are always placed at data values; there is no interpolation. \nFor example, if NKNOTS=3, knots are placed at the 25th percentile, the median, and the \n75th percentile. The value specified for the NKNOTS= option must be ≥ 1. You cannot use \nthe NKNOTS=option with the KNOTS= option."},"StatementOptionType":"V"},{"StatementOptionName":"NOEST","StatementOptionHelp":{"#cdata":"Fixes the value of the regression coefficient random walk disturbance variance to the value \nspecified in the VARIANCE= option."},"StatementOptionType":"S"},{"StatementOptionName":"PLOT=","StatementOptionHelp":{"#cdata":"Requests plotting of the filtered or smoothed estimate of the time-varying regression coefficient."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FILTER","@Value2":"SMOOTH","@Value3":"(<FILTER> <SMOOTH>)"},"StatementOptionToolTips":{"@ToolTip1":"Requests plotting of the filtered estimate of the time-varying regression coefficient.","@ToolTip2":"Requests plotting of the smoothed estimate of the time-varying regression coefficient.","@ToolTip3":"Requests plotting of the filtered and smoothed estimates of the time-varying regression  coefficient."}},{"StatementOptionName":"PRINT=","StatementOptionHelp":{"#cdata":"Requests printing of the filtered or smoothed estimate of the time-varying regression coefficient."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FILTER","@Value2":"SMOOTH","@Value3":"(FILTER SMOOTH)"},"StatementOptionToolTips":{"@ToolTip1":"Requests printing of the filtered estimate of the time-varying regression coefficient.","@ToolTip2":"Requests printing of the smoothed estimate of the time-varying regression coefficient.","@ToolTip3":"Requests printing of the filtered and smoothed estimates of the time-varying regression  coefficient."}},{"StatementOptionName":"VARIANCE=","StatementOptionHelp":{"#cdata":"[Syntax: VARIANCE=value] \n          \nSpecifies an initial value for the regression coefficient random walk disturbance variance \nduring the parameter estimation process. Any nonnegative value, including zero, is an acceptable \nstarting value."},"StatementOptionType":"V"}]}},{"StatementName":"SPLINESEASON","StatementHelp":{"#cdata":"Syntax: SPLINESEASON LENGTH = integer KNOTS=   ... <options> ; \n\nThe SPLINESEASON statement is used to specify a seasonal pattern that is to be approximated \nby a given β-spline. If the specified spline has degree d and is based on n internal knots, \nthen it can be written as a linear combination of (n + d) regressors that are derived from \nthe seasonal dummy regressors. The SPLINESEASON specification is equivalent to specifying a \nRANDOMREG specification with these derived regressors. Such approximation is useful only if \nthe season length is relatively large, at least larger than (n + d)."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DEGREE=","StatementOptionHelp":{"#cdata":"[Syntax: DEGREE=integer] \n          \nSpecifies the degree of the spline. It can be any integer larger than or equal to zero. \nThe default value is 3."},"StatementOptionType":"V"},{"StatementOptionName":"KNOTS=","StatementOptionHelp":{"#cdata":"[Syntax: KNOTS=integer-1 integer-2 ...] \n          \nLists the internal knots. This list of values must be a nondecreasing sequence of \nintegers within the range of 2 to (s - 1), where s is the season length specified \nin the LENGTH= option. This is a required option in this statement."},"StatementOptionType":"V"},{"StatementOptionName":"LENGTH=","StatementOptionHelp":{"#cdata":"[Syntax: LENGTH=integer] \n          \nSpecifies the season length, s. This is a required option in this statement. The length \ncan be any integer greater than or equal to three."},"StatementOptionType":"V"},{"StatementOptionName":"NOEST","StatementOptionHelp":{"#cdata":"Fixes the value of the regression coefficient random walk disturbance variance to the value \nspecified in the VARIANCE= option."},"StatementOptionType":"S"},{"StatementOptionName":"OFFSET=","StatementOptionHelp":{"#cdata":"[Syntax: OFFSET=integer] \n          \nSpecifies the position of the first measurement within the season, if the first measurement \nis not at the start of the season. The OFFSET= value must be between one and the season length. \nThe default value is one. The first measurement refers to the start of the estimation span and \nthe forecast span. If these spans differ, their starting measurements must be separated by an \ninteger multiple of the season length."},"StatementOptionType":"V"},{"StatementOptionName":"PLOT=","StatementOptionHelp":{"#cdata":"Requests plotting of the filtered or smoothed estimate of the season component."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FILTER","@Value2":"SMOOTH","@Value3":"(<FILTER> <SMOOTH>)"},"StatementOptionToolTips":{"@ToolTip1":"Requests plotting of the filtered estimate of the season component.","@ToolTip2":"Requests plotting of the smoothed estimate of the season component.","@ToolTip3":"Requests plotting of the filtered and smoothed estimates of the season component."}},{"StatementOptionName":"PRINT=","StatementOptionHelp":{"#cdata":"Requests printing of the filtered or smoothed estimate of the spline season component."},"StatementOptionType":"V","StatementOptionValues":{"@Value1":"FILTER","@Value2":"SMOOTH","@Value3":"(FILTER SMOOTH)"},"StatementOptionToolTips":{"@ToolTip1":"Requests printing of the filtered estimate of the spline season component.","@ToolTip2":"Requests printing of the smoothed estimate of the spline season component.","@ToolTip3":"Requests printing of the filtered and smoothed estimates of the spline season component."}},{"StatementOptionName":"RKNOTS=","StatementOptionHelp":{"#cdata":"[Experimental][Syntax: RKNOTS=(knot, ..., knot ) ...(knot, ..., knot )] \n          \nSpecifies a grouping of knots such that the knots within the same group have identical \nseasonal values. The knots specified in this option must already be present in the list\nspecified by the KNOTS= option. The knot groups must be non-overlapping and without any \nrepeated knots."},"StatementOptionType":"V"},{"StatementOptionName":"VARIANCE=","StatementOptionHelp":{"#cdata":"[Syntax: VARIANCE=value] \n          \nSpecifies an initial value for the regression coefficient random walk disturbance variance \nduring the parameter estimation process. Any nonnegative value, including zero, is an acceptable \nstarting value."},"StatementOptionType":"V"}]}}]}}}