{"Procedure":{"Name":"VARCOMP","#comment":{},"ProductGroup":"SAS/STAT","ProcedureHelp":{"#cdata":"Syntax: PROC VARCOMP <options> ; \n    CLASS variables ; \n    MODEL dependent = <effects> </ options> ; \n    BY variables ; \n\nThe VARCOMP procedure handles general linear models that have random effects. Random \neffects are classification effects with levels that are assumed to be randomly selected \nfrom an infinite population of possible levels. PROC VARCOMP estimates the contribution \nof each of the random effects to the variance of the dependent variable. \n\nA single MODEL statement specifies the dependent variables and the effects: main effects, \ninteractions, and nested effects. The effects must be composed of classification variables; \nno continuous variables are allowed on the right side of the equal sign."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"DATA=","ProcedureOptionHelp":{"#cdata":"[Syntax: DATA=SAS-data-set] \n      \nSpecifies the input SAS data set to use. If this option is omitted, the most recently \ncreated SAS data set is used."},"ProcedureOptionType":"DV"},{"ProcedureOptionName":"EPSILON=","ProcedureOptionHelp":{"#cdata":"[Syntax: EPSILON=number] \n      \nSpecifies the convergence value of the objective function for METHOD=ML or METHOD=REML. \nBy default, EPSILON=1E-8."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"MAXITER=","ProcedureOptionHelp":{"#cdata":"[Syntax: MAXITER=number] \n      \nSpecifies the maximum number of iterations for METHOD=ML or METHOD=REML. \nBy default, MAXITER=50."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"METHOD=","ProcedureOptionHelp":{"#cdata":"Specifies which of the five methods (TYPE1, MIVQUE0, ML, REML, or GRR) you want to use."},"ProcedureOptionType":"V","ProcedureOptionValues":{"@Value1":"TYPE1","@Value2":"MIVQUE0","@Value3":"ML","@Value4":"REML","@Value5":"GRR"},"ProcedureOptionToolTips":{"@ToolTip1":"Applies to any random-effects model and design.","@ToolTip2":"Applies to any random-effects model and design.","@ToolTip3":"Applies to any random-effects model and design.","@ToolTip4":"Applies to any random-effects model and design.","@ToolTip5":"[Syntax: GRR<(options)>]                                  Provides a specialized analysis only for certain designs.  You can specify the following options in parentheses after METHOD=GRR.     SPECLIMITS=(LSL,USL,<k>)   SL=(LSL,USL,<k>)   specifies the specification limits for the first random factor, which is regarded as the product    being tested in the gauge R and R study.     RATIO    specifies that certain additional ratios of variance components should also be computed and displayed,    such as proportion of total variance due to the process."},"SubOptionsKeywords":"SPECLIMITS=|SL=|RATIO"}]},"ProcedureStatements":{"ProcedureStatement":[{"StatementName":"BY","StatementHelp":{"#cdata":"Syntax: BY <DESCENDING> variable-1 <...<DESCENDING> variable-n> <NOTSORTED>; \n      \nYou can specify a BY statement with PROC VARCOMP to obtain separate analyses on \nobservations in groups that are defined by the BY variables. When a BY statement \nappears, the procedure expects the input data set to be sorted in order of the BY \nvariables. If you specify more than one BY statement, only the last one specified \nis used."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"DESCENDING","StatementOptionHelp":{"#cdata":"Specifies that the observations are sorted in descending order by the variable that \nimmediately follows the word DESCENDING in the BY statement."},"StatementOptionType":"S"},{"StatementOptionName":"NOTSORTED","StatementOptionHelp":{"#cdata":"Specifies that observations are not necessarily sorted in alphabetic or numeric order."},"StatementOptionType":"S"}]}},{"StatementName":"CLASS","StatementHelp":{"#cdata":"Syntax: CLASS variables ;\n      \nThe CLASS statement specifies the classification variables to be used in the analysis. \nAll effects in the MODEL statement must be composed of effects that appear in the CLASS \nstatement. Classification variables can be either numeric or character; if they are \ncharacter, only the first 16 characters are used. \n\nNumeric classification variables are not restricted to integers since a variable’s \nformat determines the levels."},"StatementOptions":null},{"StatementName":"MODEL","StatementHelp":{"#cdata":"Syntax: MODEL dependent = <effects> </ options> ;\n      \nThe MODEL statement gives the dependent variables and independent effects. If you \nspecify more than one dependent variable, a separate analysis is performed for each \none. The independent effects are limited to main effects, interactions, and nested \neffects; no continuous effects are allowed. All independent effects must be composed \nof effects that appear in the CLASS statement. Effects are specified in the VARCOMP \nprocedure in the same way as described for the ANOVA procedure. Only one MODEL \nstatement is allowed."},"StatementOptions":{"StatementOption":[{"StatementOptionName":"FIXED=","StatementOptionHelp":{"#cdata":"[Syntax: FIXED=n] \n          \nSpecifies that the first n effects in the MODEL statement are fixed effects."},"StatementOptionType":"V"},{"StatementOptionName":"CL=","StatementOptionHelp":{"#cdata":"Specifies that confidence limits for all of the parameters of interest should be \ncomputed and displayed. It also optionally specifies the method to use for \ncomputing the confidence limits. \n\nThe CL option applies only to balanced one-way or two-way designs for METHOD=TYPE1 or GRR."},"StatementOptionType":"S|V","StatementOptionValues":{"@Value1":"MLS","@Value2":"GCL"},"StatementOptionToolTips":{"@ToolTip1":"Specifies the modified large-sample (MLS) method for computing the confidence limits.","@ToolTip2":"Specifies the generalized confidence limits (GCL) method for computing the confidence limits.                                      You can specify the following options in parentheses after CL=GCL.     NSAMPLE=n    specifies the sample size for generalized pivot quantities (GPQ) sampling. The default    value is 12,605.     EPSILON=number    specifies a small positive value used in some GPQ computations. The default value is 0.001."},"SubOptionsKeywords":"NSAMPLE=|EPSILON="},{"StatementOptionName":"ALPHA=","StatementOptionHelp":{"#cdata":"[Syntax: ALPHA=α] \n          \nSpecifies the level of significance α for (1-α)100% two-sided confidence limits. The value of \nα must be between 0 and 1. By default, α is equal to 0.05."},"StatementOptionType":"V"}]}}]}}}