{"Procedure":{"Name":"XSL","ProductGroup":"BASE","#comment":{},"ProcedureHelp":{"#cdata":"Syntax: PROC XSL IN=fileref | 'external-file' OUT=fileref | 'external-file' XSL=fileref | 'external-file'; \n  PARAMETER 'parameter'='value';\n\nThe XSL procedure transforms an XML document into another format, such as HTML, text, or another \nXML document type. PROC XSL reads an input XML document, transforms it by using an XSL style sheet, \nand then writes the output. \n\nTo transform the XML document, PROC XSL uses the Saxon-EE version 9.3 software application from \nSaxonica, which is a collection of tools for processing XML documents. The XSLT processor implements \nthe XSLT 2.0 standard."},"ProcedureOptions":{"ProcedureOption":[{"ProcedureOptionName":"IN=","ProcedureOptionHelp":{"#cdata":"Syntax: IN=fileref | 'external-file' \n      \nSpecifies the input file. The file must be a well-formed XML document. \n\nfileref\n  specifies the SAS fileref that is assigned to the input XML document. To assign a fileref, \n  use the FILENAME statement. \n  \n'external-file'\n  is the physical location of the input XML document. Include the complete pathname and the \n  filename. Enclose the physical name in single or double quotation marks. The maximum length \n  is 200 characters."},"ProcedureOptionType":"V"},{"ProcedureOptionName":"OUT=","ProcedureOptionHelp":{"#cdata":"Syntax: OUT=fileref | 'external-file' \n      \nSpecifies the output file. \n\nfileref\n  specifies the SAS fileref that is assigned to the input XML document. To assign a fileref, \n  use the FILENAME statement. \n  \n'external-file'\n  is the physical location of the output file. Include the complete pathname and the filename. \n  Enclose the physical name in single or double quotation marks. The maximum length is 200 \n  characters."},"ProcedureOptionType":"V"}]},"ProcedureStatements":{"ProcedureStatement":{"StatementName":"PARAMETER","StatementHelp":{"#cdata":"Syntax: PARAMETER 'parameter’=’value'; \n\nChanges instances of a parameter in an XSL style sheet to a specified value.\n\nRequired Argument:\n'parameter'='value'\n  specifies the parameter name and a value to be passed to the XSL style sheet. PROC XSL changes \n  instances of the parameter in the style sheet to the specified value. The specified parameter \n  must exist in the XSL style sheet. Enclose the parameter name in single or double quotation \n  marks. The specified value can be a character string or a numeric value. Enclose the value in \n  single or double quotation marks if the value is a character string."},"StatementOptions":null}}}}